[
    {"clean_prefix":"Dann gingen Richard und Erica ins Krankenhaus. Richard gab ein Getränk an","patch_prefix":"Dann gingen Matthew und Crystal ins Krankenhaus. Megan gab ein Getränk an","clean_answer":" Erica","patch_answer":" Richard","case":"BABA_16"},
    {"clean_prefix":"Dann gingen John und Eric zur Station. John gab einen Knochen an","patch_prefix":"Dann gingen Rachel und Andrea zur Station. Megan gab einen Knochen an","clean_answer":" Eric","patch_answer":" John","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jason und Jamie in den Garten. Jason gab eine Halskette an","patch_prefix":"Dann gingen Michael und Jonathan in den Garten. Michelle gab eine Halskette an","clean_answer":" Jamie","patch_answer":" Jason","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Matthew und Jennifer zur Station. Matthew gab einen Kuss an","patch_prefix":"Dann gingen Katherine und Alicia zur Station. Katherine gab einen Kuss an","clean_answer":" Jennifer","patch_answer":" Matthew","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Lisa und Jason ins Restaurant. Lisa gab einen Computer an","patch_prefix":"Dann gingen Christine und Justin ins Restaurant. Kyle gab einen Computer an","clean_answer":" Jason","patch_answer":" Lisa","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Richard und Kyle zur Station. Richard gab eine Halskette an","patch_prefix":"Dann gingen Mary und Erin zur Station. Sara gab eine Halskette an","clean_answer":" Kyle","patch_answer":" Richard","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Joseph und Amber in den Garten. Joseph gab einen Computer an","patch_prefix":"Dann gingen Michael und Lindsay in den Garten. Rachel gab einen Computer an","clean_answer":" Amber","patch_answer":" Joseph","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Anthony und Mark ins Haus. Anthony gab einen Basketball an","patch_prefix":"Dann gingen Elizabeth und Laura ins Haus. Robert gab einen Basketball an","clean_answer":" Mark","patch_answer":" Anthony","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Brittany und Shannon zur Station. Brittany gab einen Knochen an","patch_prefix":"Dann gingen Charles und Aaron zur Station. Timothy gab einen Knochen an","clean_answer":" Shannon","patch_answer":" Brittany","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Andrea und Sara zur Station. Andrea gab eine Halskette an","patch_prefix":"Dann gingen Adam und Erin zur Station. Bryan gab eine Halskette an","clean_answer":" Sara","patch_answer":" Andrea","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Kristen und Robert ins Restaurant. Kristen gab einen Computer an","patch_prefix":"Dann gingen Justin und Andrew ins Restaurant. Andrea gab einen Computer an","clean_answer":" Robert","patch_answer":" Kristen","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Lindsey und Kristen ins Restaurant. Lindsey gab einen Knochen an","patch_prefix":"Dann gingen Andrea und Kelly ins Restaurant. Rebecca gab einen Knochen an","clean_answer":" Kristen","patch_answer":" Lindsey","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Adam und Stephen ins Krankenhaus. Adam gab einen Kuss an","patch_prefix":"Dann gingen David und Timothy ins Krankenhaus. Lisa gab einen Kuss an","clean_answer":" Stephen","patch_answer":" Adam","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Cody und Amy ins Haus. Cody gab einen Snack an","patch_prefix":"Dann gingen David und Nicholas ins Haus. Eric gab einen Snack an","clean_answer":" Amy","patch_answer":" Cody","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Lisa und Sarah ins Haus. Lisa gab einen Kuss an","patch_prefix":"Dann gingen Gregory und Tyler ins Haus. Daniel gab einen Kuss an","clean_answer":" Sarah","patch_answer":" Lisa","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Courtney und William zur Schule. Courtney gab eine Halskette an","patch_prefix":"Dann gingen Jesse und Sarah zur Schule. Alicia gab eine Halskette an","clean_answer":" William","patch_answer":" Courtney","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Daniel und Elizabeth zur Station. Daniel gab ein Getränk an","patch_prefix":"Dann gingen Heather und Amanda zur Station. Jacob gab ein Getränk an","clean_answer":" Elizabeth","patch_answer":" Daniel","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Allison und Kimberly in den Garten. Allison gab eine Halskette an","patch_prefix":"Dann gingen Nicholas und Jeremy in den Garten. Rebecca gab eine Halskette an","clean_answer":" Kimberly","patch_answer":" Allison","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Adam und Nicholas ins Büro. Adam gab einen Snack an","patch_prefix":"Dann gingen Kristen und Courtney ins Büro. Justin gab einen Snack an","clean_answer":" Nicholas","patch_answer":" Adam","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Steven und Brian in den Garten. Steven gab einen Computer an","patch_prefix":"Dann gingen Nicole und Tyler in den Garten. Christopher gab einen Computer an","clean_answer":" Brian","patch_answer":" Steven","case":"BABA_16"},
    {"clean_prefix":"Dann gingen James und Michael ins Geschäft. James gab einen Knochen an","patch_prefix":"Dann gingen Jacob und Brian ins Geschäft. Patrick gab einen Knochen an","clean_answer":" Michael","patch_answer":" James","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Lauren und Amanda zur Schule. Lauren gab einen Kuss an","patch_prefix":"Dann gingen Brittany und Patrick zur Schule. Brandon gab einen Kuss an","clean_answer":" Amanda","patch_answer":" Lauren","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Elizabeth und Bradley ins Restaurant. Elizabeth gab eine Halskette an","patch_prefix":"Dann gingen Travis und Benjamin ins Restaurant. Heather gab eine Halskette an","clean_answer":" Bradley","patch_answer":" Elizabeth","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Courtney und Michelle zur Schule. Courtney gab einen Ring an","patch_prefix":"Dann gingen Jonathan und Richard zur Schule. Michael gab einen Ring an","clean_answer":" Michelle","patch_answer":" Courtney","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Kenneth und Katherine ins Büro. Kenneth gab einen Computer an","patch_prefix":"Dann gingen Samuel und Jeffrey ins Büro. Nicholas gab einen Computer an","clean_answer":" Katherine","patch_answer":" Kenneth","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jacob und Vanessa ins Krankenhaus. Jacob gab ein Getränk an","patch_prefix":"Dann gingen Samuel und Michelle ins Krankenhaus. Danielle gab ein Getränk an","clean_answer":" Vanessa","patch_answer":" Jacob","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Steven und David ins Restaurant. Steven gab einen Knochen an","patch_prefix":"Dann gingen Sarah und Brittany ins Restaurant. Tyler gab einen Knochen an","clean_answer":" David","patch_answer":" Steven","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Samantha und Joshua in den Garten. Samantha gab einen Kuss an","patch_prefix":"Dann gingen Jeffrey und Mary in den Garten. Amber gab einen Kuss an","clean_answer":" Joshua","patch_answer":" Samantha","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Tyler und Justin ins Büro. Tyler gab eine Halskette an","patch_prefix":"Dann gingen Joshua und Lindsay ins Büro. Bradley gab eine Halskette an","clean_answer":" Justin","patch_answer":" Tyler","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Amy und John ins Restaurant. Amy gab eine Halskette an","patch_prefix":"Dann gingen Sara und Aaron ins Restaurant. Timothy gab eine Halskette an","clean_answer":" John","patch_answer":" Amy","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Eric und Erica zur Station. Eric gab einen Computer an","patch_prefix":"Dann gingen Scott und Tyler zur Station. Sara gab einen Computer an","clean_answer":" Erica","patch_answer":" Eric","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Benjamin und Jason zur Schule. Benjamin gab einen Knochen an","patch_prefix":"Dann gingen Nicole und Michelle zur Schule. Vanessa gab einen Knochen an","clean_answer":" Jason","patch_answer":" Benjamin","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Steven und Katie ins Büro. Steven gab einen Knochen an","patch_prefix":"Dann gingen Jeffrey und Shannon ins Büro. Joseph gab einen Knochen an","clean_answer":" Katie","patch_answer":" Steven","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Mark und Amber in den Garten. Mark gab eine Halskette an","patch_prefix":"Dann gingen Shannon und Timothy in den Garten. Tyler gab eine Halskette an","clean_answer":" Amber","patch_answer":" Mark","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Erica und Patrick ins Krankenhaus. Erica gab einen Basketball an","patch_prefix":"Dann gingen Vanessa und Crystal ins Krankenhaus. Joshua gab einen Basketball an","clean_answer":" Patrick","patch_answer":" Erica","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Thomas und Angela ins Geschäft. Thomas gab einen Knochen an","patch_prefix":"Dann gingen Samuel und Kenneth ins Geschäft. John gab einen Knochen an","clean_answer":" Angela","patch_answer":" Thomas","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Angela und Alicia ins Büro. Angela gab einen Snack an","patch_prefix":"Dann gingen Stephanie und Cody ins Büro. Samuel gab einen Snack an","clean_answer":" Alicia","patch_answer":" Angela","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Steven und Crystal ins Krankenhaus. Steven gab einen Ring an","patch_prefix":"Dann gingen Eric und Katherine ins Krankenhaus. Matthew gab einen Ring an","clean_answer":" Crystal","patch_answer":" Steven","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Lauren und Erica ins Haus. Lauren gab einen Ring an","patch_prefix":"Dann gingen Lindsay und Robert ins Haus. Laura gab einen Ring an","clean_answer":" Erica","patch_answer":" Lauren","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Angela und Katie ins Restaurant. Angela gab einen Kuss an","patch_prefix":"Dann gingen Thomas und Katherine ins Restaurant. Benjamin gab einen Kuss an","clean_answer":" Katie","patch_answer":" Angela","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Andrew und Megan zur Station. Andrew gab einen Basketball an","patch_prefix":"Dann gingen Andrea und Gregory zur Station. Stephanie gab einen Basketball an","clean_answer":" Megan","patch_answer":" Andrew","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Amber und Amy ins Büro. Amber gab einen Computer an","patch_prefix":"Dann gingen Tiffany und Rachel ins Büro. Brian gab einen Computer an","clean_answer":" Amy","patch_answer":" Amber","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Courtney und Stephanie ins Krankenhaus. Courtney gab einen Basketball an","patch_prefix":"Dann gingen Alicia und Kimberly ins Krankenhaus. Paul gab einen Basketball an","clean_answer":" Stephanie","patch_answer":" Courtney","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Alicia und Richard ins Restaurant. Alicia gab einen Computer an","patch_prefix":"Dann gingen Jennifer und Tiffany ins Restaurant. Joshua gab einen Computer an","clean_answer":" Richard","patch_answer":" Alicia","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Crystal und Brian in den Garten. Crystal gab einen Kuss an","patch_prefix":"Dann gingen Vanessa und Vanessa in den Garten. Gregory gab einen Kuss an","clean_answer":" Brian","patch_answer":" Crystal","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Daniel und Sara ins Büro. Daniel gab einen Snack an","patch_prefix":"Dann gingen Benjamin und Matthew ins Büro. Jason gab einen Snack an","clean_answer":" Sara","patch_answer":" Daniel","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jonathan und Samuel ins Geschäft. Jonathan gab einen Snack an","patch_prefix":"Dann gingen Kelly und Brandon ins Geschäft. Cody gab einen Snack an","clean_answer":" Samuel","patch_answer":" Jonathan","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Joshua und Lindsey zur Schule. Joshua gab einen Knochen an","patch_prefix":"Dann gingen Anthony und Jamie zur Schule. Christina gab einen Knochen an","clean_answer":" Lindsey","patch_answer":" Joshua","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Dustin und Jeffrey ins Büro. Dustin gab einen Computer an","patch_prefix":"Dann gingen Rachel und Kyle ins Büro. Katherine gab einen Computer an","clean_answer":" Jeffrey","patch_answer":" Dustin","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Kyle und Katherine ins Haus. Kyle gab eine Halskette an","patch_prefix":"Dann gingen Bradley und Ashley ins Haus. Ashley gab eine Halskette an","clean_answer":" Katherine","patch_answer":" Kyle","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Thomas und Amber ins Büro. Thomas gab einen Kuss an","patch_prefix":"Dann gingen Jeffrey und Matthew ins Büro. Cody gab einen Kuss an","clean_answer":" Amber","patch_answer":" Thomas","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jennifer und Jose ins Restaurant. Jennifer gab ein Getränk an","patch_prefix":"Dann gingen Michael und Nicole ins Restaurant. Bradley gab ein Getränk an","clean_answer":" Jose","patch_answer":" Jennifer","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Michelle und Jennifer ins Krankenhaus. Michelle gab einen Knochen an","patch_prefix":"Dann gingen Tiffany und Stephanie ins Krankenhaus. Sarah gab einen Knochen an","clean_answer":" Jennifer","patch_answer":" Michelle","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Ryan und Nicholas ins Büro. Ryan gab eine Halskette an","patch_prefix":"Dann gingen Brandon und Tyler ins Büro. Brandon gab eine Halskette an","clean_answer":" Nicholas","patch_answer":" Ryan","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Andrew und Amy zur Station. Andrew gab einen Knochen an","patch_prefix":"Dann gingen Cody und Kyle zur Station. Andrew gab einen Knochen an","clean_answer":" Amy","patch_answer":" Andrew","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Tiffany und Kelly zur Schule. Tiffany gab einen Kuss an","patch_prefix":"Dann gingen Kelly und Jonathan zur Schule. Jeffrey gab einen Kuss an","clean_answer":" Kelly","patch_answer":" Tiffany","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jonathan und Sarah ins Geschäft. Jonathan gab eine Halskette an","patch_prefix":"Dann gingen Melissa und Ashley ins Geschäft. Michael gab eine Halskette an","clean_answer":" Sarah","patch_answer":" Jonathan","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Travis und Brandon ins Restaurant. Travis gab ein Getränk an","patch_prefix":"Dann gingen Bradley und Megan ins Restaurant. Crystal gab ein Getränk an","clean_answer":" Brandon","patch_answer":" Travis","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Aaron und Vanessa ins Krankenhaus. Aaron gab ein Getränk an","patch_prefix":"Dann gingen Sara und Christina ins Krankenhaus. Andrea gab ein Getränk an","clean_answer":" Vanessa","patch_answer":" Aaron","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Megan und Allison ins Krankenhaus. Megan gab einen Basketball an","patch_prefix":"Dann gingen Alicia und Amanda ins Krankenhaus. Danielle gab einen Basketball an","clean_answer":" Allison","patch_answer":" Megan","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Amy und Jesse ins Krankenhaus. Amy gab einen Knochen an","patch_prefix":"Dann gingen James und Cody ins Krankenhaus. James gab einen Knochen an","clean_answer":" Jesse","patch_answer":" Amy","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Shannon und Melissa ins Krankenhaus. Shannon gab einen Kuss an","patch_prefix":"Dann gingen Jessica und Scott ins Krankenhaus. Brian gab einen Kuss an","clean_answer":" Melissa","patch_answer":" Shannon","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Mark und Jamie ins Büro. Mark gab einen Knochen an","patch_prefix":"Dann gingen Kimberly und Tiffany ins Büro. Jeffrey gab einen Knochen an","clean_answer":" Jamie","patch_answer":" Mark","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Timothy und Ryan ins Krankenhaus. Timothy gab einen Knochen an","patch_prefix":"Dann gingen Patrick und Bryan ins Krankenhaus. Nathan gab einen Knochen an","clean_answer":" Ryan","patch_answer":" Timothy","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jacob und Jason ins Büro. Jacob gab einen Knochen an","patch_prefix":"Dann gingen Brian und Nicholas ins Büro. Alicia gab einen Knochen an","clean_answer":" Jason","patch_answer":" Jacob","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Rebecca und Samuel zur Station. Rebecca gab eine Halskette an","patch_prefix":"Dann gingen Patrick und Charles zur Station. Lisa gab eine Halskette an","clean_answer":" Samuel","patch_answer":" Rebecca","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Andrea und Jacob in den Garten. Andrea gab einen Kuss an","patch_prefix":"Dann gingen Timothy und Lindsay in den Garten. Amber gab einen Kuss an","clean_answer":" Jacob","patch_answer":" Andrea","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Sara und Andrew ins Restaurant. Sara gab einen Computer an","patch_prefix":"Dann gingen Vanessa und Jacob ins Restaurant. Emily gab einen Computer an","clean_answer":" Andrew","patch_answer":" Sara","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Brian und Brittany ins Geschäft. Brian gab eine Halskette an","patch_prefix":"Dann gingen Thomas und Anthony ins Geschäft. Megan gab eine Halskette an","clean_answer":" Brittany","patch_answer":" Brian","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Kelly und Joseph zur Schule. Kelly gab einen Kuss an","patch_prefix":"Dann gingen Anthony und Brittany zur Schule. Lindsey gab einen Kuss an","clean_answer":" Joseph","patch_answer":" Kelly","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jesse und Alicia zur Station. Jesse gab einen Computer an","patch_prefix":"Dann gingen Sean und Melissa zur Station. Samantha gab einen Computer an","clean_answer":" Alicia","patch_answer":" Jesse","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jose und Ashley zur Station. Jose gab einen Computer an","patch_prefix":"Dann gingen Christopher und Allison zur Station. Rachel gab einen Computer an","clean_answer":" Ashley","patch_answer":" Jose","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Christine und Richard ins Büro. Christine gab ein Getränk an","patch_prefix":"Dann gingen Matthew und Christopher ins Büro. Patrick gab ein Getränk an","clean_answer":" Richard","patch_answer":" Christine","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Michelle und Jessica ins Krankenhaus. Michelle gab ein Getränk an","patch_prefix":"Dann gingen Matthew und Jeffrey ins Krankenhaus. Bradley gab ein Getränk an","clean_answer":" Jessica","patch_answer":" Michelle","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Ryan und Dustin ins Geschäft. Ryan gab ein Getränk an","patch_prefix":"Dann gingen Samuel und Brittany ins Geschäft. Danielle gab ein Getränk an","clean_answer":" Dustin","patch_answer":" Ryan","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Brandon und Robert ins Krankenhaus. Brandon gab einen Basketball an","patch_prefix":"Dann gingen Timothy und Shannon ins Krankenhaus. Mark gab einen Basketball an","clean_answer":" Robert","patch_answer":" Brandon","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Thomas und Rebecca ins Haus. Thomas gab einen Basketball an","patch_prefix":"Dann gingen Jennifer und Katherine ins Haus. Gregory gab einen Basketball an","clean_answer":" Rebecca","patch_answer":" Thomas","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Charles und Courtney ins Restaurant. Charles gab einen Ring an","patch_prefix":"Dann gingen Katie und Jose ins Restaurant. Brandon gab einen Ring an","clean_answer":" Courtney","patch_answer":" Charles","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jesse und Scott in den Garten. Jesse gab eine Halskette an","patch_prefix":"Dann gingen Lindsey und Rachel in den Garten. Lisa gab eine Halskette an","clean_answer":" Scott","patch_answer":" Jesse","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Melissa und Erin ins Büro. Melissa gab eine Halskette an","patch_prefix":"Dann gingen Mark und Alicia ins Büro. Joshua gab eine Halskette an","clean_answer":" Erin","patch_answer":" Melissa","case":"BABA_16"},
    {"clean_prefix":"Dann gingen John und Elizabeth in den Garten. John gab einen Ring an","patch_prefix":"Dann gingen Lindsey und Michael in den Garten. Richard gab einen Ring an","clean_answer":" Elizabeth","patch_answer":" John","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Courtney und Andrea ins Haus. Courtney gab einen Snack an","patch_prefix":"Dann gingen Brian und Kenneth ins Haus. Kristen gab einen Snack an","clean_answer":" Andrea","patch_answer":" Courtney","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Kyle und Mary ins Krankenhaus. Kyle gab ein Getränk an","patch_prefix":"Dann gingen Alicia und John ins Krankenhaus. Gregory gab ein Getränk an","clean_answer":" Mary","patch_answer":" Kyle","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Scott und Rebecca zur Schule. Scott gab ein Getränk an","patch_prefix":"Dann gingen Adam und Vanessa zur Schule. Benjamin gab ein Getränk an","clean_answer":" Rebecca","patch_answer":" Scott","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Rachel und Andrea in den Garten. Rachel gab ein Getränk an","patch_prefix":"Dann gingen Amber und Jeffrey in den Garten. Justin gab ein Getränk an","clean_answer":" Andrea","patch_answer":" Rachel","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Alexander und Scott ins Geschäft. Alexander gab einen Ring an","patch_prefix":"Dann gingen Ashley und Megan ins Geschäft. Jessica gab einen Ring an","clean_answer":" Scott","patch_answer":" Alexander","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Cody und Rachel in den Garten. Cody gab einen Ring an","patch_prefix":"Dann gingen Heather und Steven in den Garten. Anthony gab einen Ring an","clean_answer":" Rachel","patch_answer":" Cody","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Tiffany und Cody zur Station. Tiffany gab einen Snack an","patch_prefix":"Dann gingen Katherine und Amber zur Station. Joseph gab einen Snack an","clean_answer":" Cody","patch_answer":" Tiffany","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Joshua und Paul ins Büro. Joshua gab eine Halskette an","patch_prefix":"Dann gingen Joshua und Danielle ins Büro. Christina gab eine Halskette an","clean_answer":" Paul","patch_answer":" Joshua","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Danielle und Megan in den Garten. Danielle gab einen Ring an","patch_prefix":"Dann gingen Brian und Eric in den Garten. John gab einen Ring an","clean_answer":" Megan","patch_answer":" Danielle","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Christopher und Alexander ins Krankenhaus. Christopher gab einen Basketball an","patch_prefix":"Dann gingen Angela und Aaron ins Krankenhaus. Paul gab einen Basketball an","clean_answer":" Alexander","patch_answer":" Christopher","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Joseph und Jacob ins Haus. Joseph gab einen Ring an","patch_prefix":"Dann gingen Adam und David ins Haus. Jeffrey gab einen Ring an","clean_answer":" Jacob","patch_answer":" Joseph","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Alicia und Joshua zur Schule. Alicia gab einen Snack an","patch_prefix":"Dann gingen Kyle und Timothy zur Schule. Shannon gab einen Snack an","clean_answer":" Joshua","patch_answer":" Alicia","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Amy und Alexander ins Geschäft. Amy gab einen Basketball an","patch_prefix":"Dann gingen John und Eric ins Geschäft. Brandon gab einen Basketball an","clean_answer":" Alexander","patch_answer":" Amy","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Megan und Angela ins Büro. Megan gab einen Knochen an","patch_prefix":"Dann gingen Jamie und Jamie ins Büro. Cody gab einen Knochen an","clean_answer":" Angela","patch_answer":" Megan","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Erin und Scott zur Station. Erin gab ein Getränk an","patch_prefix":"Dann gingen Tyler und Katherine zur Station. Alicia gab ein Getränk an","clean_answer":" Scott","patch_answer":" Erin","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Kevin und Charles ins Geschäft. Kevin gab eine Halskette an","patch_prefix":"Dann gingen Matthew und Joseph ins Geschäft. Kyle gab eine Halskette an","clean_answer":" Charles","patch_answer":" Kevin","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jason und James ins Restaurant. Jason gab ein Getränk an","patch_prefix":"Dann gingen Paul und Jesse ins Restaurant. Paul gab ein Getränk an","clean_answer":" James","patch_answer":" Jason","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Christopher und Andrea ins Büro. Christopher gab eine Halskette an","patch_prefix":"Dann gingen William und Kenneth ins Büro. Erin gab eine Halskette an","clean_answer":" Andrea","patch_answer":" Christopher","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Alexander und Scott ins Büro. Alexander gab eine Halskette an","patch_prefix":"Dann gingen Rebecca und Matthew ins Büro. Kelly gab eine Halskette an","clean_answer":" Scott","patch_answer":" Alexander","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Nicole und Jeremy ins Krankenhaus. Nicole gab einen Knochen an","patch_prefix":"Dann gingen Jessica und Samuel ins Krankenhaus. Jonathan gab einen Knochen an","clean_answer":" Jeremy","patch_answer":" Nicole","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Brian und Nathan ins Restaurant. Brian gab einen Kuss an","patch_prefix":"Dann gingen Jose und Lisa ins Restaurant. Kimberly gab einen Kuss an","clean_answer":" Nathan","patch_answer":" Brian","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Charles und Brittany in den Garten. Charles gab eine Halskette an","patch_prefix":"Dann gingen Bryan und Bryan in den Garten. Anthony gab eine Halskette an","clean_answer":" Brittany","patch_answer":" Charles","case":"BABA_16"},
    {"clean_prefix":"Dann gingen William und Nicholas zur Station. William gab ein Getränk an","patch_prefix":"Dann gingen Charles und Thomas zur Station. Kristen gab ein Getränk an","clean_answer":" Nicholas","patch_answer":" William","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Michael und Bradley ins Restaurant. Michael gab einen Ring an","patch_prefix":"Dann gingen Brittany und Benjamin ins Restaurant. Steven gab einen Ring an","clean_answer":" Bradley","patch_answer":" Michael","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Mary und Tiffany zur Station. Mary gab ein Getränk an","patch_prefix":"Dann gingen Christine und Kimberly zur Station. Heather gab ein Getränk an","clean_answer":" Tiffany","patch_answer":" Mary","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Christopher und Jeffrey ins Haus. Christopher gab einen Basketball an","patch_prefix":"Dann gingen Patrick und Katherine ins Haus. Sean gab einen Basketball an","clean_answer":" Jeffrey","patch_answer":" Christopher","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Erica und Eric ins Restaurant. Erica gab einen Computer an","patch_prefix":"Dann gingen Erica und Katherine ins Restaurant. Amy gab einen Computer an","clean_answer":" Eric","patch_answer":" Erica","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Brandon und Samuel zur Station. Brandon gab eine Halskette an","patch_prefix":"Dann gingen John und David zur Station. Jacob gab eine Halskette an","clean_answer":" Samuel","patch_answer":" Brandon","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Brian und Katie zur Station. Brian gab einen Ring an","patch_prefix":"Dann gingen Melissa und Megan zur Station. David gab einen Ring an","clean_answer":" Katie","patch_answer":" Brian","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Danielle und William ins Restaurant. Danielle gab einen Ring an","patch_prefix":"Dann gingen Andrea und Charles ins Restaurant. Steven gab einen Ring an","clean_answer":" William","patch_answer":" Danielle","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Melissa und Brandon ins Krankenhaus. Melissa gab einen Computer an","patch_prefix":"Dann gingen Jason und Jonathan ins Krankenhaus. Paul gab einen Computer an","clean_answer":" Brandon","patch_answer":" Melissa","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Thomas und Amanda ins Büro. Thomas gab einen Kuss an","patch_prefix":"Dann gingen Sara und Bradley ins Büro. Lauren gab einen Kuss an","clean_answer":" Amanda","patch_answer":" Thomas","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Brittany und Matthew ins Haus. Brittany gab einen Snack an","patch_prefix":"Dann gingen Jeffrey und Lauren ins Haus. Joshua gab einen Snack an","clean_answer":" Matthew","patch_answer":" Brittany","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Christopher und Jennifer ins Haus. Christopher gab eine Halskette an","patch_prefix":"Dann gingen Amy und Jeremy ins Haus. Matthew gab eine Halskette an","clean_answer":" Jennifer","patch_answer":" Christopher","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Amber und Jeffrey ins Haus. Amber gab einen Kuss an","patch_prefix":"Dann gingen Timothy und Brian ins Haus. Andrea gab einen Kuss an","clean_answer":" Jeffrey","patch_answer":" Amber","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Paul und Travis zur Schule. Paul gab eine Halskette an","patch_prefix":"Dann gingen Christine und Tyler zur Schule. Robert gab eine Halskette an","clean_answer":" Travis","patch_answer":" Paul","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Tyler und Jeremy in den Garten. Tyler gab ein Getränk an","patch_prefix":"Dann gingen Thomas und Stephen in den Garten. Mary gab ein Getränk an","clean_answer":" Jeremy","patch_answer":" Tyler","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Robert und Brittany ins Restaurant. Robert gab einen Computer an","patch_prefix":"Dann gingen Angela und Jeffrey ins Restaurant. Lindsey gab einen Computer an","clean_answer":" Brittany","patch_answer":" Robert","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Alicia und Kristen zur Schule. Alicia gab ein Getränk an","patch_prefix":"Dann gingen Jamie und Ryan zur Schule. Anthony gab ein Getränk an","clean_answer":" Kristen","patch_answer":" Alicia","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Joseph und Kelly ins Büro. Joseph gab eine Halskette an","patch_prefix":"Dann gingen Daniel und Alicia ins Büro. Thomas gab eine Halskette an","clean_answer":" Kelly","patch_answer":" Joseph","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Emily und Kevin in den Garten. Emily gab einen Ring an","patch_prefix":"Dann gingen Joshua und Michael in den Garten. Jason gab einen Ring an","clean_answer":" Kevin","patch_answer":" Emily","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Amber und Lauren ins Krankenhaus. Amber gab einen Kuss an","patch_prefix":"Dann gingen Amanda und Lindsey ins Krankenhaus. Lisa gab einen Kuss an","clean_answer":" Lauren","patch_answer":" Amber","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Scott und Kyle in den Garten. Scott gab ein Getränk an","patch_prefix":"Dann gingen Tiffany und Joshua in den Garten. James gab ein Getränk an","clean_answer":" Kyle","patch_answer":" Scott","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Vanessa und Jennifer ins Geschäft. Vanessa gab einen Snack an","patch_prefix":"Dann gingen Bryan und Nathan ins Geschäft. Scott gab einen Snack an","clean_answer":" Jennifer","patch_answer":" Vanessa","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Christina und Vanessa zur Station. Christina gab einen Snack an","patch_prefix":"Dann gingen Matthew und Brandon zur Station. Anthony gab einen Snack an","clean_answer":" Vanessa","patch_answer":" Christina","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Stephen und Lindsey zur Station. Stephen gab einen Basketball an","patch_prefix":"Dann gingen Daniel und Nathan zur Station. Tiffany gab einen Basketball an","clean_answer":" Lindsey","patch_answer":" Stephen","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Charles und Rachel ins Haus. Charles gab einen Basketball an","patch_prefix":"Dann gingen Matthew und Kenneth ins Haus. Jose gab einen Basketball an","clean_answer":" Rachel","patch_answer":" Charles","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Travis und Jeremy zur Station. Travis gab eine Halskette an","patch_prefix":"Dann gingen Crystal und Nathan zur Station. Stephanie gab eine Halskette an","clean_answer":" Jeremy","patch_answer":" Travis","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Amy und Angela ins Haus. Amy gab einen Computer an","patch_prefix":"Dann gingen Michelle und William ins Haus. Courtney gab einen Computer an","clean_answer":" Angela","patch_answer":" Amy","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jennifer und Brittany ins Büro. Jennifer gab einen Kuss an","patch_prefix":"Dann gingen James und Vanessa ins Büro. Brittany gab einen Kuss an","clean_answer":" Brittany","patch_answer":" Jennifer","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Scott und John ins Geschäft. Scott gab einen Basketball an","patch_prefix":"Dann gingen Brittany und Courtney ins Geschäft. Joshua gab einen Basketball an","clean_answer":" John","patch_answer":" Scott","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Adam und Paul zur Station. Adam gab einen Computer an","patch_prefix":"Dann gingen Vanessa und Andrew zur Station. Erica gab einen Computer an","clean_answer":" Paul","patch_answer":" Adam","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Michelle und Brandon zur Station. Michelle gab einen Kuss an","patch_prefix":"Dann gingen Bryan und Erin zur Station. Laura gab einen Kuss an","clean_answer":" Brandon","patch_answer":" Michelle","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Bradley und Elizabeth ins Restaurant. Bradley gab ein Getränk an","patch_prefix":"Dann gingen Sean und Brittany ins Restaurant. Alicia gab ein Getränk an","clean_answer":" Elizabeth","patch_answer":" Bradley","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Emily und Kelly ins Krankenhaus. Emily gab ein Getränk an","patch_prefix":"Dann gingen Lindsay und Melissa ins Krankenhaus. Travis gab ein Getränk an","clean_answer":" Kelly","patch_answer":" Emily","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Kenneth und Jonathan ins Krankenhaus. Kenneth gab einen Computer an","patch_prefix":"Dann gingen James und Sara ins Krankenhaus. Adam gab einen Computer an","clean_answer":" Jonathan","patch_answer":" Kenneth","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Michelle und Crystal ins Geschäft. Michelle gab einen Knochen an","patch_prefix":"Dann gingen Lauren und Richard ins Geschäft. Joseph gab einen Knochen an","clean_answer":" Crystal","patch_answer":" Michelle","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Mark und Benjamin ins Haus. Mark gab ein Getränk an","patch_prefix":"Dann gingen Joseph und Rachel ins Haus. Courtney gab ein Getränk an","clean_answer":" Benjamin","patch_answer":" Mark","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Stephen und Steven ins Geschäft. Stephen gab einen Kuss an","patch_prefix":"Dann gingen Tiffany und Nicole ins Geschäft. Kimberly gab einen Kuss an","clean_answer":" Steven","patch_answer":" Stephen","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Mary und Sarah zur Schule. Mary gab einen Knochen an","patch_prefix":"Dann gingen Samantha und Alexander zur Schule. Andrew gab einen Knochen an","clean_answer":" Sarah","patch_answer":" Mary","case":"BABA_16"},
    {"clean_prefix":"Dann gingen David und Kenneth ins Restaurant. David gab einen Basketball an","patch_prefix":"Dann gingen Kristen und Shannon ins Restaurant. Richard gab einen Basketball an","clean_answer":" Kenneth","patch_answer":" David","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Christopher und Jason ins Geschäft. Christopher gab einen Snack an","patch_prefix":"Dann gingen Amanda und Daniel ins Geschäft. Bradley gab einen Snack an","clean_answer":" Jason","patch_answer":" Christopher","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Christopher und Lindsey ins Haus. Christopher gab eine Halskette an","patch_prefix":"Dann gingen Jose und Alexander ins Haus. Erin gab eine Halskette an","clean_answer":" Lindsey","patch_answer":" Christopher","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Matthew und Laura zur Station. Matthew gab einen Basketball an","patch_prefix":"Dann gingen Christina und Bryan zur Station. Justin gab einen Basketball an","clean_answer":" Laura","patch_answer":" Matthew","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Lisa und Heather in den Garten. Lisa gab einen Basketball an","patch_prefix":"Dann gingen Lindsey und Sean in den Garten. Rebecca gab einen Basketball an","clean_answer":" Heather","patch_answer":" Lisa","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Vanessa und Ashley ins Restaurant. Vanessa gab einen Knochen an","patch_prefix":"Dann gingen Michael und Rebecca ins Restaurant. Elizabeth gab einen Knochen an","clean_answer":" Ashley","patch_answer":" Vanessa","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Elizabeth und Joshua ins Büro. Elizabeth gab einen Computer an","patch_prefix":"Dann gingen Jose und Amber ins Büro. Erica gab einen Computer an","clean_answer":" Joshua","patch_answer":" Elizabeth","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jonathan und Sarah ins Haus. Jonathan gab einen Basketball an","patch_prefix":"Dann gingen Kimberly und Nicholas ins Haus. Stephen gab einen Basketball an","clean_answer":" Sarah","patch_answer":" Jonathan","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Daniel und Samantha ins Haus. Daniel gab einen Kuss an","patch_prefix":"Dann gingen Courtney und Lindsey ins Haus. Elizabeth gab einen Kuss an","clean_answer":" Samantha","patch_answer":" Daniel","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Alicia und Amy ins Haus. Alicia gab einen Ring an","patch_prefix":"Dann gingen Charles und Richard ins Haus. Nicole gab einen Ring an","clean_answer":" Amy","patch_answer":" Alicia","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Alicia und Aaron ins Haus. Alicia gab einen Knochen an","patch_prefix":"Dann gingen Tiffany und Lindsey ins Haus. Ryan gab einen Knochen an","clean_answer":" Aaron","patch_answer":" Alicia","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Nicholas und Courtney zur Schule. Nicholas gab einen Computer an","patch_prefix":"Dann gingen Patrick und Christina zur Schule. Mark gab einen Computer an","clean_answer":" Courtney","patch_answer":" Nicholas","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Kimberly und Kelly ins Krankenhaus. Kimberly gab ein Getränk an","patch_prefix":"Dann gingen Dustin und Kevin ins Krankenhaus. Melissa gab ein Getränk an","clean_answer":" Kelly","patch_answer":" Kimberly","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Nicole und Ashley ins Krankenhaus. Nicole gab einen Basketball an","patch_prefix":"Dann gingen Rebecca und Stephen ins Krankenhaus. Lisa gab einen Basketball an","clean_answer":" Ashley","patch_answer":" Nicole","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jonathan und Katie in den Garten. Jonathan gab eine Halskette an","patch_prefix":"Dann gingen Cody und Amanda in den Garten. Ryan gab eine Halskette an","clean_answer":" Katie","patch_answer":" Jonathan","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Robert und Courtney zur Schule. Robert gab einen Ring an","patch_prefix":"Dann gingen Scott und Christina zur Schule. Jonathan gab einen Ring an","clean_answer":" Courtney","patch_answer":" Robert","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Sean und Ashley zur Schule. Sean gab einen Computer an","patch_prefix":"Dann gingen Amanda und Samuel zur Schule. Kenneth gab einen Computer an","clean_answer":" Ashley","patch_answer":" Sean","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Charles und Brian ins Geschäft. Charles gab einen Kuss an","patch_prefix":"Dann gingen Jeffrey und Brandon ins Geschäft. Courtney gab einen Kuss an","clean_answer":" Brian","patch_answer":" Charles","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Allison und Lisa ins Restaurant. Allison gab einen Computer an","patch_prefix":"Dann gingen Dustin und Richard ins Restaurant. Vanessa gab einen Computer an","clean_answer":" Lisa","patch_answer":" Allison","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Michael und Samuel ins Haus. Michael gab einen Basketball an","patch_prefix":"Dann gingen Matthew und Scott ins Haus. Lauren gab einen Basketball an","clean_answer":" Samuel","patch_answer":" Michael","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Michael und Sarah zur Station. Michael gab einen Kuss an","patch_prefix":"Dann gingen Thomas und Sara zur Station. Jeremy gab einen Kuss an","clean_answer":" Sarah","patch_answer":" Michael","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Melissa und William ins Krankenhaus. Melissa gab ein Getränk an","patch_prefix":"Dann gingen Heather und Bradley ins Krankenhaus. Michelle gab ein Getränk an","clean_answer":" William","patch_answer":" Melissa","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Erin und Lindsey zur Station. Erin gab einen Computer an","patch_prefix":"Dann gingen Mark und Stephen zur Station. Brandon gab einen Computer an","clean_answer":" Lindsey","patch_answer":" Erin","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Bryan und Melissa zur Schule. Bryan gab einen Knochen an","patch_prefix":"Dann gingen Angela und Katherine zur Schule. Mark gab einen Knochen an","clean_answer":" Melissa","patch_answer":" Bryan","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Samuel und Mark in den Garten. Samuel gab einen Ring an","patch_prefix":"Dann gingen Steven und Matthew in den Garten. Charles gab einen Ring an","clean_answer":" Mark","patch_answer":" Samuel","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Stephen und Stephanie ins Geschäft. Stephen gab einen Kuss an","patch_prefix":"Dann gingen Katherine und Jonathan ins Geschäft. Gregory gab einen Kuss an","clean_answer":" Stephanie","patch_answer":" Stephen","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Justin und Melissa ins Restaurant. Justin gab einen Basketball an","patch_prefix":"Dann gingen Dustin und Joshua ins Restaurant. Joseph gab einen Basketball an","clean_answer":" Melissa","patch_answer":" Justin","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Eric und Bryan ins Geschäft. Eric gab einen Ring an","patch_prefix":"Dann gingen Courtney und Kristen ins Geschäft. Tyler gab einen Ring an","clean_answer":" Bryan","patch_answer":" Eric","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Kenneth und Amanda ins Haus. Kenneth gab einen Computer an","patch_prefix":"Dann gingen Melissa und Heather ins Haus. Jason gab einen Computer an","clean_answer":" Amanda","patch_answer":" Kenneth","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Kevin und Erin ins Restaurant. Kevin gab einen Kuss an","patch_prefix":"Dann gingen Lindsey und Anthony ins Restaurant. Amber gab einen Kuss an","clean_answer":" Erin","patch_answer":" Kevin","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Timothy und John ins Haus. Timothy gab einen Computer an","patch_prefix":"Dann gingen Cody und Matthew ins Haus. Andrea gab einen Computer an","clean_answer":" John","patch_answer":" Timothy","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jeffrey und Andrew in den Garten. Jeffrey gab einen Knochen an","patch_prefix":"Dann gingen Jeffrey und Benjamin in den Garten. Jesse gab einen Knochen an","clean_answer":" Andrew","patch_answer":" Jeffrey","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Angela und Jeremy ins Krankenhaus. Angela gab eine Halskette an","patch_prefix":"Dann gingen Christopher und Christina ins Krankenhaus. Paul gab eine Halskette an","clean_answer":" Jeremy","patch_answer":" Angela","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jessica und Allison ins Geschäft. Jessica gab einen Ring an","patch_prefix":"Dann gingen Melissa und Amanda ins Geschäft. Mary gab einen Ring an","clean_answer":" Allison","patch_answer":" Jessica","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Andrew und Lauren in den Garten. Andrew gab einen Computer an","patch_prefix":"Dann gingen Erin und Lisa in den Garten. Kimberly gab einen Computer an","clean_answer":" Lauren","patch_answer":" Andrew","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Steven und Kevin in den Garten. Steven gab einen Knochen an","patch_prefix":"Dann gingen Emily und Robert in den Garten. Michelle gab einen Knochen an","clean_answer":" Kevin","patch_answer":" Steven","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Kimberly und Jeffrey ins Büro. Kimberly gab einen Ring an","patch_prefix":"Dann gingen Jamie und Jessica ins Büro. Brittany gab einen Ring an","clean_answer":" Jeffrey","patch_answer":" Kimberly","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Christina und Jeremy ins Krankenhaus. Christina gab einen Ring an","patch_prefix":"Dann gingen Jose und Mark ins Krankenhaus. Kelly gab einen Ring an","clean_answer":" Jeremy","patch_answer":" Christina","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Amber und Sean zur Schule. Amber gab einen Kuss an","patch_prefix":"Dann gingen Stephanie und Jennifer zur Schule. Mary gab einen Kuss an","clean_answer":" Sean","patch_answer":" Amber","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Travis und Kenneth in den Garten. Travis gab einen Computer an","patch_prefix":"Dann gingen Jennifer und Mary in den Garten. Jeffrey gab einen Computer an","clean_answer":" Kenneth","patch_answer":" Travis","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jamie und Jacob zur Station. Jamie gab einen Basketball an","patch_prefix":"Dann gingen Thomas und Mary zur Station. David gab einen Basketball an","clean_answer":" Jacob","patch_answer":" Jamie","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Crystal und Laura ins Büro. Crystal gab einen Basketball an","patch_prefix":"Dann gingen Eric und Adam ins Büro. David gab einen Basketball an","clean_answer":" Laura","patch_answer":" Crystal","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Amy und Jeffrey ins Krankenhaus. Amy gab einen Basketball an","patch_prefix":"Dann gingen Vanessa und Samuel ins Krankenhaus. Steven gab einen Basketball an","clean_answer":" Jeffrey","patch_answer":" Amy","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Amy und Daniel ins Restaurant. Amy gab einen Basketball an","patch_prefix":"Dann gingen David und Matthew ins Restaurant. Alicia gab einen Basketball an","clean_answer":" Daniel","patch_answer":" Amy","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Amy und Brittany in den Garten. Amy gab einen Kuss an","patch_prefix":"Dann gingen Brittany und Michael in den Garten. Christopher gab einen Kuss an","clean_answer":" Brittany","patch_answer":" Amy","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Sarah und Kimberly ins Büro. Sarah gab einen Snack an","patch_prefix":"Dann gingen Matthew und Christine ins Büro. Kyle gab einen Snack an","clean_answer":" Kimberly","patch_answer":" Sarah","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Dustin und Jeremy ins Büro. Dustin gab eine Halskette an","patch_prefix":"Dann gingen Alexander und Patrick ins Büro. Alicia gab eine Halskette an","clean_answer":" Jeremy","patch_answer":" Dustin","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Shannon und Matthew ins Büro. Shannon gab eine Halskette an","patch_prefix":"Dann gingen Ashley und Michael ins Büro. Michelle gab eine Halskette an","clean_answer":" Matthew","patch_answer":" Shannon","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Vanessa und Ryan ins Büro. Vanessa gab einen Ring an","patch_prefix":"Dann gingen Elizabeth und Jason ins Büro. Joseph gab einen Ring an","clean_answer":" Ryan","patch_answer":" Vanessa","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Aaron und Lindsay zur Schule. Aaron gab einen Ring an","patch_prefix":"Dann gingen Stephen und Elizabeth zur Schule. Alexander gab einen Ring an","clean_answer":" Lindsay","patch_answer":" Aaron","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Gregory und Bryan ins Büro. Gregory gab eine Halskette an","patch_prefix":"Dann gingen Jessica und Steven ins Büro. Jesse gab eine Halskette an","clean_answer":" Bryan","patch_answer":" Gregory","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Katie und Kyle ins Geschäft. Katie gab eine Halskette an","patch_prefix":"Dann gingen Alicia und Jacob ins Geschäft. Christina gab eine Halskette an","clean_answer":" Kyle","patch_answer":" Katie","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jonathan und Danielle in den Garten. Jonathan gab ein Getränk an","patch_prefix":"Dann gingen Dustin und Erin in den Garten. Christine gab ein Getränk an","clean_answer":" Danielle","patch_answer":" Jonathan","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Rebecca und Kristen ins Büro. Rebecca gab einen Ring an","patch_prefix":"Dann gingen Jeffrey und Alicia ins Büro. Shannon gab einen Ring an","clean_answer":" Kristen","patch_answer":" Rebecca","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Amanda und Nathan in den Garten. Amanda gab ein Getränk an","patch_prefix":"Dann gingen Jason und Kyle in den Garten. Alexander gab ein Getränk an","clean_answer":" Nathan","patch_answer":" Amanda","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Brandon und Jeremy ins Krankenhaus. Brandon gab ein Getränk an","patch_prefix":"Dann gingen Travis und Travis ins Krankenhaus. Joshua gab ein Getränk an","clean_answer":" Jeremy","patch_answer":" Brandon","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Ashley und Sara zur Schule. Ashley gab einen Knochen an","patch_prefix":"Dann gingen Aaron und Christopher zur Schule. Katherine gab einen Knochen an","clean_answer":" Sara","patch_answer":" Ashley","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Stephanie und Jacob zur Schule. Stephanie gab einen Ring an","patch_prefix":"Dann gingen Lauren und Ryan zur Schule. Brittany gab einen Ring an","clean_answer":" Jacob","patch_answer":" Stephanie","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Stephen und Kelly ins Haus. Stephen gab einen Computer an","patch_prefix":"Dann gingen Nicole und Alexander ins Haus. Christopher gab einen Computer an","clean_answer":" Kelly","patch_answer":" Stephen","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Sean und Charles ins Krankenhaus. Sean gab ein Getränk an","patch_prefix":"Dann gingen Matthew und Benjamin ins Krankenhaus. Shannon gab ein Getränk an","clean_answer":" Charles","patch_answer":" Sean","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jennifer und Bradley ins Büro. Jennifer gab ein Getränk an","patch_prefix":"Dann gingen Stephen und Stephanie ins Büro. Amy gab ein Getränk an","clean_answer":" Bradley","patch_answer":" Jennifer","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Mary und Daniel ins Haus. Mary gab einen Knochen an","patch_prefix":"Dann gingen Tiffany und David ins Haus. Sarah gab einen Knochen an","clean_answer":" Daniel","patch_answer":" Mary","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Christopher und Laura ins Haus. Christopher gab einen Basketball an","patch_prefix":"Dann gingen Sean und Jeffrey ins Haus. David gab einen Basketball an","clean_answer":" Laura","patch_answer":" Christopher","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Anthony und Jessica ins Krankenhaus. Anthony gab einen Kuss an","patch_prefix":"Dann gingen Sean und James ins Krankenhaus. Benjamin gab einen Kuss an","clean_answer":" Jessica","patch_answer":" Anthony","case":"BABA_16"},
    {"clean_prefix":"Dann gingen James und Kyle ins Restaurant. James gab einen Basketball an","patch_prefix":"Dann gingen Matthew und Joshua ins Restaurant. Paul gab einen Basketball an","clean_answer":" Kyle","patch_answer":" James","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Aaron und Rachel ins Krankenhaus. Aaron gab einen Basketball an","patch_prefix":"Dann gingen Lauren und Daniel ins Krankenhaus. Brittany gab einen Basketball an","clean_answer":" Rachel","patch_answer":" Aaron","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jesse und Lisa ins Krankenhaus. Jesse gab einen Knochen an","patch_prefix":"Dann gingen Mark und Tyler ins Krankenhaus. Jennifer gab einen Knochen an","clean_answer":" Lisa","patch_answer":" Jesse","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Tiffany und Lauren ins Krankenhaus. Tiffany gab eine Halskette an","patch_prefix":"Dann gingen Nicholas und Justin ins Krankenhaus. Laura gab eine Halskette an","clean_answer":" Lauren","patch_answer":" Tiffany","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Joshua und Lisa zur Station. Joshua gab eine Halskette an","patch_prefix":"Dann gingen Erin und Christine zur Station. Jose gab eine Halskette an","clean_answer":" Lisa","patch_answer":" Joshua","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Stephen und Andrea ins Haus. Stephen gab einen Basketball an","patch_prefix":"Dann gingen Amanda und Robert ins Haus. Joshua gab einen Basketball an","clean_answer":" Andrea","patch_answer":" Stephen","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Kelly und Rachel zur Schule. Kelly gab einen Basketball an","patch_prefix":"Dann gingen Brittany und Crystal zur Schule. Katie gab einen Basketball an","clean_answer":" Rachel","patch_answer":" Kelly","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Tiffany und Jamie ins Geschäft. Tiffany gab einen Computer an","patch_prefix":"Dann gingen Brian und Tyler ins Geschäft. Matthew gab einen Computer an","clean_answer":" Jamie","patch_answer":" Tiffany","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Nicholas und Megan zur Schule. Nicholas gab einen Basketball an","patch_prefix":"Dann gingen Tiffany und Robert zur Schule. Heather gab einen Basketball an","clean_answer":" Megan","patch_answer":" Nicholas","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Nicole und Crystal zur Schule. Nicole gab einen Basketball an","patch_prefix":"Dann gingen Aaron und Michelle zur Schule. Steven gab einen Basketball an","clean_answer":" Crystal","patch_answer":" Nicole","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Vanessa und Samuel zur Schule. Vanessa gab einen Ring an","patch_prefix":"Dann gingen Kevin und Charles zur Schule. Joseph gab einen Ring an","clean_answer":" Samuel","patch_answer":" Vanessa","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Robert und Danielle ins Krankenhaus. Robert gab einen Computer an","patch_prefix":"Dann gingen Amy und Matthew ins Krankenhaus. Jason gab einen Computer an","clean_answer":" Danielle","patch_answer":" Robert","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Robert und Sarah ins Geschäft. Robert gab einen Basketball an","patch_prefix":"Dann gingen Christopher und Elizabeth ins Geschäft. Amber gab einen Basketball an","clean_answer":" Sarah","patch_answer":" Robert","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Benjamin und Brittany ins Krankenhaus. Benjamin gab einen Basketball an","patch_prefix":"Dann gingen Ryan und Andrea ins Krankenhaus. Ryan gab einen Basketball an","clean_answer":" Brittany","patch_answer":" Benjamin","case":"BABA_16"},
    {"clean_prefix":"Dann gingen David und Andrea zur Schule. David gab einen Knochen an","patch_prefix":"Dann gingen Erin und Bradley zur Schule. Jeremy gab einen Knochen an","clean_answer":" Andrea","patch_answer":" David","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Erica und Scott zur Station. Erica gab einen Computer an","patch_prefix":"Dann gingen Nicholas und Adam zur Station. Danielle gab einen Computer an","clean_answer":" Scott","patch_answer":" Erica","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Sara und Brittany in den Garten. Sara gab einen Computer an","patch_prefix":"Dann gingen Michael und Rebecca in den Garten. Kenneth gab einen Computer an","clean_answer":" Brittany","patch_answer":" Sara","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jeffrey und Mary ins Restaurant. Jeffrey gab einen Computer an","patch_prefix":"Dann gingen Crystal und Sara ins Restaurant. Jennifer gab einen Computer an","clean_answer":" Mary","patch_answer":" Jeffrey","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Patrick und Brittany ins Haus. Patrick gab eine Halskette an","patch_prefix":"Dann gingen Rachel und Jacob ins Haus. Lindsey gab eine Halskette an","clean_answer":" Brittany","patch_answer":" Patrick","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Brittany und Jeffrey zur Station. Brittany gab einen Basketball an","patch_prefix":"Dann gingen Jessica und Melissa zur Station. Angela gab einen Basketball an","clean_answer":" Jeffrey","patch_answer":" Brittany","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Erin und Jennifer ins Restaurant. Erin gab einen Kuss an","patch_prefix":"Dann gingen Adam und Stephen ins Restaurant. Christine gab einen Kuss an","clean_answer":" Jennifer","patch_answer":" Erin","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Heather und Samantha in den Garten. Heather gab einen Kuss an","patch_prefix":"Dann gingen Joseph und Richard in den Garten. Vanessa gab einen Kuss an","clean_answer":" Samantha","patch_answer":" Heather","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Benjamin und Ryan zur Schule. Benjamin gab einen Snack an","patch_prefix":"Dann gingen Andrea und Heather zur Schule. Lauren gab einen Snack an","clean_answer":" Ryan","patch_answer":" Benjamin","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Vanessa und Angela in den Garten. Vanessa gab einen Ring an","patch_prefix":"Dann gingen Robert und Heather in den Garten. Bryan gab einen Ring an","clean_answer":" Angela","patch_answer":" Vanessa","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Rebecca und Melissa ins Restaurant. Rebecca gab einen Computer an","patch_prefix":"Dann gingen Jennifer und Elizabeth ins Restaurant. Elizabeth gab einen Computer an","clean_answer":" Melissa","patch_answer":" Rebecca","case":"BABA_16"},
    {"clean_prefix":"Dann gingen David und Rachel zur Schule. David gab einen Ring an","patch_prefix":"Dann gingen Joshua und Lindsay zur Schule. Kevin gab einen Ring an","clean_answer":" Rachel","patch_answer":" David","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Kimberly und Michelle zur Schule. Kimberly gab einen Basketball an","patch_prefix":"Dann gingen Rachel und Stephanie zur Schule. Angela gab einen Basketball an","clean_answer":" Michelle","patch_answer":" Kimberly","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jessica und Laura in den Garten. Jessica gab einen Ring an","patch_prefix":"Dann gingen Christina und Andrea in den Garten. Alicia gab einen Ring an","clean_answer":" Laura","patch_answer":" Jessica","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Richard und Eric in den Garten. Richard gab ein Getränk an","patch_prefix":"Dann gingen Joshua und Thomas in den Garten. Lisa gab ein Getränk an","clean_answer":" Eric","patch_answer":" Richard","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Brandon und Eric zur Schule. Brandon gab einen Snack an","patch_prefix":"Dann gingen Jeremy und Erin zur Schule. Stephanie gab einen Snack an","clean_answer":" Eric","patch_answer":" Brandon","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Lauren und Matthew in den Garten. Lauren gab ein Getränk an","patch_prefix":"Dann gingen Michelle und Scott in den Garten. Ashley gab ein Getränk an","clean_answer":" Matthew","patch_answer":" Lauren","case":"BABA_16"},
    {"clean_prefix":"Dann gingen James und Sarah ins Krankenhaus. James gab einen Computer an","patch_prefix":"Dann gingen Amy und Angela ins Krankenhaus. Michael gab einen Computer an","clean_answer":" Sarah","patch_answer":" James","case":"BABA_16"},
    {"clean_prefix":"Dann gingen James und Daniel ins Geschäft. James gab eine Halskette an","patch_prefix":"Dann gingen Stephanie und Aaron ins Geschäft. Dustin gab eine Halskette an","clean_answer":" Daniel","patch_answer":" James","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Samuel und Steven zur Schule. Samuel gab einen Computer an","patch_prefix":"Dann gingen Jose und Jeffrey zur Schule. Kelly gab einen Computer an","clean_answer":" Steven","patch_answer":" Samuel","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Christopher und Gregory ins Haus. Christopher gab einen Computer an","patch_prefix":"Dann gingen Jeremy und Amy ins Haus. James gab einen Computer an","clean_answer":" Gregory","patch_answer":" Christopher","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jennifer und Jessica ins Restaurant. Jennifer gab einen Snack an","patch_prefix":"Dann gingen Amanda und Angela ins Restaurant. Paul gab einen Snack an","clean_answer":" Jessica","patch_answer":" Jennifer","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Mary und Eric ins Büro. Mary gab einen Computer an","patch_prefix":"Dann gingen Timothy und Nathan ins Büro. Brandon gab einen Computer an","clean_answer":" Eric","patch_answer":" Mary","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Kevin und Steven ins Büro. Kevin gab einen Computer an","patch_prefix":"Dann gingen Paul und Sean ins Büro. Heather gab einen Computer an","clean_answer":" Steven","patch_answer":" Kevin","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Stephanie und Lindsey zur Schule. Stephanie gab einen Computer an","patch_prefix":"Dann gingen Ashley und Jennifer zur Schule. Lauren gab einen Computer an","clean_answer":" Lindsey","patch_answer":" Stephanie","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Aaron und Dustin in den Garten. Aaron gab einen Basketball an","patch_prefix":"Dann gingen Samuel und Emily in den Garten. Paul gab einen Basketball an","clean_answer":" Dustin","patch_answer":" Aaron","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Alexander und David zur Schule. Alexander gab ein Getränk an","patch_prefix":"Dann gingen Andrew und Kimberly zur Schule. Steven gab ein Getränk an","clean_answer":" David","patch_answer":" Alexander","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Crystal und Andrea ins Restaurant. Crystal gab ein Getränk an","patch_prefix":"Dann gingen Kristen und Sean ins Restaurant. Timothy gab ein Getränk an","clean_answer":" Andrea","patch_answer":" Crystal","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Ashley und Elizabeth zur Station. Ashley gab einen Snack an","patch_prefix":"Dann gingen Jeremy und Brandon zur Station. Samuel gab einen Snack an","clean_answer":" Elizabeth","patch_answer":" Ashley","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Amber und Jesse ins Restaurant. Amber gab einen Computer an","patch_prefix":"Dann gingen Andrea und Patrick ins Restaurant. Jacob gab einen Computer an","clean_answer":" Jesse","patch_answer":" Amber","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Nathan und Nicholas ins Krankenhaus. Nathan gab einen Basketball an","patch_prefix":"Dann gingen Benjamin und Samantha ins Krankenhaus. Lindsay gab einen Basketball an","clean_answer":" Nicholas","patch_answer":" Nathan","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Andrew und Rebecca zur Station. Andrew gab eine Halskette an","patch_prefix":"Dann gingen Christine und Robert zur Station. Heather gab eine Halskette an","clean_answer":" Rebecca","patch_answer":" Andrew","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jamie und Rachel ins Geschäft. Jamie gab einen Basketball an","patch_prefix":"Dann gingen Nathan und Megan ins Geschäft. Aaron gab einen Basketball an","clean_answer":" Rachel","patch_answer":" Jamie","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Sara und Kimberly ins Büro. Sara gab eine Halskette an","patch_prefix":"Dann gingen Danielle und James ins Büro. Rebecca gab eine Halskette an","clean_answer":" Kimberly","patch_answer":" Sara","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Nicole und Rachel ins Geschäft. Nicole gab ein Getränk an","patch_prefix":"Dann gingen Shannon und William ins Geschäft. Megan gab ein Getränk an","clean_answer":" Rachel","patch_answer":" Nicole","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Brandon und Katherine ins Geschäft. Brandon gab einen Knochen an","patch_prefix":"Dann gingen Jessica und Jeremy ins Geschäft. Matthew gab einen Knochen an","clean_answer":" Katherine","patch_answer":" Brandon","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Eric und Anthony ins Restaurant. Eric gab einen Computer an","patch_prefix":"Dann gingen Brian und Jennifer ins Restaurant. Rachel gab einen Computer an","clean_answer":" Anthony","patch_answer":" Eric","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jacob und Jason ins Restaurant. Jacob gab einen Basketball an","patch_prefix":"Dann gingen Benjamin und Travis ins Restaurant. Kristen gab einen Basketball an","clean_answer":" Jason","patch_answer":" Jacob","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Patrick und Kristen ins Geschäft. Patrick gab ein Getränk an","patch_prefix":"Dann gingen Sara und Vanessa ins Geschäft. Jeffrey gab ein Getränk an","clean_answer":" Kristen","patch_answer":" Patrick","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Christopher und Matthew ins Krankenhaus. Christopher gab einen Knochen an","patch_prefix":"Dann gingen Timothy und Joshua ins Krankenhaus. Charles gab einen Knochen an","clean_answer":" Matthew","patch_answer":" Christopher","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Steven und Ashley ins Geschäft. Steven gab einen Computer an","patch_prefix":"Dann gingen Kenneth und Scott ins Geschäft. Jonathan gab einen Computer an","clean_answer":" Ashley","patch_answer":" Steven","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Erica und Jonathan ins Haus. Erica gab eine Halskette an","patch_prefix":"Dann gingen Lindsay und Andrea ins Haus. Jason gab eine Halskette an","clean_answer":" Jonathan","patch_answer":" Erica","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Sean und Dustin ins Restaurant. Sean gab ein Getränk an","patch_prefix":"Dann gingen Timothy und Thomas ins Restaurant. Michael gab ein Getränk an","clean_answer":" Dustin","patch_answer":" Sean","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Samantha und Ryan zur Station. Samantha gab ein Getränk an","patch_prefix":"Dann gingen Joshua und Dustin zur Station. Joseph gab ein Getränk an","clean_answer":" Ryan","patch_answer":" Samantha","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Danielle und Brittany ins Krankenhaus. Danielle gab eine Halskette an","patch_prefix":"Dann gingen Michelle und Justin ins Krankenhaus. Bryan gab eine Halskette an","clean_answer":" Brittany","patch_answer":" Danielle","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Ryan und Cody ins Geschäft. Ryan gab einen Knochen an","patch_prefix":"Dann gingen Eric und Kristen ins Geschäft. Daniel gab einen Knochen an","clean_answer":" Cody","patch_answer":" Ryan","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Lindsay und Steven ins Haus. Lindsay gab eine Halskette an","patch_prefix":"Dann gingen Lindsay und Jonathan ins Haus. Christina gab eine Halskette an","clean_answer":" Steven","patch_answer":" Lindsay","case":"BABA_16"},
    {"clean_prefix":"Dann gingen David und James ins Büro. David gab einen Knochen an","patch_prefix":"Dann gingen Kyle und Mary ins Büro. Thomas gab einen Knochen an","clean_answer":" James","patch_answer":" David","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Andrea und Kyle zur Schule. Andrea gab eine Halskette an","patch_prefix":"Dann gingen Elizabeth und Joseph zur Schule. Laura gab eine Halskette an","clean_answer":" Kyle","patch_answer":" Andrea","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jason und Anthony zur Station. Jason gab ein Getränk an","patch_prefix":"Dann gingen Jessica und Nathan zur Station. Anthony gab ein Getränk an","clean_answer":" Anthony","patch_answer":" Jason","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Kevin und James ins Haus. Kevin gab eine Halskette an","patch_prefix":"Dann gingen Lindsey und Jason ins Haus. Alicia gab eine Halskette an","clean_answer":" James","patch_answer":" Kevin","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Bryan und Bradley ins Restaurant. Bryan gab eine Halskette an","patch_prefix":"Dann gingen Justin und Anthony ins Restaurant. Charles gab eine Halskette an","clean_answer":" Bradley","patch_answer":" Bryan","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Elizabeth und Brandon ins Restaurant. Elizabeth gab einen Snack an","patch_prefix":"Dann gingen Jamie und Erin ins Restaurant. Richard gab einen Snack an","clean_answer":" Brandon","patch_answer":" Elizabeth","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Jessica und Jennifer ins Haus. Jessica gab einen Knochen an","patch_prefix":"Dann gingen Jason und Joseph ins Haus. Brian gab einen Knochen an","clean_answer":" Jennifer","patch_answer":" Jessica","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Bryan und Elizabeth ins Haus. Bryan gab einen Knochen an","patch_prefix":"Dann gingen Amber und Richard ins Haus. Tyler gab einen Knochen an","clean_answer":" Elizabeth","patch_answer":" Bryan","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Joshua und Jose zur Schule. Joshua gab einen Kuss an","patch_prefix":"Dann gingen Ashley und Amy zur Schule. Lisa gab einen Kuss an","clean_answer":" Jose","patch_answer":" Joshua","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Katherine und Adam in den Garten. Katherine gab einen Ring an","patch_prefix":"Dann gingen Ashley und Aaron in den Garten. Justin gab einen Ring an","clean_answer":" Adam","patch_answer":" Katherine","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Sarah und Megan ins Büro. Sarah gab ein Getränk an","patch_prefix":"Dann gingen Justin und Rebecca ins Büro. Katherine gab ein Getränk an","clean_answer":" Megan","patch_answer":" Sarah","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Kyle und Christina ins Geschäft. Kyle gab einen Knochen an","patch_prefix":"Dann gingen James und Cody ins Geschäft. Jamie gab einen Knochen an","clean_answer":" Christina","patch_answer":" Kyle","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Richard und Jeffrey ins Restaurant. Richard gab einen Snack an","patch_prefix":"Dann gingen Michelle und Lindsay ins Restaurant. Matthew gab einen Snack an","clean_answer":" Jeffrey","patch_answer":" Richard","case":"BABA_16"},
    {"clean_prefix":"Dann gingen William und Benjamin zur Station. William gab einen Knochen an","patch_prefix":"Dann gingen Lindsey und Erica zur Station. William gab einen Knochen an","clean_answer":" Benjamin","patch_answer":" William","case":"BABA_16"},
    {"clean_prefix":"Dann gingen John und Vanessa zur Station. John gab einen Knochen an","patch_prefix":"Dann gingen Steven und Amanda zur Station. Jeffrey gab einen Knochen an","clean_answer":" Vanessa","patch_answer":" John","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Scott und Amber in den Garten. Scott gab einen Computer an","patch_prefix":"Dann gingen Matthew und Anthony in den Garten. Sean gab einen Computer an","clean_answer":" Amber","patch_answer":" Scott","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Amber und Kevin in den Garten. Amber gab ein Getränk an","patch_prefix":"Dann gingen Daniel und Jason in den Garten. Bradley gab ein Getränk an","clean_answer":" Kevin","patch_answer":" Amber","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Timothy und Christine ins Krankenhaus. Timothy gab ein Getränk an","patch_prefix":"Dann gingen Shannon und Sara ins Krankenhaus. Nicole gab ein Getränk an","clean_answer":" Christine","patch_answer":" Timothy","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Alexander und Anthony zur Schule. Alexander gab eine Halskette an","patch_prefix":"Dann gingen Thomas und Tyler zur Schule. Angela gab eine Halskette an","clean_answer":" Anthony","patch_answer":" Alexander","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Heather und Rachel ins Haus. Heather gab ein Getränk an","patch_prefix":"Dann gingen Travis und Rebecca ins Haus. Courtney gab ein Getränk an","clean_answer":" Rachel","patch_answer":" Heather","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Joshua und Amber in den Garten. Joshua gab einen Kuss an","patch_prefix":"Dann gingen Richard und Amanda in den Garten. Sarah gab einen Kuss an","clean_answer":" Amber","patch_answer":" Joshua","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Joshua und Courtney ins Restaurant. Joshua gab ein Getränk an","patch_prefix":"Dann gingen Nathan und Benjamin ins Restaurant. Alexander gab ein Getränk an","clean_answer":" Courtney","patch_answer":" Joshua","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Christopher und Jonathan zur Station. Christopher gab einen Computer an","patch_prefix":"Dann gingen Matthew und Andrea zur Station. Mary gab einen Computer an","clean_answer":" Jonathan","patch_answer":" Christopher","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Ryan und Jonathan ins Restaurant. Ryan gab einen Snack an","patch_prefix":"Dann gingen Samantha und Christine ins Restaurant. Jesse gab einen Snack an","clean_answer":" Jonathan","patch_answer":" Ryan","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Erica und Christopher ins Krankenhaus. Erica gab einen Basketball an","patch_prefix":"Dann gingen Nicole und Crystal ins Krankenhaus. Nicole gab einen Basketball an","clean_answer":" Christopher","patch_answer":" Erica","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Eric und Sean ins Haus. Eric gab einen Snack an","patch_prefix":"Dann gingen Emily und William ins Haus. Kristen gab einen Snack an","clean_answer":" Sean","patch_answer":" Eric","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Alexander und Jamie ins Geschäft. Alexander gab ein Getränk an","patch_prefix":"Dann gingen Matthew und Patrick ins Geschäft. Melissa gab ein Getränk an","clean_answer":" Jamie","patch_answer":" Alexander","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Courtney und Jennifer ins Haus. Courtney gab einen Computer an","patch_prefix":"Dann gingen Heather und Brian ins Haus. Amber gab einen Computer an","clean_answer":" Jennifer","patch_answer":" Courtney","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Daniel und Jessica ins Geschäft. Daniel gab eine Halskette an","patch_prefix":"Dann gingen Angela und David ins Geschäft. Christina gab eine Halskette an","clean_answer":" Jessica","patch_answer":" Daniel","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Samuel und Richard ins Haus. Samuel gab einen Snack an","patch_prefix":"Dann gingen Erin und Sarah ins Haus. Emily gab einen Snack an","clean_answer":" Richard","patch_answer":" Samuel","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Scott und Lindsey ins Krankenhaus. Scott gab ein Getränk an","patch_prefix":"Dann gingen Alexander und Kyle ins Krankenhaus. Christine gab ein Getränk an","clean_answer":" Lindsey","patch_answer":" Scott","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Timothy und Nathan ins Geschäft. Timothy gab einen Computer an","patch_prefix":"Dann gingen Brittany und Adam ins Geschäft. Kimberly gab einen Computer an","clean_answer":" Nathan","patch_answer":" Timothy","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Alicia und Jeremy ins Büro. Alicia gab ein Getränk an","patch_prefix":"Dann gingen Kelly und Christina ins Büro. Samuel gab ein Getränk an","clean_answer":" Jeremy","patch_answer":" Alicia","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Katherine und Jeremy zur Schule. Katherine gab einen Kuss an","patch_prefix":"Dann gingen Elizabeth und Patrick zur Schule. Vanessa gab einen Kuss an","clean_answer":" Jeremy","patch_answer":" Katherine","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Charles und Steven ins Restaurant. Charles gab einen Computer an","patch_prefix":"Dann gingen Bryan und Megan ins Restaurant. Tiffany gab einen Computer an","clean_answer":" Steven","patch_answer":" Charles","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Joshua und Thomas zur Schule. Joshua gab eine Halskette an","patch_prefix":"Dann gingen Jeffrey und Paul zur Schule. Ashley gab eine Halskette an","clean_answer":" Thomas","patch_answer":" Joshua","case":"BABA_16"},
    {"clean_prefix":"Dann gingen Kevin und Joseph zur Station. Kevin gab einen Computer an","patch_prefix":"Dann gingen Samantha und Jason zur Station. Lauren gab einen Computer an","clean_answer":" Joseph","patch_answer":" Kevin","case":"BABA_16"}
]