[
    {"clean_prefix": "Luego, Richard y Erica fueron al hospital. Richard le dio una bebida a", "patch_prefix": "Luego, Matthew y Crystal fueron al hospital. Megan le dio una bebida a", "clean_answer": " Erica", "patch_answer": " Richard", "case": "BABA_16"},
    {"clean_prefix": "Luego, John y Eric fueron a la estación. John le dio un hueso a", "patch_prefix": "Luego, Rachel y Andrea fueron a la estación. Megan le dio un hueso a", "clean_answer": " Eric", "patch_answer": " John", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jason y Jamie fueron al jardín. Jason le dio un collar a", "patch_prefix": "Luego, Michael y Jonathan fueron al jardín. Michelle le dio un collar a", "clean_answer": " Jamie", "patch_answer": " Jason", "case": "BABA_16"},
    {"clean_prefix": "Luego, Matthew y Jennifer fueron a la estación. Matthew le dio un beso a", "patch_prefix": "Luego, Katherine y Alicia fueron a la estación. Katherine le dio un beso a", "clean_answer": " Jennifer", "patch_answer": " Matthew", "case": "BABA_16"},
    {"clean_prefix": "Luego, Lisa y Jason fueron al restaurante. Lisa le dio una computadora a", "patch_prefix": "Luego, Christine y Justin fueron al restaurante. Kyle le dio una computadora a", "clean_answer": " Jason", "patch_answer": " Lisa", "case": "BABA_16"},
    {"clean_prefix": "Luego, Richard y Kyle fueron a la estación. Richard le dio un collar a", "patch_prefix": "Luego, Mary y Erin fueron a la estación. Sara le dio un collar a", "clean_answer": " Kyle", "patch_answer": " Richard", "case": "BABA_16"},
    {"clean_prefix": "Luego, Joseph y Amber fueron al jardín. Joseph le dio una computadora a", "patch_prefix": "Luego, Michael y Lindsay fueron al jardín. Rachel le dio una computadora a", "clean_answer": " Amber", "patch_answer": " Joseph", "case": "BABA_16"},
    {"clean_prefix": "Luego, Anthony y Mark fueron a la casa. Anthony le dio un balón de baloncesto a", "patch_prefix": "Luego, Elizabeth y Laura fueron a la casa. Robert le dio un balón de baloncesto a", "clean_answer": " Mark", "patch_answer": " Anthony", "case": "BABA_16"},
    {"clean_prefix": "Luego, Brittany y Shannon fueron a la estación. Brittany le dio un hueso a", "patch_prefix": "Luego, Charles y Aaron fueron a la estación. Timothy le dio un hueso a", "clean_answer": " Shannon", "patch_answer": " Brittany", "case": "BABA_16"},
    {"clean_prefix": "Luego, Andrea y Sara fueron a la estación. Andrea le dio un collar a", "patch_prefix": "Luego, Adam y Erin fueron a la estación. Bryan le dio un collar a", "clean_answer": " Sara", "patch_answer": " Andrea", "case": "BABA_16"},
    {"clean_prefix": "Luego, Kristen y Robert fueron al restaurante. Kristen le dio una computadora a", "patch_prefix": "Luego, Justin y Andrew fueron al restaurante. Andrea le dio una computadora a", "clean_answer": " Robert", "patch_answer": " Kristen", "case": "BABA_16"},
    {"clean_prefix": "Luego, Lindsey y Kristen fueron al restaurante. Lindsey le dio un hueso a", "patch_prefix": "Luego, Andrea y Kelly fueron al restaurante. Rebecca le dio un hueso a", "clean_answer": " Kristen", "patch_answer": " Lindsey", "case": "BABA_16"},
    {"clean_prefix": "Luego, Adam y Stephen fueron al hospital. Adam le dio un beso a", "patch_prefix": "Luego, David y Timothy fueron al hospital. Lisa le dio un beso a", "clean_answer": " Stephen", "patch_answer": " Adam", "case": "BABA_16"},
    {"clean_prefix": "Luego, Cody y Amy fueron a la casa. Cody le dio un bocadillo a", "patch_prefix": "Luego, David y Nicholas fueron a la casa. Eric le dio un bocadillo a", "clean_answer": " Amy", "patch_answer": " Cody", "case": "BABA_16"},
    {"clean_prefix": "Luego, Lisa y Sarah fueron a la casa. Lisa le dio un beso a", "patch_prefix": "Luego, Gregory y Tyler fueron a la casa. Daniel le dio un beso a", "clean_answer": " Sarah", "patch_answer": " Lisa", "case": "BABA_16"},
    {"clean_prefix": "Luego, Courtney y William fueron a la escuela. Courtney le dio un collar a", "patch_prefix": "Luego, Jesse y Sarah fueron a la escuela. Alicia le dio un collar a", "clean_answer": " William", "patch_answer": " Courtney", "case": "BABA_16"},
    {"clean_prefix": "Luego, Daniel y Elizabeth fueron a la estación. Daniel le dio una bebida a", "patch_prefix": "Luego, Heather y Amanda fueron a la estación. Jacob le dio una bebida a", "clean_answer": " Elizabeth", "patch_answer": " Daniel", "case": "BABA_16"},
    {"clean_prefix": "Luego, Allison y Kimberly fueron al jardín. Allison le dio un collar a", "patch_prefix": "Luego, Nicholas y Jeremy fueron al jardín. Rebecca le dio un collar a", "clean_answer": " Kimberly", "patch_answer": " Allison", "case": "BABA_16"},
    {"clean_prefix": "Luego, Adam y Nicholas fueron a la oficina. Adam le dio un bocadillo a", "patch_prefix": "Luego, Kristen y Courtney fueron a la oficina. Justin le dio un bocadillo a", "clean_answer": " Nicholas", "patch_answer": " Adam", "case": "BABA_16"},
    {"clean_prefix": "Luego, Steven y Brian fueron al jardín. Steven le dio una computadora a", "patch_prefix": "Luego, Nicole y Tyler fueron al jardín. Christopher le dio una computadora a", "clean_answer": " Brian", "patch_answer": " Steven", "case": "BABA_16"},
    {"clean_prefix": "Luego, James y Michael fueron a la tienda. James le dio un hueso a", "patch_prefix": "Luego, Jacob y Brian fueron a la tienda. Patrick le dio un hueso a", "clean_answer": " Michael", "patch_answer": " James", "case": "BABA_16"},
    {"clean_prefix": "Luego, Lauren y Amanda fueron a la escuela. Lauren le dio un beso a", "patch_prefix": "Luego, Brittany y Patrick fueron a la escuela. Brandon le dio un beso a", "clean_answer": " Amanda", "patch_answer": " Lauren", "case": "BABA_16"},
    {"clean_prefix": "Luego, Elizabeth y Bradley fueron al restaurante. Elizabeth le dio un collar a", "patch_prefix": "Luego, Travis y Benjamin fueron al restaurante. Heather le dio un collar a", "clean_answer": " Bradley", "patch_answer": " Elizabeth", "case": "BABA_16"},
    {"clean_prefix": "Luego, Courtney y Michelle fueron a la escuela. Courtney le dio un anillo a", "patch_prefix": "Luego, Jonathan y Richard fueron a la escuela. Michael le dio un anillo a", "clean_answer": " Michelle", "patch_answer": " Courtney", "case": "BABA_16"},
    {"clean_prefix": "Luego, Kenneth y Katherine fueron a la oficina. Kenneth le dio una computadora a", "patch_prefix": "Luego, Samuel y Jeffrey fueron a la oficina. Nicholas le dio una computadora a", "clean_answer": " Katherine", "patch_answer": " Kenneth", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jacob y Vanessa fueron al hospital. Jacob le dio una bebida a", "patch_prefix": "Luego, Samuel y Michelle fueron al hospital. Danielle le dio una bebida a", "clean_answer": " Vanessa", "patch_answer": " Jacob", "case": "BABA_16"},
    {"clean_prefix": "Luego, Steven y David fueron al restaurante. Steven le dio un hueso a", "patch_prefix": "Luego, Sarah y Brittany fueron al restaurante. Tyler le dio un hueso a", "clean_answer": " David", "patch_answer": " Steven", "case": "BABA_16"},
    {"clean_prefix": "Luego, Samantha y Joshua fueron al jardín. Samantha le dio un beso a", "patch_prefix": "Luego, Jeffrey y Mary fueron al jardín. Amber le dio un beso a", "clean_answer": " Joshua", "patch_answer": " Samantha", "case": "BABA_16"},
    {"clean_prefix": "Luego, Tyler y Justin fueron a la oficina. Tyler le dio un collar a", "patch_prefix": "Luego, Joshua y Lindsay fueron a la oficina. Bradley le dio un collar a", "clean_answer": " Justin", "patch_answer": " Tyler", "case": "BABA_16"},
    {"clean_prefix": "Luego, Amy y John fueron al restaurante. Amy le dio un collar a", "patch_prefix": "Luego, Sara y Aaron fueron al restaurante. Timothy le dio un collar a", "clean_answer": " John", "patch_answer": " Amy", "case": "BABA_16"},
    {"clean_prefix": "Luego, Eric y Erica fueron a la estación. Eric le dio una computadora a", "patch_prefix": "Luego, Scott y Tyler fueron a la estación. Sara le dio una computadora a", "clean_answer": " Erica", "patch_answer": " Eric", "case": "BABA_16"},
    {"clean_prefix": "Luego, Benjamin y Jason fueron a la escuela. Benjamin le dio un hueso a", "patch_prefix": "Luego, Nicole y Michelle fueron a la escuela. Vanessa le dio un hueso a", "clean_answer": " Jason", "patch_answer": " Benjamin", "case": "BABA_16"},
    {"clean_prefix": "Luego, Steven y Katie fueron a la oficina. Steven le dio un hueso a", "patch_prefix": "Luego, Jeffrey y Shannon fueron a la oficina. Joseph le dio un hueso a", "clean_answer": " Katie", "patch_answer": " Steven", "case": "BABA_16"},
    {"clean_prefix": "Luego, Mark y Amber fueron al jardín. Mark le dio un collar a", "patch_prefix": "Luego, Shannon y Timothy fueron al jardín. Tyler le dio un collar a", "clean_answer": " Amber", "patch_answer": " Mark", "case": "BABA_16"},
    {"clean_prefix": "Luego, Erica y Patrick fueron al hospital. Erica le dio un balón de baloncesto a", "patch_prefix": "Luego, Vanessa y Crystal fueron al hospital. Joshua le dio un balón de baloncesto a", "clean_answer": " Patrick", "patch_answer": " Erica", "case": "BABA_16"},
    {"clean_prefix": "Luego, Thomas y Angela fueron a la tienda. Thomas le dio un hueso a", "patch_prefix": "Luego, Samuel y Kenneth fueron a la tienda. John le dio un hueso a", "clean_answer": " Angela", "patch_answer": " Thomas", "case": "BABA_16"},
    {"clean_prefix": "Luego, Angela y Alicia fueron a la oficina. Angela le dio un bocadillo a", "patch_prefix": "Luego, Stephanie y Cody fueron a la oficina. Samuel le dio un bocadillo a", "clean_answer": " Alicia", "patch_answer": " Angela", "case": "BABA_16"},
    {"clean_prefix": "Luego, Steven y Crystal fueron al hospital. Steven le dio un anillo a", "patch_prefix": "Luego, Eric y Katherine fueron al hospital. Matthew le dio un anillo a", "clean_answer": " Crystal", "patch_answer": " Steven", "case": "BABA_16"},
    {"clean_prefix": "Luego, Lauren y Erica fueron a la casa. Lauren le dio un anillo a", "patch_prefix": "Luego, Lindsay y Robert fueron a la casa. Laura le dio un anillo a", "clean_answer": " Erica", "patch_answer": " Lauren", "case": "BABA_16"},
    {"clean_prefix": "Luego, Angela y Katie fueron al restaurante. Angela le dio un beso a", "patch_prefix": "Luego, Thomas y Katherine fueron al restaurante. Benjamin le dio un beso a", "clean_answer": " Katie", "patch_answer": " Angela", "case": "BABA_16"},
    {"clean_prefix": "Luego, Andrew y Megan fueron a la estación. Andrew le dio un balón de baloncesto a", "patch_prefix": "Luego, Andrea y Gregory fueron a la estación. Stephanie le dio un balón de baloncesto a", "clean_answer": " Megan", "patch_answer": " Andrew", "case": "BABA_16"},
    {"clean_prefix": "Luego, Amber y Amy fueron a la oficina. Amber le dio una computadora a", "patch_prefix": "Luego, Tiffany y Rachel fueron a la oficina. Brian le dio una computadora a", "clean_answer": " Amy", "patch_answer": " Amber", "case": "BABA_16"},
    {"clean_prefix": "Luego, Courtney y Stephanie fueron al hospital. Courtney le dio un balón de baloncesto a", "patch_prefix": "Luego, Alicia y Kimberly fueron al hospital. Paul le dio un balón de baloncesto a", "clean_answer": " Stephanie", "patch_answer": " Courtney", "case": "BABA_16"},
    {"clean_prefix": "Luego, Alicia y Richard fueron al restaurante. Alicia le dio una computadora a", "patch_prefix": "Luego, Jennifer y Tiffany fueron al restaurante. Joshua le dio una computadora a", "clean_answer": " Richard", "patch_answer": " Alicia", "case": "BABA_16"},
    {"clean_prefix": "Luego, Crystal y Brian fueron al jardín. Crystal le dio un beso a", "patch_prefix": "Luego, Vanessa y Vanessa fueron al jardín. Gregory le dio un beso a", "clean_answer": " Brian", "patch_answer": " Crystal", "case": "BABA_16"},
    {"clean_prefix": "Luego, Daniel y Sara fueron a la oficina. Daniel le dio un bocadillo a", "patch_prefix": "Luego, Benjamin y Matthew fueron a la oficina. Jason le dio un bocadillo a", "clean_answer": " Sara", "patch_answer": " Daniel", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jonathan y Samuel fueron a la tienda. Jonathan le dio un bocadillo a", "patch_prefix": "Luego, Kelly y Brandon fueron a la tienda. Cody le dio un bocadillo a", "clean_answer": " Samuel", "patch_answer": " Jonathan", "case": "BABA_16"},
    {"clean_prefix": "Luego, Joshua y Lindsey fueron a la escuela. Joshua le dio un hueso a", "patch_prefix": "Luego, Anthony y Jamie fueron a la escuela. Christina le dio un hueso a", "clean_answer": " Lindsey", "patch_answer": " Joshua", "case": "BABA_16"},
    {"clean_prefix": "Luego, Dustin y Jeffrey fueron a la oficina. Dustin le dio una computadora a", "patch_prefix": "Luego, Rachel y Kyle fueron a la oficina. Katherine le dio una computadora a", "clean_answer": " Jeffrey", "patch_answer": " Dustin", "case": "BABA_16"},
    {"clean_prefix": "Luego, Kyle y Katherine fueron a la casa. Kyle le dio un collar a", "patch_prefix": "Luego, Bradley y Ashley fueron a la casa. Ashley le dio un collar a", "clean_answer": " Katherine", "patch_answer": " Kyle", "case": "BABA_16"},
    {"clean_prefix": "Luego, Thomas y Amber fueron a la oficina. Thomas le dio un beso a", "patch_prefix": "Luego, Jeffrey y Matthew fueron a la oficina. Cody le dio un beso a", "clean_answer": " Amber", "patch_answer": " Thomas", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jennifer y Jose fueron al restaurante. Jennifer le dio una bebida a", "patch_prefix": "Luego, Michael y Nicole fueron al restaurante. Bradley le dio una bebida a", "clean_answer": " Jose", "patch_answer": " Jennifer", "case": "BABA_16"},
    {"clean_prefix": "Luego, Michelle y Jennifer fueron al hospital. Michelle le dio un hueso a", "patch_prefix": "Luego, Tiffany y Stephanie fueron al hospital. Sarah le dio un hueso a", "clean_answer": " Jennifer", "patch_answer": " Michelle", "case": "BABA_16"},
    {"clean_prefix": "Luego, Ryan y Nicholas fueron a la oficina. Ryan le dio un collar a", "patch_prefix": "Luego, Brandon y Tyler fueron a la oficina. Brandon le dio un collar a", "clean_answer": " Nicholas", "patch_answer": " Ryan", "case": "BABA_16"},
    {"clean_prefix": "Luego, Andrew y Amy fueron a la estación. Andrew le dio un hueso a", "patch_prefix": "Luego, Cody y Kyle fueron a la estación. Andrew le dio un hueso a", "clean_answer": " Amy", "patch_answer": " Andrew", "case": "BABA_16"},
    {"clean_prefix": "Luego, Tiffany y Kelly fueron a la escuela. Tiffany le dio un beso a", "patch_prefix": "Luego, Kelly y Jonathan fueron a la escuela. Jeffrey le dio un beso a", "clean_answer": " Kelly", "patch_answer": " Tiffany", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jonathan y Sarah fueron a la tienda. Jonathan le dio un collar a", "patch_prefix": "Luego, Melissa y Ashley fueron a la tienda. Michael le dio un collar a", "clean_answer": " Sarah", "patch_answer": " Jonathan", "case": "BABA_16"},
    {"clean_prefix": "Luego, Travis y Brandon fueron al restaurante. Travis le dio una bebida a", "patch_prefix": "Luego, Bradley y Megan fueron al restaurante. Crystal le dio una bebida a", "clean_answer": " Brandon", "patch_answer": " Travis", "case": "BABA_16"},
    {"clean_prefix": "Luego, Aaron y Vanessa fueron al hospital. Aaron le dio una bebida a", "patch_prefix": "Luego, Sara y Christina fueron al hospital. Andrea le dio una bebida a", "clean_answer": " Vanessa", "patch_answer": " Aaron", "case": "BABA_16"},
    {"clean_prefix": "Luego, Megan y Allison fueron al hospital. Megan le dio un balón de baloncesto a", "patch_prefix": "Luego, Alicia y Amanda fueron al hospital. Danielle le dio un balón de baloncesto a", "clean_answer": " Allison", "patch_answer": " Megan", "case": "BABA_16"},
    {"clean_prefix": "Luego, Amy y Jesse fueron al hospital. Amy le dio un hueso a", "patch_prefix": "Luego, James y Cody fueron al hospital. James le dio un hueso a", "clean_answer": " Jesse", "patch_answer": " Amy", "case": "BABA_16"},
    {"clean_prefix": "Luego, Shannon y Melissa fueron al hospital. Shannon le dio un beso a", "patch_prefix": "Luego, Jessica y Scott fueron al hospital. Brian le dio un beso a", "clean_answer": " Melissa", "patch_answer": " Shannon", "case": "BABA_16"},
    {"clean_prefix": "Luego, Mark y Jamie fueron a la oficina. Mark le dio un hueso a", "patch_prefix": "Luego, Kimberly y Tiffany fueron a la oficina. Jeffrey le dio un hueso a", "clean_answer": " Jamie", "patch_answer": " Mark", "case": "BABA_16"},
    {"clean_prefix": "Luego, Timothy y Ryan fueron al hospital. Timothy le dio un hueso a", "patch_prefix": "Luego, Patrick y Bryan fueron al hospital. Nathan le dio un hueso a", "clean_answer": " Ryan", "patch_answer": " Timothy", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jacob y Jason fueron a la oficina. Jacob le dio un hueso a", "patch_prefix": "Luego, Brian y Nicholas fueron a la oficina. Alicia le dio un hueso a", "clean_answer": " Jason", "patch_answer": " Jacob", "case": "BABA_16"},
    {"clean_prefix": "Luego, Rebecca y Samuel fueron a la estación. Rebecca le dio un collar a", "patch_prefix": "Luego, Patrick y Charles fueron a la estación. Lisa le dio un collar a", "clean_answer": " Samuel", "patch_answer": " Rebecca", "case": "BABA_16"},
    {"clean_prefix": "Luego, Andrea y Jacob fueron al jardín. Andrea le dio un beso a", "patch_prefix": "Luego, Timothy y Lindsay fueron al jardín. Amber le dio un beso a", "clean_answer": " Jacob", "patch_answer": " Andrea", "case": "BABA_16"},
    {"clean_prefix": "Luego, Sara y Andrew fueron al restaurante. Sara le dio una computadora a", "patch_prefix": "Luego, Vanessa y Jacob fueron al restaurante. Emily le dio una computadora a", "clean_answer": " Andrew", "patch_answer": " Sara", "case": "BABA_16"},
    {"clean_prefix": "Luego, Brian y Brittany fueron a la tienda. Brian le dio un collar a", "patch_prefix": "Luego, Thomas y Anthony fueron a la tienda. Megan le dio un collar a", "clean_answer": " Brittany", "patch_answer": " Brian", "case": "BABA_16"},
    {"clean_prefix": "Luego, Kelly y Joseph fueron a la escuela. Kelly le dio un beso a", "patch_prefix": "Luego, Anthony y Brittany fueron a la escuela. Lindsey le dio un beso a", "clean_answer": " Joseph", "patch_answer": " Kelly", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jesse y Alicia fueron a la estación. Jesse le dio una computadora a", "patch_prefix": "Luego, Sean y Melissa fueron a la estación. Samantha le dio una computadora a", "clean_answer": " Alicia", "patch_answer": " Jesse", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jose y Ashley fueron a la estación. Jose le dio una computadora a", "patch_prefix": "Luego, Christopher y Allison fueron a la estación. Rachel le dio una computadora a", "clean_answer": " Ashley", "patch_answer": " Jose", "case": "BABA_16"},
    {"clean_prefix": "Luego, Christine y Richard fueron a la oficina. Christine le dio una bebida a", "patch_prefix": "Luego, Matthew y Christopher fueron a la oficina. Patrick le dio una bebida a", "clean_answer": " Richard", "patch_answer": " Christine", "case": "BABA_16"},
    {"clean_prefix": "Luego, Michelle y Jessica fueron al hospital. Michelle le dio una bebida a", "patch_prefix": "Luego, Matthew y Jeffrey fueron al hospital. Bradley le dio una bebida a", "clean_answer": " Jessica", "patch_answer": " Michelle", "case": "BABA_16"},
    {"clean_prefix": "Luego, Ryan y Dustin fueron a la tienda. Ryan le dio una bebida a", "patch_prefix": "Luego, Samuel y Brittany fueron a la tienda. Danielle le dio una bebida a", "clean_answer": " Dustin", "patch_answer": " Ryan", "case": "BABA_16"},
    {"clean_prefix": "Luego, Brandon y Robert fueron al hospital. Brandon le dio un balón de baloncesto a", "patch_prefix": "Luego, Timothy y Shannon fueron al hospital. Mark le dio un balón de baloncesto a", "clean_answer": " Robert", "patch_answer": " Brandon", "case": "BABA_16"},
    {"clean_prefix": "Luego, Thomas y Rebecca fueron a la casa. Thomas le dio un balón de baloncesto a", "patch_prefix": "Luego, Jennifer y Katherine fueron a la casa. Gregory le dio un balón de baloncesto a", "clean_answer": " Rebecca", "patch_answer": " Thomas", "case": "BABA_16"},
    {"clean_prefix": "Luego, Charles y Courtney fueron al restaurante. Charles le dio un anillo a", "patch_prefix": "Luego, Katie y Jose fueron al restaurante. Brandon le dio un anillo a", "clean_answer": " Courtney", "patch_answer": " Charles", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jesse y Scott fueron al jardín. Jesse le dio un collar a", "patch_prefix": "Luego, Lindsey y Rachel fueron al jardín. Lisa le dio un collar a", "clean_answer": " Scott", "patch_answer": " Jesse", "case": "BABA_16"},
    {"clean_prefix": "Luego, Melissa y Erin fueron a la oficina. Melissa le dio un collar a", "patch_prefix": "Luego, Mark y Alicia fueron a la oficina. Joshua le dio un collar a", "clean_answer": " Erin", "patch_answer": " Melissa", "case": "BABA_16"},
    {"clean_prefix": "Luego, John y Elizabeth fueron al jardín. John le dio un anillo a", "patch_prefix": "Luego, Lindsey y Michael fueron al jardín. Richard le dio un anillo a", "clean_answer": " Elizabeth", "patch_answer": " John", "case": "BABA_16"},
    {"clean_prefix": "Luego, Courtney y Andrea fueron a la casa. Courtney le dio una merienda a", "patch_prefix": "Luego, Brian y Kenneth fueron a la casa. Kristen le dio una merienda a", "clean_answer": " Andrea", "patch_answer": " Courtney", "case": "BABA_16"},
    {"clean_prefix": "Luego, Kyle y Mary fueron al hospital. Kyle le dio una bebida a", "patch_prefix": "Luego, Alicia y John fueron al hospital. Gregory le dio una bebida a", "clean_answer": " Mary", "patch_answer": " Kyle", "case": "BABA_16"},
    {"clean_prefix": "Luego, Scott y Rebecca fueron a la escuela. Scott le dio una bebida a", "patch_prefix": "Luego, Adam y Vanessa fueron a la escuela. Benjamin le dio una bebida a", "clean_answer": " Rebecca", "patch_answer": " Scott", "case": "BABA_16"},
    {"clean_prefix": "Luego, Rachel y Andrea fueron al jardín. Rachel le dio una bebida a", "patch_prefix": "Luego, Amber y Jeffrey fueron al jardín. Justin le dio una bebida a", "clean_answer": " Andrea", "patch_answer": " Rachel", "case": "BABA_16"},
    {"clean_prefix": "Luego, Alexander y Scott fueron a la tienda. Alexander le dio un anillo a", "patch_prefix": "Luego, Ashley y Megan fueron a la tienda. Jessica le dio un anillo a", "clean_answer": " Scott", "patch_answer": " Alexander", "case": "BABA_16"},
    {"clean_prefix": "Luego, Cody y Rachel fueron al jardín. Cody le dio un anillo a", "patch_prefix": "Luego, Heather y Steven fueron al jardín. Anthony le dio un anillo a", "clean_answer": " Rachel", "patch_answer": " Cody", "case": "BABA_16"},
    {"clean_prefix": "Luego, Tiffany y Cody fueron a la estación. Tiffany le dio una merienda a", "patch_prefix": "Luego, Katherine y Amber fueron a la estación. Joseph le dio una merienda a", "clean_answer": " Cody", "patch_answer": " Tiffany", "case": "BABA_16"},
    {"clean_prefix": "Luego, Joshua y Paul fueron a la oficina. Joshua le dio un collar a", "patch_prefix": "Luego, Joshua y Danielle fueron a la oficina. Christina le dio un collar a", "clean_answer": " Paul", "patch_answer": " Joshua", "case": "BABA_16"},
    {"clean_prefix": "Luego, Danielle y Megan fueron al jardín. Danielle le dio un anillo a", "patch_prefix": "Luego, Brian y Eric fueron al jardín. John le dio un anillo a", "clean_answer": " Megan", "patch_answer": " Danielle", "case": "BABA_16"},
    {"clean_prefix": "Luego, Christopher y Alexander fueron al hospital. Christopher le dio un balón de baloncesto a", "patch_prefix": "Luego, Angela y Aaron fueron al hospital. Paul le dio un balón de baloncesto a", "clean_answer": " Alexander", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Luego, Joseph y Jacob fueron a la casa. Joseph le dio un anillo a", "patch_prefix": "Luego, Adam y David fueron a la casa. Jeffrey le dio un anillo a", "clean_answer": " Jacob", "patch_answer": " Joseph", "case": "BABA_16"},
    {"clean_prefix": "Luego, Alicia y Joshua fueron a la escuela. Alicia le dio una merienda a", "patch_prefix": "Luego, Kyle y Timothy fueron a la escuela. Shannon le dio una merienda a", "clean_answer": " Joshua", "patch_answer": " Alicia", "case": "BABA_16"},
    {"clean_prefix": "Luego, Amy y Alexander fueron a la tienda. Amy le dio un balón de baloncesto a", "patch_prefix": "Luego, John y Eric fueron a la tienda. Brandon le dio un balón de baloncesto a", "clean_answer": " Alexander", "patch_answer": " Amy", "case": "BABA_16"},
    {"clean_prefix": "Luego, Megan y Angela fueron a la oficina. Megan le dio un hueso a", "patch_prefix": "Luego, Jamie y Jamie fueron a la oficina. Cody le dio un hueso a", "clean_answer": " Angela", "patch_answer": " Megan", "case": "BABA_16"},
    {"clean_prefix": "Luego, Erin y Scott fueron a la estación. Erin le dio una bebida a", "patch_prefix": "Luego, Tyler y Katherine fueron a la estación. Alicia le dio una bebida a", "clean_answer": " Scott", "patch_answer": " Erin", "case": "BABA_16"},
    {"clean_prefix": "Luego, Kevin y Charles fueron a la tienda. Kevin le dio un collar a", "patch_prefix": "Luego, Matthew y Joseph fueron a la tienda. Kyle le dio un collar a", "clean_answer": " Charles", "patch_answer": " Kevin", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jason y James fueron al restaurante. Jason le dio una bebida a", "patch_prefix": "Luego, Paul y Jesse fueron al restaurante. Paul le dio una bebida a", "clean_answer": " James", "patch_answer": " Jason", "case": "BABA_16"},
    {"clean_prefix": "Luego, Christopher y Andrea fueron a la oficina. Christopher le dio un collar a", "patch_prefix": "Luego, William y Kenneth fueron a la oficina. Erin le dio un collar a", "clean_answer": " Andrea", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Luego, Alexander y Scott fueron a la oficina. Alexander le dio un collar a", "patch_prefix": "Luego, Rebecca y Matthew fueron a la oficina. Kelly le dio un collar a", "clean_answer": " Scott", "patch_answer": " Alexander", "case": "BABA_16"},
    {"clean_prefix": "Luego, Nicole y Jeremy fueron al hospital. Nicole le dio un hueso a", "patch_prefix": "Luego, Jessica y Samuel fueron al hospital. Jonathan le dio un hueso a", "clean_answer": " Jeremy", "patch_answer": " Nicole", "case": "BABA_16"},
    {"clean_prefix": "Luego, Brian y Nathan fueron al restaurante. Brian le dio un beso a", "patch_prefix": "Luego, Jose y Lisa fueron al restaurante. Kimberly le dio un beso a", "clean_answer": " Nathan", "patch_answer": " Brian", "case": "BABA_16"},
    {"clean_prefix": "Luego, Charles y Brittany fueron al jardín. Charles le dio un collar a", "patch_prefix": "Luego, Bryan y Bryan fueron al jardín. Anthony le dio un collar a", "clean_answer": " Brittany", "patch_answer": " Charles", "case": "BABA_16"},
    {"clean_prefix": "Luego, William y Nicholas fueron a la estación. William le dio una bebida a", "patch_prefix": "Luego, Charles y Thomas fueron a la estación. Kristen le dio una bebida a", "clean_answer": " Nicholas", "patch_answer": " William", "case": "BABA_16"},
    {"clean_prefix": "Luego, Michael y Bradley fueron al restaurante. Michael le dio un anillo a", "patch_prefix": "Luego, Brittany y Benjamin fueron al restaurante. Steven le dio un anillo a", "clean_answer": " Bradley", "patch_answer": " Michael", "case": "BABA_16"},
    {"clean_prefix": "Luego, Mary y Tiffany fueron a la estación. Mary le dio una bebida a", "patch_prefix": "Luego, Christine y Kimberly fueron a la estación. Heather le dio una bebida a", "clean_answer": " Tiffany", "patch_answer": " Mary", "case": "BABA_16"},
    {"clean_prefix": "Luego, Christopher y Jeffrey fueron a la casa. Christopher le dio un balón de baloncesto a", "patch_prefix": "Luego, Patrick y Katherine fueron a la casa. Sean le dio un balón de baloncesto a", "clean_answer": " Jeffrey", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Luego, Erica y Eric fueron al restaurante. Erica le dio una computadora a", "patch_prefix": "Luego, Erica y Katherine fueron al restaurante. Amy le dio una computadora a", "clean_answer": " Eric", "patch_answer": " Erica", "case": "BABA_16"},
    {"clean_prefix": "Luego, Brandon y Samuel fueron a la estación. Brandon le dio un collar a", "patch_prefix": "Luego, John y David fueron a la estación. Jacob le dio un collar a", "clean_answer": " Samuel", "patch_answer": " Brandon", "case": "BABA_16"},
    {"clean_prefix": "Luego, Brian y Katie fueron a la estación. Brian le dio un anillo a", "patch_prefix": "Luego, Melissa y Megan fueron a la estación. David le dio un anillo a", "clean_answer": " Katie", "patch_answer": " Brian", "case": "BABA_16"},
    {"clean_prefix": "Luego, Danielle y William fueron al restaurante. Danielle le dio un anillo a", "patch_prefix": "Luego, Andrea y Charles fueron al restaurante. Steven le dio un anillo a", "clean_answer": " William", "patch_answer": " Danielle", "case": "BABA_16"},
    {"clean_prefix": "Luego, Melissa y Brandon fueron al hospital. Melissa le dio una computadora a", "patch_prefix": "Luego, Jason y Jonathan fueron al hospital. Paul le dio una computadora a", "clean_answer": " Brandon", "patch_answer": " Melissa", "case": "BABA_16"},
    {"clean_prefix": "Luego, Thomas y Amanda fueron a la oficina. Thomas le dio un beso a", "patch_prefix": "Luego, Sara y Bradley fueron a la oficina. Lauren le dio un beso a", "clean_answer": " Amanda", "patch_answer": " Thomas", "case": "BABA_16"},
    {"clean_prefix": "Luego, Brittany y Matthew fueron a la casa. Brittany le dio una merienda a", "patch_prefix": "Luego, Jeffrey y Lauren fueron a la casa. Joshua le dio una merienda a", "clean_answer": " Matthew", "patch_answer": " Brittany", "case": "BABA_16"},
    {"clean_prefix": "Luego, Christopher y Jennifer fueron a la casa. Christopher le dio un collar a", "patch_prefix": "Luego, Amy y Jeremy fueron a la casa. Matthew le dio un collar a", "clean_answer": " Jennifer", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Luego, Amber y Jeffrey fueron a la casa. Amber le dio un beso a", "patch_prefix": "Luego, Timothy y Brian fueron a la casa. Andrea le dio un beso a", "clean_answer": " Jeffrey", "patch_answer": " Amber", "case": "BABA_16"},
    {"clean_prefix": "Luego, Paul y Travis fueron a la escuela. Paul le dio un collar a", "patch_prefix": "Luego, Christine y Tyler fueron a la escuela. Robert le dio un collar a", "clean_answer": " Travis", "patch_answer": " Paul", "case": "BABA_16"},
    {"clean_prefix": "Luego, Tyler y Jeremy fueron al jardín. Tyler le dio una bebida a", "patch_prefix": "Luego, Thomas y Stephen fueron al jardín. Mary le dio una bebida a", "clean_answer": " Jeremy", "patch_answer": " Tyler", "case": "BABA_16"},
    {"clean_prefix": "Luego, Robert y Brittany fueron al restaurante. Robert le dio una computadora a", "patch_prefix": "Luego, Angela y Jeffrey fueron al restaurante. Lindsey le dio una computadora a", "clean_answer": " Brittany", "patch_answer": " Robert", "case": "BABA_16"},
    {"clean_prefix": "Luego, Alicia y Kristen fueron a la escuela. Alicia le dio una bebida a", "patch_prefix": "Luego, Jamie y Ryan fueron a la escuela. Anthony le dio una bebida a", "clean_answer": " Kristen", "patch_answer": " Alicia", "case": "BABA_16"},
    {"clean_prefix": "Luego, Joseph y Kelly fueron a la oficina. Joseph le dio un collar a", "patch_prefix": "Luego, Daniel y Alicia fueron a la oficina. Thomas le dio un collar a", "clean_answer": " Kelly", "patch_answer": " Joseph", "case": "BABA_16"},
    {"clean_prefix": "Luego, Emily y Kevin fueron al jardín. Emily le dio un anillo a", "patch_prefix": "Luego, Joshua y Michael fueron al jardín. Jason le dio un anillo a", "clean_answer": " Kevin", "patch_answer": " Emily", "case": "BABA_16"},
    {"clean_prefix": "Luego, Amber y Lauren fueron al hospital. Amber le dio un beso a", "patch_prefix": "Luego, Amanda y Lindsey fueron al hospital. Lisa le dio un beso a", "clean_answer": " Lauren", "patch_answer": " Amber", "case": "BABA_16"},
    {"clean_prefix": "Luego, Scott y Kyle fueron al jardín. Scott le dio una bebida a", "patch_prefix": "Luego, Tiffany y Joshua fueron al jardín. James le dio una bebida a", "clean_answer": " Kyle", "patch_answer": " Scott", "case": "BABA_16"},
    {"clean_prefix": "Luego, Vanessa y Jennifer fueron a la tienda. Vanessa le dio una merienda a", "patch_prefix": "Luego, Bryan y Nathan fueron a la tienda. Scott le dio una merienda a", "clean_answer": " Jennifer", "patch_answer": " Vanessa", "case": "BABA_16"},
    {"clean_prefix": "Luego, Christina y Vanessa fueron a la estación. Christina le dio una merienda a", "patch_prefix": "Luego, Matthew y Brandon fueron a la estación. Anthony le dio una merienda a", "clean_answer": " Vanessa", "patch_answer": " Christina", "case": "BABA_16"},
    {"clean_prefix": "Luego, Stephen y Lindsey fueron a la estación. Stephen le dio un balón de baloncesto a", "patch_prefix": "Luego, Daniel y Nathan fueron a la estación. Tiffany le dio un balón de baloncesto a", "clean_answer": " Lindsey", "patch_answer": " Stephen", "case": "BABA_16"},
    {"clean_prefix": "Luego, Charles y Rachel fueron a la casa. Charles le dio un balón de baloncesto a", "patch_prefix": "Luego, Matthew y Kenneth fueron a la casa. Jose le dio un balón de baloncesto a", "clean_answer": " Rachel", "patch_answer": " Charles", "case": "BABA_16"},
    {"clean_prefix": "Luego, Travis y Jeremy fueron a la estación. Travis le dio un collar a", "patch_prefix": "Luego, Crystal y Nathan fueron a la estación. Stephanie le dio un collar a", "clean_answer": " Jeremy", "patch_answer": " Travis", "case": "BABA_16"},
    {"clean_prefix": "Luego, Amy y Angela fueron a la casa. Amy le dio una computadora a", "patch_prefix": "Luego, Michelle y William fueron a la casa. Courtney le dio una computadora a", "clean_answer": " Angela", "patch_answer": " Amy", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jennifer y Brittany fueron a la oficina. Jennifer le dio un beso a", "patch_prefix": "Luego, James y Vanessa fueron a la oficina. Brittany le dio un beso a", "clean_answer": " Brittany", "patch_answer": " Jennifer", "case": "BABA_16"},
    {"clean_prefix": "Luego, Scott y John fueron a la tienda. Scott le dio un balón de baloncesto a", "patch_prefix": "Luego, Brittany y Courtney fueron a la tienda. Joshua le dio un balón de baloncesto a", "clean_answer": " John", "patch_answer": " Scott", "case": "BABA_16"},
    {"clean_prefix": "Luego, Adam y Paul fueron a la estación. Adam le dio una computadora a", "patch_prefix": "Luego, Vanessa y Andrew fueron a la estación. Erica le dio una computadora a", "clean_answer": " Paul", "patch_answer": " Adam", "case": "BABA_16"},
    {"clean_prefix": "Luego, Michelle y Brandon fueron a la estación. Michelle le dio un beso a", "patch_prefix": "Luego, Bryan y Erin fueron a la estación. Laura le dio un beso a", "clean_answer": " Brandon", "patch_answer": " Michelle", "case": "BABA_16"},
    {"clean_prefix": "Luego, Bradley y Elizabeth fueron al restaurante. Bradley le dio una bebida a", "patch_prefix": "Luego, Sean y Brittany fueron al restaurante. Alicia le dio una bebida a", "clean_answer": " Elizabeth", "patch_answer": " Bradley", "case": "BABA_16"},
    {"clean_prefix": "Luego, Emily y Kelly fueron al hospital. Emily le dio una bebida a", "patch_prefix": "Luego, Lindsay y Melissa fueron al hospital. Travis le dio una bebida a", "clean_answer": " Kelly", "patch_answer": " Emily", "case": "BABA_16"},
    {"clean_prefix": "Luego, Kenneth y Jonathan fueron al hospital. Kenneth le dio una computadora a", "patch_prefix": "Luego, James y Sara fueron al hospital. Adam le dio una computadora a", "clean_answer": " Jonathan", "patch_answer": " Kenneth", "case": "BABA_16"},
    {"clean_prefix": "Luego, Michelle y Crystal fueron a la tienda. Michelle le dio un hueso a", "patch_prefix": "Luego, Lauren y Richard fueron a la tienda. Joseph le dio un hueso a", "clean_answer": " Crystal", "patch_answer": " Michelle", "case": "BABA_16"},
    {"clean_prefix": "Luego, Mark y Benjamin fueron a la casa. Mark le dio una bebida a", "patch_prefix": "Luego, Joseph y Rachel fueron a la casa. Courtney le dio una bebida a", "clean_answer": " Benjamin", "patch_answer": " Mark", "case": "BABA_16"},
    {"clean_prefix": "Luego, Stephen y Steven fueron a la tienda. Stephen le dio un beso a", "patch_prefix": "Luego, Tiffany y Nicole fueron a la tienda. Kimberly le dio un beso a", "clean_answer": " Steven", "patch_answer": " Stephen", "case": "BABA_16"},
    {"clean_prefix": "Luego, Mary y Sarah fueron a la escuela. Mary le dio un hueso a", "patch_prefix": "Luego, Samantha y Alexander fueron a la escuela. Andrew le dio un hueso a", "clean_answer": " Sarah", "patch_answer": " Mary", "case": "BABA_16"},
    {"clean_prefix": "Luego, David y Kenneth fueron al restaurante. David le dio un balón de baloncesto a", "patch_prefix": "Luego, Kristen y Shannon fueron al restaurante. Richard le dio un balón de baloncesto a", "clean_answer": " Kenneth", "patch_answer": " David", "case": "BABA_16"},
    {"clean_prefix": "Luego, Christopher y Jason fueron a la tienda. Christopher le dio una merienda a", "patch_prefix": "Luego, Amanda y Daniel fueron a la tienda. Bradley le dio una merienda a", "clean_answer": " Jason", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Luego, Christopher y Lindsey fueron a la casa. Christopher le dio un collar a", "patch_prefix": "Luego, Jose y Alexander fueron a la casa. Erin le dio un collar a", "clean_answer": " Lindsey", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Luego, Matthew y Laura fueron a la estación. Matthew le dio un balón de baloncesto a", "patch_prefix": "Luego, Christina y Bryan fueron a la estación. Justin le dio un balón de baloncesto a", "clean_answer": " Laura", "patch_answer": " Matthew", "case": "BABA_16"},
    {"clean_prefix": "Luego, Lisa y Heather fueron al jardín. Lisa le dio un balón de baloncesto a", "patch_prefix": "Luego, Lindsey y Sean fueron al jardín. Rebecca le dio un balón de baloncesto a", "clean_answer": " Heather", "patch_answer": " Lisa", "case": "BABA_16"},
    {"clean_prefix": "Luego, Vanessa y Ashley fueron al restaurante. Vanessa le dio un hueso a", "patch_prefix": "Luego, Michael y Rebecca fueron al restaurante. Elizabeth le dio un hueso a", "clean_answer": " Ashley", "patch_answer": " Vanessa", "case": "BABA_16"},
    {"clean_prefix": "Luego, Elizabeth y Joshua fueron a la oficina. Elizabeth le dio una computadora a", "patch_prefix": "Luego, Jose y Amber fueron a la oficina. Erica le dio una computadora a", "clean_answer": " Joshua", "patch_answer": " Elizabeth", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jonathan y Sarah fueron a la casa. Jonathan le dio un balón de baloncesto a", "patch_prefix": "Luego, Kimberly y Nicholas fueron a la casa. Stephen le dio un balón de baloncesto a", "clean_answer": " Sarah", "patch_answer": " Jonathan", "case": "BABA_16"},
    {"clean_prefix": "Luego, Daniel y Samantha fueron a la casa. Daniel le dio un beso a", "patch_prefix": "Luego, Courtney y Lindsey fueron a la casa. Elizabeth le dio un beso a", "clean_answer": " Samantha", "patch_answer": " Daniel", "case": "BABA_16"},
    {"clean_prefix": "Luego, Alicia y Amy fueron a la casa. Alicia le dio un anillo a", "patch_prefix": "Luego, Charles y Richard fueron a la casa. Nicole le dio un anillo a", "clean_answer": " Amy", "patch_answer": " Alicia", "case": "BABA_16"},
    {"clean_prefix": "Luego, Alicia y Aaron fueron a la casa. Alicia le dio un hueso a", "patch_prefix": "Luego, Tiffany y Lindsey fueron a la casa. Ryan le dio un hueso a", "clean_answer": " Aaron", "patch_answer": " Alicia", "case": "BABA_16"},
    {"clean_prefix": "Luego, Nicholas y Courtney fueron a la escuela. Nicholas le dio una computadora a", "patch_prefix": "Luego, Patrick y Christina fueron a la escuela. Mark le dio una computadora a", "clean_answer": " Courtney", "patch_answer": " Nicholas", "case": "BABA_16"},
    {"clean_prefix": "Luego, Kimberly y Kelly fueron al hospital. Kimberly le dio una bebida a", "patch_prefix": "Luego, Dustin y Kevin fueron al hospital. Melissa le dio una bebida a", "clean_answer": " Kelly", "patch_answer": " Kimberly", "case": "BABA_16"},
    {"clean_prefix": "Luego, Nicole y Ashley fueron al hospital. Nicole le dio un balón de baloncesto a", "patch_prefix": "Luego, Rebecca y Stephen fueron al hospital. Lisa le dio un balón de baloncesto a", "clean_answer": " Ashley", "patch_answer": " Nicole", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jonathan y Katie fueron al jardín. Jonathan le dio un collar a", "patch_prefix": "Luego, Cody y Amanda fueron al jardín. Ryan le dio un collar a", "clean_answer": " Katie", "patch_answer": " Jonathan", "case": "BABA_16"},
    {"clean_prefix": "Luego, Robert y Courtney fueron a la escuela. Robert le dio un anillo a", "patch_prefix": "Luego, Scott y Christina fueron a la escuela. Jonathan le dio un anillo a", "clean_answer": " Courtney", "patch_answer": " Robert", "case": "BABA_16"},
    {"clean_prefix": "Luego, Sean y Ashley fueron a la escuela. Sean le dio una computadora a", "patch_prefix": "Luego, Amanda y Samuel fueron a la escuela. Kenneth le dio una computadora a", "clean_answer": " Ashley", "patch_answer": " Sean", "case": "BABA_16"},
    {"clean_prefix": "Luego, Charles y Brian fueron a la tienda. Charles le dio un beso a", "patch_prefix": "Luego, Jeffrey y Brandon fueron a la tienda. Courtney le dio un beso a", "clean_answer": " Brian", "patch_answer": " Charles", "case": "BABA_16"},
    {"clean_prefix": "Luego, Allison y Lisa fueron al restaurante. Allison le dio una computadora a", "patch_prefix": "Luego, Dustin y Richard fueron al restaurante. Vanessa le dio una computadora a", "clean_answer": " Lisa", "patch_answer": " Allison", "case": "BABA_16"},
    {"clean_prefix": "Luego, Michael y Samuel fueron a la casa. Michael le dio un balón de baloncesto a", "patch_prefix": "Luego, Matthew y Scott fueron a la casa. Lauren le dio un balón de baloncesto a", "clean_answer": " Samuel", "patch_answer": " Michael", "case": "BABA_16"},
    {"clean_prefix": "Luego, Michael y Sarah fueron a la estación. Michael le dio un beso a", "patch_prefix": "Luego, Thomas y Sara fueron a la estación. Jeremy le dio un beso a", "clean_answer": " Sarah", "patch_answer": " Michael", "case": "BABA_16"},
    {"clean_prefix": "Luego, Melissa y William fueron al hospital. Melissa le dio una bebida a", "patch_prefix": "Luego, Heather y Bradley fueron al hospital. Michelle le dio una bebida a", "clean_answer": " William", "patch_answer": " Melissa", "case": "BABA_16"},
    {"clean_prefix": "Luego, Erin y Lindsey fueron a la estación. Erin le dio una computadora a", "patch_prefix": "Luego, Mark y Stephen fueron a la estación. Brandon le dio una computadora a", "clean_answer": " Lindsey", "patch_answer": " Erin", "case": "BABA_16"},
    {"clean_prefix": "Luego, Bryan y Melissa fueron a la escuela. Bryan le dio un hueso a", "patch_prefix": "Luego, Angela y Katherine fueron a la escuela. Mark le dio un hueso a", "clean_answer": " Melissa", "patch_answer": " Bryan", "case": "BABA_16"},
    {"clean_prefix": "Luego, Samuel y Mark fueron al jardín. Samuel le dio un anillo a", "patch_prefix": "Luego, Steven y Matthew fueron al jardín. Charles le dio un anillo a", "clean_answer": " Mark", "patch_answer": " Samuel", "case": "BABA_16"},
    {"clean_prefix": "Luego, Stephen y Stephanie fueron a la tienda. Stephen le dio un beso a", "patch_prefix": "Luego, Katherine y Jonathan fueron a la tienda. Gregory le dio un beso a", "clean_answer": " Stephanie", "patch_answer": " Stephen", "case": "BABA_16"},
    {"clean_prefix": "Luego, Justin y Melissa fueron al restaurante. Justin le dio un balón de baloncesto a", "patch_prefix": "Luego, Dustin y Joshua fueron al restaurante. Joseph le dio un balón de baloncesto a", "clean_answer": " Melissa", "patch_answer": " Justin", "case": "BABA_16"},
    {"clean_prefix": "Luego, Eric y Bryan fueron a la tienda. Eric le dio un anillo a", "patch_prefix": "Luego, Courtney y Kristen fueron a la tienda. Tyler le dio un anillo a", "clean_answer": " Bryan", "patch_answer": " Eric", "case": "BABA_16"},
    {"clean_prefix": "Luego, Kenneth y Amanda fueron a la casa. Kenneth le dio una computadora a", "patch_prefix": "Luego, Melissa y Heather fueron a la casa. Jason le dio una computadora a", "clean_answer": " Amanda", "patch_answer": " Kenneth", "case": "BABA_16"},
    {"clean_prefix": "Luego, Kevin y Erin fueron al restaurante. Kevin le dio un beso a", "patch_prefix": "Luego, Lindsey y Anthony fueron al restaurante. Amber le dio un beso a", "clean_answer": " Erin", "patch_answer": " Kevin", "case": "BABA_16"},
    {"clean_prefix": "Luego, Timothy y John fueron a la casa. Timothy le dio una computadora a", "patch_prefix": "Luego, Cody y Matthew fueron a la casa. Andrea le dio una computadora a", "clean_answer": " John", "patch_answer": " Timothy", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jeffrey y Andrew fueron al jardín. Jeffrey le dio un hueso a", "patch_prefix": "Luego, Jeffrey y Benjamin fueron al jardín. Jesse le dio un hueso a", "clean_answer": " Andrew", "patch_answer": " Jeffrey", "case": "BABA_16"},
    {"clean_prefix": "Luego, Angela y Jeremy fueron al hospital. Angela le dio un collar a", "patch_prefix": "Luego, Christopher y Christina fueron al hospital. Paul le dio un collar a", "clean_answer": " Jeremy", "patch_answer": " Angela", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jessica y Allison fueron a la tienda. Jessica le dio un anillo a", "patch_prefix": "Luego, Melissa y Amanda fueron a la tienda. Mary le dio un anillo a", "clean_answer": " Allison", "patch_answer": " Jessica", "case": "BABA_16"},
    {"clean_prefix": "Luego, Andrew y Lauren fueron al jardín. Andrew le dio una computadora a", "patch_prefix": "Luego, Erin y Lisa fueron al jardín. Kimberly le dio una computadora a", "clean_answer": " Lauren", "patch_answer": " Andrew", "case": "BABA_16"},
    {"clean_prefix": "Luego, Steven y Kevin fueron al jardín. Steven le dio un hueso a", "patch_prefix": "Luego, Emily y Robert fueron al jardín. Michelle le dio un hueso a", "clean_answer": " Kevin", "patch_answer": " Steven", "case": "BABA_16"},
    {"clean_prefix": "Luego, Kimberly y Jeffrey fueron a la oficina. Kimberly le dio un anillo a", "patch_prefix": "Luego, Jamie y Jessica fueron a la oficina. Brittany le dio un anillo a", "clean_answer": " Jeffrey", "patch_answer": " Kimberly", "case": "BABA_16"},
    {"clean_prefix": "Luego, Christina y Jeremy fueron al hospital. Christina le dio un anillo a", "patch_prefix": "Luego, Jose y Mark fueron al hospital. Kelly le dio un anillo a", "clean_answer": " Jeremy", "patch_answer": " Christina", "case": "BABA_16"},
    {"clean_prefix": "Luego, Amber y Sean fueron a la escuela. Amber le dio un beso a", "patch_prefix": "Luego, Stephanie y Jennifer fueron a la escuela. Mary le dio un beso a", "clean_answer": " Sean", "patch_answer": " Amber", "case": "BABA_16"},
    {"clean_prefix": "Luego, Travis y Kenneth fueron al jardín. Travis le dio una computadora a", "patch_prefix": "Luego, Jennifer y Mary fueron al jardín. Jeffrey le dio una computadora a", "clean_answer": " Kenneth", "patch_answer": " Travis", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jamie y Jacob fueron a la estación. Jamie le dio un balón de baloncesto a", "patch_prefix": "Luego, Thomas y Mary fueron a la estación. David le dio un balón de baloncesto a", "clean_answer": " Jacob", "patch_answer": " Jamie", "case": "BABA_16"},
    {"clean_prefix": "Luego, Crystal y Laura fueron a la oficina. Crystal le dio un balón de baloncesto a", "patch_prefix": "Luego, Eric y Adam fueron a la oficina. David le dio un balón de baloncesto a", "clean_answer": " Laura", "patch_answer": " Crystal", "case": "BABA_16"},
    {"clean_prefix": "Luego, Amy y Jeffrey fueron al hospital. Amy le dio un balón de baloncesto a", "patch_prefix": "Luego, Vanessa y Samuel fueron al hospital. Steven le dio un balón de baloncesto a", "clean_answer": " Jeffrey", "patch_answer": " Amy", "case": "BABA_16"},
    {"clean_prefix": "Luego, Amy y Daniel fueron al restaurante. Amy le dio un balón de baloncesto a", "patch_prefix": "Luego, David y Matthew fueron al restaurante. Alicia le dio un balón de baloncesto a", "clean_answer": " Daniel", "patch_answer": " Amy", "case": "BABA_16"},
    {"clean_prefix": "Luego, Amy y Brittany fueron al jardín. Amy le dio un beso a", "patch_prefix": "Luego, Brittany y Michael fueron al jardín. Christopher le dio un beso a", "clean_answer": " Brittany", "patch_answer": " Amy", "case": "BABA_16"},
    {"clean_prefix": "Luego, Sarah y Kimberly fueron a la oficina. Sarah le dio un bocadillo a", "patch_prefix": "Luego, Matthew y Christine fueron a la oficina. Kyle le dio un bocadillo a", "clean_answer": " Kimberly", "patch_answer": " Sarah", "case": "BABA_16"},
    {"clean_prefix": "Luego, Dustin y Jeremy fueron a la oficina. Dustin le dio un collar a", "patch_prefix": "Luego, Alexander y Patrick fueron a la oficina. Alicia le dio un collar a", "clean_answer": " Jeremy", "patch_answer": " Dustin", "case": "BABA_16"},
    {"clean_prefix": "Luego, Shannon y Matthew fueron a la oficina. Shannon le dio un collar a", "patch_prefix": "Luego, Ashley y Michael fueron a la oficina. Michelle le dio un collar a", "clean_answer": " Matthew", "patch_answer": " Shannon", "case": "BABA_16"},
    {"clean_prefix": "Luego, Vanessa y Ryan fueron a la oficina. Vanessa le dio un anillo a", "patch_prefix": "Luego, Elizabeth y Jason fueron a la oficina. Joseph le dio un anillo a", "clean_answer": " Ryan", "patch_answer": " Vanessa", "case": "BABA_16"},
    {"clean_prefix": "Luego, Aaron y Lindsay fueron a la escuela. Aaron le dio un anillo a", "patch_prefix": "Luego, Stephen y Elizabeth fueron a la escuela. Alexander le dio un anillo a", "clean_answer": " Lindsay", "patch_answer": " Aaron", "case": "BABA_16"},
    {"clean_prefix": "Luego, Gregory y Bryan fueron a la oficina. Gregory le dio un collar a", "patch_prefix": "Luego, Jessica y Steven fueron a la oficina. Jesse le dio un collar a", "clean_answer": " Bryan", "patch_answer": " Gregory", "case": "BABA_16"},
    {"clean_prefix": "Luego, Katie y Kyle fueron a la tienda. Katie le dio un collar a", "patch_prefix": "Luego, Alicia y Jacob fueron a la tienda. Christina le dio un collar a", "clean_answer": " Kyle", "patch_answer": " Katie", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jonathan y Danielle fueron al jardín. Jonathan le dio una bebida a", "patch_prefix": "Luego, Dustin y Erin fueron al jardín. Christine le dio una bebida a", "clean_answer": " Danielle", "patch_answer": " Jonathan", "case": "BABA_16"},
    {"clean_prefix": "Luego, Rebecca y Kristen fueron a la oficina. Rebecca le dio un anillo a", "patch_prefix": "Luego, Jeffrey y Alicia fueron a la oficina. Shannon le dio un anillo a", "clean_answer": " Kristen", "patch_answer": " Rebecca", "case": "BABA_16"},
    {"clean_prefix": "Luego, Amanda y Nathan fueron al jardín. Amanda le dio una bebida a", "patch_prefix": "Luego, Jason y Kyle fueron al jardín. Alexander le dio una bebida a", "clean_answer": " Nathan", "patch_answer": " Amanda", "case": "BABA_16"},
    {"clean_prefix": "Luego, Brandon y Jeremy fueron al hospital. Brandon le dio una bebida a", "patch_prefix": "Luego, Travis y Travis fueron al hospital. Joshua le dio una bebida a", "clean_answer": " Jeremy", "patch_answer": " Brandon", "case": "BABA_16"},
    {"clean_prefix": "Luego, Ashley y Sara fueron a la escuela. Ashley le dio un hueso a", "patch_prefix": "Luego, Aaron y Christopher fueron a la escuela. Katherine le dio un hueso a", "clean_answer": " Sara", "patch_answer": " Ashley", "case": "BABA_16"},
    {"clean_prefix": "Luego, Stephanie y Jacob fueron a la escuela. Stephanie le dio un anillo a", "patch_prefix": "Luego, Lauren y Ryan fueron a la escuela. Brittany le dio un anillo a", "clean_answer": " Jacob", "patch_answer": " Stephanie", "case": "BABA_16"},
    {"clean_prefix": "Luego, Stephen y Kelly fueron a la casa. Stephen le dio una computadora a", "patch_prefix": "Luego, Nicole y Alexander fueron a la casa. Christopher le dio una computadora a", "clean_answer": " Kelly", "patch_answer": " Stephen", "case": "BABA_16"},
    {"clean_prefix": "Luego, Sean y Charles fueron al hospital. Sean le dio una bebida a", "patch_prefix": "Luego, Matthew y Benjamin fueron al hospital. Shannon le dio una bebida a", "clean_answer": " Charles", "patch_answer": " Sean", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jennifer y Bradley fueron a la oficina. Jennifer le dio una bebida a", "patch_prefix": "Luego, Stephen y Stephanie fueron a la oficina. Amy le dio una bebida a", "clean_answer": " Bradley", "patch_answer": " Jennifer", "case": "BABA_16"},
    {"clean_prefix": "Luego, Mary y Daniel fueron a la casa. Mary le dio un hueso a", "patch_prefix": "Luego, Tiffany y David fueron a la casa. Sarah le dio un hueso a", "clean_answer": " Daniel", "patch_answer": " Mary", "case": "BABA_16"},
    {"clean_prefix": "Luego, Christopher y Laura fueron a la casa. Christopher le dio un balón de baloncesto a", "patch_prefix": "Luego, Sean y Jeffrey fueron a la casa. David le dio un balón de baloncesto a", "clean_answer": " Laura", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Luego, Anthony y Jessica fueron al hospital. Anthony le dio un beso a", "patch_prefix": "Luego, Sean y James fueron al hospital. Benjamin le dio un beso a", "clean_answer": " Jessica", "patch_answer": " Anthony", "case": "BABA_16"},
    {"clean_prefix": "Luego, James y Kyle fueron al restaurante. James le dio un balón de baloncesto a", "patch_prefix": "Luego, Matthew y Joshua fueron al restaurante. Paul le dio un balón de baloncesto a", "clean_answer": " Kyle", "patch_answer": " James", "case": "BABA_16"},
    {"clean_prefix": "Luego, Aaron y Rachel fueron al hospital. Aaron le dio un balón de baloncesto a", "patch_prefix": "Luego, Lauren y Daniel fueron al hospital. Brittany le dio un balón de baloncesto a", "clean_answer": " Rachel", "patch_answer": " Aaron", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jesse y Lisa fueron al hospital. Jesse le dio un hueso a", "patch_prefix": "Luego, Mark y Tyler fueron al hospital. Jennifer le dio un hueso a", "clean_answer": " Lisa", "patch_answer": " Jesse", "case": "BABA_16"},
    {"clean_prefix": "Luego, Tiffany y Lauren fueron al hospital. Tiffany le dio un collar a", "patch_prefix": "Luego, Nicholas y Justin fueron al hospital. Laura le dio un collar a", "clean_answer": " Lauren", "patch_answer": " Tiffany", "case": "BABA_16"},
    {"clean_prefix": "Luego, Joshua y Lisa fueron a la estación. Joshua le dio un collar a", "patch_prefix": "Luego, Erin y Christine fueron a la estación. Jose le dio un collar a", "clean_answer": " Lisa", "patch_answer": " Joshua", "case": "BABA_16"},
    {"clean_prefix": "Luego, Stephen y Andrea fueron a la casa. Stephen le dio un balón de baloncesto a", "patch_prefix": "Luego, Amanda y Robert fueron a la casa. Joshua le dio un balón de baloncesto a", "clean_answer": " Andrea", "patch_answer": " Stephen", "case": "BABA_16"},
    {"clean_prefix": "Luego, Kelly y Rachel fueron a la escuela. Kelly le dio un balón de baloncesto a", "patch_prefix": "Luego, Brittany y Crystal fueron a la escuela. Katie le dio un balón de baloncesto a", "clean_answer": " Rachel", "patch_answer": " Kelly", "case": "BABA_16"},
    {"clean_prefix": "Luego, Tiffany y Jamie fueron a la tienda. Tiffany le dio una computadora a", "patch_prefix": "Luego, Brian y Tyler fueron a la tienda. Matthew le dio una computadora a", "clean_answer": " Jamie", "patch_answer": " Tiffany", "case": "BABA_16"},
    {"clean_prefix": "Luego, Nicholas y Megan fueron a la escuela. Nicholas le dio un balón de baloncesto a", "patch_prefix": "Luego, Tiffany y Robert fueron a la escuela. Heather le dio un balón de baloncesto a", "clean_answer": " Megan", "patch_answer": " Nicholas", "case": "BABA_16"},
    {"clean_prefix": "Luego, Nicole y Crystal fueron a la escuela. Nicole le dio un balón de baloncesto a", "patch_prefix": "Luego, Aaron y Michelle fueron a la escuela. Steven le dio un balón de baloncesto a", "clean_answer": " Crystal", "patch_answer": " Nicole", "case": "BABA_16"},
    {"clean_prefix": "Luego, Vanessa y Samuel fueron a la escuela. Vanessa le dio un anillo a", "patch_prefix": "Luego, Kevin y Charles fueron a la escuela. Joseph le dio un anillo a", "clean_answer": " Samuel", "patch_answer": " Vanessa", "case": "BABA_16"},
    {"clean_prefix": "Luego, Robert y Danielle fueron al hospital. Robert le dio una computadora a", "patch_prefix": "Luego, Amy y Matthew fueron al hospital. Jason le dio una computadora a", "clean_answer": " Danielle", "patch_answer": " Robert", "case": "BABA_16"},
    {"clean_prefix": "Luego, Robert y Sarah fueron a la tienda. Robert le dio un balón de baloncesto a", "patch_prefix": "Luego, Christopher y Elizabeth fueron a la tienda. Amber le dio un balón de baloncesto a", "clean_answer": " Sarah", "patch_answer": " Robert", "case": "BABA_16"},
    {"clean_prefix": "Luego, Benjamin y Brittany fueron al hospital. Benjamin le dio un balón de baloncesto a", "patch_prefix": "Luego, Ryan y Andrea fueron al hospital. Ryan le dio un balón de baloncesto a", "clean_answer": " Brittany", "patch_answer": " Benjamin", "case": "BABA_16"},
    {"clean_prefix": "Luego, David y Andrea fueron a la escuela. David le dio un hueso a", "patch_prefix": "Luego, Erin y Bradley fueron a la escuela. Jeremy le dio un hueso a", "clean_answer": " Andrea", "patch_answer": " David", "case": "BABA_16"},
    {"clean_prefix": "Luego, Erica y Scott fueron a la estación. Erica le dio una computadora a", "patch_prefix": "Luego, Nicholas y Adam fueron a la estación. Danielle le dio una computadora a", "clean_answer": " Scott", "patch_answer": " Erica", "case": "BABA_16"},
    {"clean_prefix": "Luego, Sara y Brittany fueron al jardín. Sara le dio una computadora a", "patch_prefix": "Luego, Michael y Rebecca fueron al jardín. Kenneth le dio una computadora a", "clean_answer": " Brittany", "patch_answer": " Sara", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jeffrey y Mary fueron al restaurante. Jeffrey le dio una computadora a", "patch_prefix": "Luego, Crystal y Sara fueron al restaurante. Jennifer le dio una computadora a", "clean_answer": " Mary", "patch_answer": " Jeffrey", "case": "BABA_16"},
    {"clean_prefix": "Luego, Patrick y Brittany fueron a la casa. Patrick le dio un collar a", "patch_prefix": "Luego, Rachel y Jacob fueron a la casa. Lindsey le dio un collar a", "clean_answer": " Brittany", "patch_answer": " Patrick", "case": "BABA_16"},
    {"clean_prefix": "Luego, Brittany y Jeffrey fueron a la estación. Brittany le dio un balón de baloncesto a", "patch_prefix": "Luego, Jessica y Melissa fueron a la estación. Angela le dio un balón de baloncesto a", "clean_answer": " Jeffrey", "patch_answer": " Brittany", "case": "BABA_16"},
    {"clean_prefix": "Luego, Erin y Jennifer fueron al restaurante. Erin le dio un beso a", "patch_prefix": "Luego, Adam y Stephen fueron al restaurante. Christine le dio un beso a", "clean_answer": " Jennifer", "patch_answer": " Erin", "case": "BABA_16"},
    {"clean_prefix": "Luego, Heather y Samantha fueron al jardín. Heather le dio un beso a", "patch_prefix": "Luego, Joseph y Richard fueron al jardín. Vanessa le dio un beso a", "clean_answer": " Samantha", "patch_answer": " Heather", "case": "BABA_16"},
    {"clean_prefix": "Luego, Benjamin y Ryan fueron a la escuela. Benjamin le dio un refrigerio a", "patch_prefix": "Luego, Andrea y Heather fueron a la escuela. Lauren le dio un refrigerio a", "clean_answer": " Ryan", "patch_answer": " Benjamin", "case": "BABA_16"},
    {"clean_prefix": "Luego, Vanessa y Angela fueron al jardín. Vanessa le dio un anillo a", "patch_prefix": "Luego, Robert y Heather fueron al jardín. Bryan le dio un anillo a", "clean_answer": " Angela", "patch_answer": " Vanessa", "case": "BABA_16"},
    {"clean_prefix": "Luego, Rebecca y Melissa fueron al restaurante. Rebecca le dio una computadora a", "patch_prefix": "Luego, Jennifer y Elizabeth fueron al restaurante. Elizabeth le dio una computadora a", "clean_answer": " Melissa", "patch_answer": " Rebecca", "case": "BABA_16"},
    {"clean_prefix": "Luego, David y Rachel fueron a la escuela. David le dio un anillo a", "patch_prefix": "Luego, Joshua y Lindsay fueron a la escuela. Kevin le dio un anillo a", "clean_answer": " Rachel", "patch_answer": " David", "case": "BABA_16"},
    {"clean_prefix": "Luego, Kimberly y Michelle fueron a la escuela. Kimberly le dio un balón de baloncesto a", "patch_prefix": "Luego, Rachel y Stephanie fueron a la escuela. Angela le dio un balón de baloncesto a", "clean_answer": " Michelle", "patch_answer": " Kimberly", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jessica y Laura fueron al jardín. Jessica le dio un anillo a", "patch_prefix": "Luego, Christina y Andrea fueron al jardín. Alicia le dio un anillo a", "clean_answer": " Laura", "patch_answer": " Jessica", "case": "BABA_16"},
    {"clean_prefix": "Luego, Richard y Eric fueron al jardín. Richard le dio una bebida a", "patch_prefix": "Luego, Joshua y Thomas fueron al jardín. Lisa le dio una bebida a", "clean_answer": " Eric", "patch_answer": " Richard", "case": "BABA_16"},
    {"clean_prefix": "Luego, Brandon y Eric fueron a la escuela. Brandon le dio un refrigerio a", "patch_prefix": "Luego, Jeremy y Erin fueron a la escuela. Stephanie le dio un refrigerio a", "clean_answer": " Eric", "patch_answer": " Brandon", "case": "BABA_16"},
    {"clean_prefix": "Luego, Lauren y Matthew fueron al jardín. Lauren le dio una bebida a", "patch_prefix": "Luego, Michelle y Scott fueron al jardín. Ashley le dio una bebida a", "clean_answer": " Matthew", "patch_answer": " Lauren", "case": "BABA_16"},
    {"clean_prefix": "Luego, James y Sarah fueron al hospital. James le dio una computadora a", "patch_prefix": "Luego, Amy y Angela fueron al hospital. Michael le dio una computadora a", "clean_answer": " Sarah", "patch_answer": " James", "case": "BABA_16"},
    {"clean_prefix": "Luego, James y Daniel fueron a la tienda. James le dio un collar a", "patch_prefix": "Luego, Stephanie y Aaron fueron a la tienda. Dustin le dio un collar a", "clean_answer": " Daniel", "patch_answer": " James", "case": "BABA_16"},
    {"clean_prefix": "Luego, Samuel y Steven fueron a la escuela. Samuel le dio una computadora a", "patch_prefix": "Luego, Jose y Jeffrey fueron a la escuela. Kelly le dio una computadora a", "clean_answer": " Steven", "patch_answer": " Samuel", "case": "BABA_16"},
    {"clean_prefix": "Luego, Christopher y Gregory fueron a la casa. Christopher le dio una computadora a", "patch_prefix": "Luego, Jeremy y Amy fueron a la casa. James le dio una computadora a", "clean_answer": " Gregory", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jennifer y Jessica fueron al restaurante. Jennifer le dio un refrigerio a", "patch_prefix": "Luego, Amanda y Angela fueron al restaurante. Paul le dio un refrigerio a", "clean_answer": " Jessica", "patch_answer": " Jennifer", "case": "BABA_16"},
    {"clean_prefix": "Luego, Mary y Eric fueron a la oficina. Mary le dio una computadora a", "patch_prefix": "Luego, Timothy y Nathan fueron a la oficina. Brandon le dio una computadora a", "clean_answer": " Eric", "patch_answer": " Mary", "case": "BABA_16"},
    {"clean_prefix": "Luego, Kevin y Steven fueron a la oficina. Kevin le dio una computadora a", "patch_prefix": "Luego, Paul y Sean fueron a la oficina. Heather le dio una computadora a", "clean_answer": " Steven", "patch_answer": " Kevin", "case": "BABA_16"},
    {"clean_prefix": "Luego, Stephanie y Lindsey fueron a la escuela. Stephanie le dio una computadora a", "patch_prefix": "Luego, Ashley y Jennifer fueron a la escuela. Lauren le dio una computadora a", "clean_answer": " Lindsey", "patch_answer": " Stephanie", "case": "BABA_16"},
    {"clean_prefix": "Luego, Aaron y Dustin fueron al jardín. Aaron le dio un balón de baloncesto a", "patch_prefix": "Luego, Samuel y Emily fueron al jardín. Paul le dio un balón de baloncesto a", "clean_answer": " Dustin", "patch_answer": " Aaron", "case": "BABA_16"},
    {"clean_prefix": "Luego, Alexander y David fueron a la escuela. Alexander le dio una bebida a", "patch_prefix": "Luego, Andrew y Kimberly fueron a la escuela. Steven le dio una bebida a", "clean_answer": " David", "patch_answer": " Alexander", "case": "BABA_16"},
    {"clean_prefix": "Luego, Crystal y Andrea fueron al restaurante. Crystal le dio una bebida a", "patch_prefix": "Luego, Kristen y Sean fueron al restaurante. Timothy le dio una bebida a", "clean_answer": " Andrea", "patch_answer": " Crystal", "case": "BABA_16"},
    {"clean_prefix": "Luego, Ashley y Elizabeth fueron a la estación. Ashley le dio un refrigerio a", "patch_prefix": "Luego, Jeremy y Brandon fueron a la estación. Samuel le dio un refrigerio a", "clean_answer": " Elizabeth", "patch_answer": " Ashley", "case": "BABA_16"},
    {"clean_prefix": "Luego, Amber y Jesse fueron al restaurante. Amber le dio una computadora a", "patch_prefix": "Luego, Andrea y Patrick fueron al restaurante. Jacob le dio una computadora a", "clean_answer": " Jesse", "patch_answer": " Amber", "case": "BABA_16"},
    {"clean_prefix": "Luego, Nathan y Nicholas fueron al hospital. Nathan le dio un balón de baloncesto a", "patch_prefix": "Luego, Benjamin y Samantha fueron al hospital. Lindsay le dio un balón de baloncesto a", "clean_answer": " Nicholas", "patch_answer": " Nathan", "case": "BABA_16"},
    {"clean_prefix": "Luego, Andrew y Rebecca fueron a la estación. Andrew le dio un collar a", "patch_prefix": "Luego, Christine y Robert fueron a la estación. Heather le dio un collar a", "clean_answer": " Rebecca", "patch_answer": " Andrew", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jamie y Rachel fueron a la tienda. Jamie le dio un balón de baloncesto a", "patch_prefix": "Luego, Nathan y Megan fueron a la tienda. Aaron le dio un balón de baloncesto a", "clean_answer": " Rachel", "patch_answer": " Jamie", "case": "BABA_16"},
    {"clean_prefix": "Luego, Sara y Kimberly fueron a la oficina. Sara le dio un collar a", "patch_prefix": "Luego, Danielle y James fueron a la oficina. Rebecca le dio un collar a", "clean_answer": " Kimberly", "patch_answer": " Sara", "case": "BABA_16"},
    {"clean_prefix": "Luego, Nicole y Rachel fueron a la tienda. Nicole le dio una bebida a", "patch_prefix": "Luego, Shannon y William fueron a la tienda. Megan le dio una bebida a", "clean_answer": " Rachel", "patch_answer": " Nicole", "case": "BABA_16"},
    {"clean_prefix": "Luego, Brandon y Katherine fueron a la tienda. Brandon le dio un hueso a", "patch_prefix": "Luego, Jessica y Jeremy fueron a la tienda. Matthew le dio un hueso a", "clean_answer": " Katherine", "patch_answer": " Brandon", "case": "BABA_16"},
    {"clean_prefix": "Luego, Eric y Anthony fueron al restaurante. Eric le dio una computadora a", "patch_prefix": "Luego, Brian y Jennifer fueron al restaurante. Rachel le dio una computadora a", "clean_answer": " Anthony", "patch_answer": " Eric", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jacob y Jason fueron al restaurante. Jacob le dio un balón de baloncesto a", "patch_prefix": "Luego, Benjamin y Travis fueron al restaurante. Kristen le dio un balón de baloncesto a", "clean_answer": " Jason", "patch_answer": " Jacob", "case": "BABA_16"},
    {"clean_prefix": "Luego, Patrick y Kristen fueron a la tienda. Patrick le dio una bebida a", "patch_prefix": "Luego, Sara y Vanessa fueron a la tienda. Jeffrey le dio una bebida a", "clean_answer": " Kristen", "patch_answer": " Patrick", "case": "BABA_16"},
    {"clean_prefix": "Luego, Christopher y Matthew fueron al hospital. Christopher le dio un hueso a", "patch_prefix": "Luego, Timothy y Joshua fueron al hospital. Charles le dio un hueso a", "clean_answer": " Matthew", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Luego, Steven y Ashley fueron a la tienda. Steven le dio una computadora a", "patch_prefix": "Luego, Kenneth y Scott fueron a la tienda. Jonathan le dio una computadora a", "clean_answer": " Ashley", "patch_answer": " Steven", "case": "BABA_16"},
    {"clean_prefix": "Luego, Erica y Jonathan fueron a la casa. Erica le dio un collar a", "patch_prefix": "Luego, Lindsay y Andrea fueron a la casa. Jason le dio un collar a", "clean_answer": " Jonathan", "patch_answer": " Erica", "case": "BABA_16"},
    {"clean_prefix": "Luego, Sean y Dustin fueron al restaurante. Sean le dio una bebida a", "patch_prefix": "Luego, Timothy y Thomas fueron al restaurante. Michael le dio una bebida a", "clean_answer": " Dustin", "patch_answer": " Sean", "case": "BABA_16"},
    {"clean_prefix": "Luego, Samantha y Ryan fueron a la estación. Samantha le dio una bebida a", "patch_prefix": "Luego, Joshua y Dustin fueron a la estación. Joseph le dio una bebida a", "clean_answer": " Ryan", "patch_answer": " Samantha", "case": "BABA_16"},
    {"clean_prefix": "Luego, Danielle y Brittany fueron al hospital. Danielle le dio un collar a", "patch_prefix": "Luego, Michelle y Justin fueron al hospital. Bryan le dio un collar a", "clean_answer": " Brittany", "patch_answer": " Danielle", "case": "BABA_16"},
    {"clean_prefix": "Luego, Ryan y Cody fueron a la tienda. Ryan le dio un hueso a", "patch_prefix": "Luego, Eric y Kristen fueron a la tienda. Daniel le dio un hueso a", "clean_answer": " Cody", "patch_answer": " Ryan", "case": "BABA_16"},
    {"clean_prefix": "Luego, Lindsay y Steven fueron a la casa. Lindsay le dio un collar a", "patch_prefix": "Luego, Lindsay y Jonathan fueron a la casa. Christina le dio un collar a", "clean_answer": " Steven", "patch_answer": " Lindsay", "case": "BABA_16"},
    {"clean_prefix": "Luego, David y James fueron a la oficina. David le dio un hueso a", "patch_prefix": "Luego, Kyle y Mary fueron a la oficina. Thomas le dio un hueso a", "clean_answer": " James", "patch_answer": " David", "case": "BABA_16"},
    {"clean_prefix": "Luego, Andrea y Kyle fueron a la escuela. Andrea le dio un collar a", "patch_prefix": "Luego, Elizabeth y Joseph fueron a la escuela. Laura le dio un collar a", "clean_answer": " Kyle", "patch_answer": " Andrea", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jason y Anthony fueron a la estación. Jason le dio una bebida a", "patch_prefix": "Luego, Jessica y Nathan fueron a la estación. Anthony le dio una bebida a", "clean_answer": " Anthony", "patch_answer": " Jason", "case": "BABA_16"},
    {"clean_prefix": "Luego, Kevin y James fueron a la casa. Kevin le dio un collar a", "patch_prefix": "Luego, Lindsey y Jason fueron a la casa. Alicia le dio un collar a", "clean_answer": " James", "patch_answer": " Kevin", "case": "BABA_16"},
    {"clean_prefix": "Luego, Bryan y Bradley fueron al restaurante. Bryan le dio un collar a", "patch_prefix": "Luego, Justin y Anthony fueron al restaurante. Charles le dio un collar a", "clean_answer": " Bradley", "patch_answer": " Bryan", "case": "BABA_16"},
    {"clean_prefix": "Luego, Elizabeth y Brandon fueron al restaurante. Elizabeth le dio un refrigerio a", "patch_prefix": "Luego, Jamie y Erin fueron al restaurante. Richard le dio un refrigerio a", "clean_answer": " Brandon", "patch_answer": " Elizabeth", "case": "BABA_16"},
    {"clean_prefix": "Luego, Jessica y Jennifer fueron a la casa. Jessica le dio un hueso a", "patch_prefix": "Luego, Jason y Joseph fueron a la casa. Brian le dio un hueso a", "clean_answer": " Jennifer", "patch_answer": " Jessica", "case": "BABA_16"},
    {"clean_prefix": "Luego, Bryan y Elizabeth fueron a la casa. Bryan le dio un hueso a", "patch_prefix": "Luego, Amber y Richard fueron a la casa. Tyler le dio un hueso a", "clean_answer": " Elizabeth", "patch_answer": " Bryan", "case": "BABA_16"},
    {"clean_prefix": "Luego, Joshua y Jose fueron a la escuela. Joshua le dio un beso a", "patch_prefix": "Luego, Ashley y Amy fueron a la escuela. Lisa le dio un beso a", "clean_answer": " Jose", "patch_answer": " Joshua", "case": "BABA_16"},
    {"clean_prefix": "Luego, Katherine y Adam fueron al jardín. Katherine le dio un anillo a", "patch_prefix": "Luego, Ashley y Aaron fueron al jardín. Justin le dio un anillo a", "clean_answer": " Adam", "patch_answer": " Katherine", "case": "BABA_16"},
    {"clean_prefix": "Luego, Sarah y Megan fueron a la oficina. Sarah le dio una bebida a", "patch_prefix": "Luego, Justin y Rebecca fueron a la oficina. Katherine le dio una bebida a", "clean_answer": " Megan", "patch_answer": " Sarah", "case": "BABA_16"},
    {"clean_prefix": "Luego, Kyle y Christina fueron a la tienda. Kyle le dio un hueso a", "patch_prefix": "Luego, James y Cody fueron a la tienda. Jamie le dio un hueso a", "clean_answer": " Christina", "patch_answer": " Kyle", "case": "BABA_16"},
    {"clean_prefix": "Luego, Richard y Jeffrey fueron al restaurante. Richard le dio un refrigerio a", "patch_prefix": "Luego, Michelle y Lindsay fueron al restaurante. Matthew le dio un refrigerio a", "clean_answer": " Jeffrey", "patch_answer": " Richard", "case": "BABA_16"},
    {"clean_prefix": "Luego, William y Benjamin fueron a la estación. William le dio un hueso a", "patch_prefix": "Luego, Lindsey y Erica fueron a la estación. William le dio un hueso a", "clean_answer": " Benjamin", "patch_answer": " William", "case": "BABA_16"},
    {"clean_prefix": "Luego, John y Vanessa fueron a la estación. John le dio un hueso a", "patch_prefix": "Luego, Steven y Amanda fueron a la estación. Jeffrey le dio un hueso a", "clean_answer": " Vanessa", "patch_answer": " John", "case": "BABA_16"},
    {"clean_prefix": "Luego, Scott y Amber fueron al jardín. Scott le dio una computadora a", "patch_prefix": "Luego, Matthew y Anthony fueron al jardín. Sean le dio una computadora a", "clean_answer": " Amber", "patch_answer": " Scott", "case": "BABA_16"},
    {"clean_prefix": "Luego, Amber y Kevin fueron al jardín. Amber le dio una bebida a", "patch_prefix": "Luego, Daniel y Jason fueron al jardín. Bradley le dio una bebida a", "clean_answer": " Kevin", "patch_answer": " Amber", "case": "BABA_16"},
    {"clean_prefix": "Luego, Timothy y Christine fueron al hospital. Timothy le dio una bebida a", "patch_prefix": "Luego, Shannon y Sara fueron al hospital. Nicole le dio una bebida a", "clean_answer": " Christine", "patch_answer": " Timothy", "case": "BABA_16"},
    {"clean_prefix": "Luego, Alexander y Anthony fueron a la escuela. Alexander le dio un collar a", "patch_prefix": "Luego, Thomas y Tyler fueron a la escuela. Angela le dio un collar a", "clean_answer": " Anthony", "patch_answer": " Alexander", "case": "BABA_16"},
    {"clean_prefix": "Luego, Heather y Rachel fueron a la casa. Heather le dio una bebida a", "patch_prefix": "Luego, Travis y Rebecca fueron a la casa. Courtney le dio una bebida a", "clean_answer": " Rachel", "patch_answer": " Heather", "case": "BABA_16"},
    {"clean_prefix": "Luego, Joshua y Amber fueron al jardín. Joshua le dio un beso a", "patch_prefix": "Luego, Richard y Amanda fueron al jardín. Sarah le dio un beso a", "clean_answer": " Amber", "patch_answer": " Joshua", "case": "BABA_16"},
    {"clean_prefix": "Luego, Joshua y Courtney fueron al restaurante. Joshua le dio una bebida a", "patch_prefix": "Luego, Nathan y Benjamin fueron al restaurante. Alexander le dio una bebida a", "clean_answer": " Courtney", "patch_answer": " Joshua", "case": "BABA_16"},
    {"clean_prefix": "Luego, Christopher y Jonathan fueron a la estación. Christopher le dio una computadora a", "patch_prefix": "Luego, Matthew y Andrea fueron a la estación. Mary le dio una computadora a", "clean_answer": " Jonathan", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Luego, Ryan y Jonathan fueron al restaurante. Ryan le dio un bocadillo a", "patch_prefix": "Luego, Samantha y Christine fueron al restaurante. Jesse le dio un bocadillo a", "clean_answer": " Jonathan", "patch_answer": " Ryan", "case": "BABA_16"},
    {"clean_prefix": "Luego, Erica y Christopher fueron al hospital. Erica le dio un balón de baloncesto a", "patch_prefix": "Luego, Nicole y Crystal fueron al hospital. Nicole le dio un balón de baloncesto a", "clean_answer": " Christopher", "patch_answer": " Erica", "case": "BABA_16"},
    {"clean_prefix": "Luego, Eric y Sean fueron a la casa. Eric le dio un bocadillo a", "patch_prefix": "Luego, Emily y William fueron a la casa. Kristen le dio un bocadillo a", "clean_answer": " Sean", "patch_answer": " Eric", "case": "BABA_16"},
    {"clean_prefix": "Luego, Alexander y Jamie fueron a la tienda. Alexander le dio una bebida a", "patch_prefix": "Luego, Matthew y Patrick fueron a la tienda. Melissa le dio una bebida a", "clean_answer": " Jamie", "patch_answer": " Alexander", "case": "BABA_16"},
    {"clean_prefix": "Luego, Courtney y Jennifer fueron a la casa. Courtney le dio una computadora a", "patch_prefix": "Luego, Heather y Brian fueron a la casa. Amber le dio una computadora a", "clean_answer": " Jennifer", "patch_answer": " Courtney", "case": "BABA_16"},
    {"clean_prefix": "Luego, Daniel y Jessica fueron a la tienda. Daniel le dio un collar a", "patch_prefix": "Luego, Angela y David fueron a la tienda. Christina le dio un collar a", "clean_answer": " Jessica", "patch_answer": " Daniel", "case": "BABA_16"},
    {"clean_prefix": "Luego, Samuel y Richard fueron a la casa. Samuel le dio un bocadillo a", "patch_prefix": "Luego, Erin y Sarah fueron a la casa. Emily le dio un bocadillo a", "clean_answer": " Richard", "patch_answer": " Samuel", "case": "BABA_16"},
    {"clean_prefix": "Luego, Scott y Lindsey fueron al hospital. Scott le dio una bebida a", "patch_prefix": "Luego, Alexander y Kyle fueron al hospital. Christine le dio una bebida a", "clean_answer": " Lindsey", "patch_answer": " Scott", "case": "BABA_16"},
    {"clean_prefix": "Luego, Timothy y Nathan fueron a la tienda. Timothy le dio una computadora a", "patch_prefix": "Luego, Brittany y Adam fueron a la tienda. Kimberly le dio una computadora a", "clean_answer": " Nathan", "patch_answer": " Timothy", "case": "BABA_16"},
    {"clean_prefix": "Luego, Alicia y Jeremy fueron a la oficina. Alicia le dio una bebida a", "patch_prefix": "Luego, Kelly y Christina fueron a la oficina. Samuel le dio una bebida a", "clean_answer": " Jeremy", "patch_answer": " Alicia", "case": "BABA_16"},
    {"clean_prefix": "Luego, Katherine y Jeremy fueron a la escuela. Katherine le dio un beso a", "patch_prefix": "Luego, Elizabeth y Patrick fueron a la escuela. Vanessa le dio un beso a", "clean_answer": " Jeremy", "patch_answer": " Katherine", "case": "BABA_16"},
    {"clean_prefix": "Luego, Charles y Steven fueron al restaurante. Charles le dio una computadora a", "patch_prefix": "Luego, Bryan y Megan fueron al restaurante. Tiffany le dio una computadora a", "clean_answer": " Steven", "patch_answer": " Charles", "case": "BABA_16"},
    {"clean_prefix": "Luego, Joshua y Thomas fueron a la escuela. Joshua le dio un collar a", "patch_prefix": "Luego, Jeffrey y Paul fueron a la escuela. Ashley le dio un collar a", "clean_answer": " Thomas", "patch_answer": " Joshua", "case": "BABA_16"},
    {"clean_prefix": "Luego, Kevin y Joseph fueron a la estación. Kevin le dio una computadora a", "patch_prefix": "Luego, Samantha y Jason fueron a la estación. Lauren le dio una computadora a", "clean_answer": " Joseph", "patch_answer": " Kevin", "case": "BABA_16"}
]