[
    {"clean_prefix": "Ensuite, Richard et Erica sont allés à l'hôpital. Richard a donné une boisson à", "patch_prefix": "Ensuite, Matthew et Crystal sont allés à l'hôpital. Megan a donné une boisson à", "clean_answer": " Erica", "patch_answer": " Richard", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, John et Eric sont allés à la station. John a donné un os à", "patch_prefix": "Ensuite, Rachel et Andrea sont allées à la station. Megan a donné un os à", "clean_answer": " Eric", "patch_answer": " John", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jason et Jamie sont allés au jardin. Jason a donné un collier à", "patch_prefix": "Ensuite, Michael et Jonathan sont allés au jardin. Michelle a donné un collier à", "clean_answer": " Jamie", "patch_answer": " Jason", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Matthew et Jennifer sont allés à la station. Matthew a donné un baiser à", "patch_prefix": "Ensuite, Katherine et Alicia sont allées à la station. Katherine a donné un baiser à", "clean_answer": " Jennifer", "patch_answer": " Matthew", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Lisa et Jason sont allés au restaurant. Lisa a donné un ordinateur à", "patch_prefix": "Ensuite, Christine et Justin sont allés au restaurant. Kyle a donné un ordinateur à", "clean_answer": " Jason", "patch_answer": " Lisa", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Richard et Kyle sont allés à la station. Richard a donné un collier à", "patch_prefix": "Ensuite, Mary et Erin sont allées à la station. Sara a donné un collier à", "clean_answer": " Kyle", "patch_answer": " Richard", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Joseph et Amber sont allés au jardin. Joseph a donné un ordinateur à", "patch_prefix": "Ensuite, Michael et Lindsay sont allés au jardin. Rachel a donné un ordinateur à", "clean_answer": " Amber", "patch_answer": " Joseph", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Anthony et Mark sont allés à la maison. Anthony a donné un ballon de basket à", "patch_prefix": "Ensuite, Elizabeth et Laura sont allées à la maison. Robert a donné un ballon de basket à", "clean_answer": " Mark", "patch_answer": " Anthony", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Brittany et Shannon sont allées à la station. Brittany a donné un os à", "patch_prefix": "Ensuite, Charles et Aaron sont allés à la station. Timothy a donné un os à", "clean_answer": " Shannon", "patch_answer": " Brittany", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Andrea et Sara sont allées à la station. Andrea a donné un collier à", "patch_prefix": "Ensuite, Adam et Erin sont allées à la station. Bryan a donné un collier à", "clean_answer": " Sara", "patch_answer": " Andrea", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Kristen et Robert sont allés au restaurant. Kristen a donné un ordinateur à", "patch_prefix": "Ensuite, Justin et Andrew sont allés au restaurant. Andrea a donné un ordinateur à", "clean_answer": " Robert", "patch_answer": " Kristen", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Lindsey et Kristen sont allées au restaurant. Lindsey a donné un os à", "patch_prefix": "Ensuite, Andrea et Kelly sont allées au restaurant. Rebecca a donné un os à", "clean_answer": " Kristen", "patch_answer": " Lindsey", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Adam et Stephen sont allés à l'hôpital. Adam a donné un baiser à", "patch_prefix": "Ensuite, David et Timothy sont allés à l'hôpital. Lisa a donné un baiser à", "clean_answer": " Stephen", "patch_answer": " Adam", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Cody et Amy sont allés à la maison. Cody a donné un en-cas à", "patch_prefix": "Ensuite, David et Nicholas sont allés à la maison. Eric a donné un en-cas à", "clean_answer": " Amy", "patch_answer": " Cody", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Lisa et Sarah sont allées à la maison. Lisa a donné un baiser à", "patch_prefix": "Ensuite, Gregory et Tyler sont allés à la maison. Daniel a donné un baiser à", "clean_answer": " Sarah", "patch_answer": " Lisa", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Courtney et William sont allés à l'école. Courtney a donné un collier à", "patch_prefix": "Ensuite, Jesse et Sarah sont allés à l'école. Alicia a donné un collier à", "clean_answer": " William", "patch_answer": " Courtney", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Daniel et Elizabeth sont allés à la station. Daniel a donné une boisson à", "patch_prefix": "Ensuite, Heather et Amanda sont allées à la station. Jacob a donné une boisson à", "clean_answer": " Elizabeth", "patch_answer": " Daniel", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Allison et Kimberly sont allées au jardin. Allison a donné un collier à", "patch_prefix": "Ensuite, Nicholas et Jeremy sont allés au jardin. Rebecca a donné un collier à", "clean_answer": " Kimberly", "patch_answer": " Allison", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Adam et Nicholas sont allés au bureau. Adam a donné un en-cas à", "patch_prefix": "Ensuite, Kristen et Courtney sont allées au bureau. Justin a donné un en-cas à", "clean_answer": " Nicholas", "patch_answer": " Adam", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Steven et Brian sont allés au jardin. Steven a donné un ordinateur à", "patch_prefix": "Ensuite, Nicole et Tyler sont allés au jardin. Christopher a donné un ordinateur à", "clean_answer": " Brian", "patch_answer": " Steven", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, James et Michael sont allés au magasin. James a donné un os à", "patch_prefix": "Ensuite, Jacob et Brian sont allés au magasin. Patrick a donné un os à", "clean_answer": " Michael", "patch_answer": " James", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Lauren et Amanda sont allées à l'école. Lauren a donné un baiser à", "patch_prefix": "Ensuite, Brittany et Patrick sont allés à l'école. Brandon a donné un baiser à", "clean_answer": " Amanda", "patch_answer": " Lauren", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Elizabeth et Bradley sont allés au restaurant. Elizabeth a donné un collier à", "patch_prefix": "Ensuite, Travis et Benjamin sont allés au restaurant. Heather a donné un collier à", "clean_answer": " Bradley", "patch_answer": " Elizabeth", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Courtney et Michelle sont allées à l'école. Courtney a donné une bague à", "patch_prefix": "Ensuite, Jonathan et Richard sont allés à l'école. Michael a donné une bague à", "clean_answer": " Michelle", "patch_answer": " Courtney", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Kenneth et Katherine sont allés au bureau. Kenneth a donné un ordinateur à", "patch_prefix": "Ensuite, Samuel et Jeffrey sont allés au bureau. Nicholas a donné un ordinateur à", "clean_answer": " Katherine", "patch_answer": " Kenneth", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jacob et Vanessa sont allés à l'hôpital. Jacob a donné une boisson à", "patch_prefix": "Ensuite, Samuel et Michelle sont allés à l'hôpital. Danielle a donné une boisson à", "clean_answer": " Vanessa", "patch_answer": " Jacob", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Steven et David sont allés au restaurant. Steven a donné un os à", "patch_prefix": "Ensuite, Sarah et Brittany sont allées au restaurant. Tyler a donné un os à", "clean_answer": " David", "patch_answer": " Steven", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Samantha et Joshua sont allés au jardin. Samantha a donné un baiser à", "patch_prefix": "Ensuite, Jeffrey et Mary sont allés au jardin. Amber a donné un baiser à", "clean_answer": " Joshua", "patch_answer": " Samantha", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Tyler et Justin sont allés au bureau. Tyler a donné un collier à", "patch_prefix": "Ensuite, Joshua et Lindsay sont allés au bureau. Bradley a donné un collier à", "clean_answer": " Justin", "patch_answer": " Tyler", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Amy et John sont allés au restaurant. Amy a donné un collier à", "patch_prefix": "Ensuite, Sara et Aaron sont allés au restaurant. Timothy a donné un collier à", "clean_answer": " John", "patch_answer": " Amy", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Eric et Erica sont allés à la station. Eric a donné un ordinateur à", "patch_prefix": "Ensuite, Scott et Tyler sont allés à la station. Sara a donné un ordinateur à", "clean_answer": " Erica", "patch_answer": " Eric", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Benjamin et Jason sont allés à l'école. Benjamin a donné un os à", "patch_prefix": "Ensuite, Nicole et Michelle sont allées à l'école. Vanessa a donné un os à", "clean_answer": " Jason", "patch_answer": " Benjamin", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Steven et Katie sont allés au bureau. Steven a donné un os à", "patch_prefix": "Ensuite, Jeffrey et Shannon sont allés au bureau. Joseph a donné un os à", "clean_answer": " Katie", "patch_answer": " Steven", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Mark et Amber sont allés au jardin. Mark a donné un collier à", "patch_prefix": "Ensuite, Shannon et Timothy sont allés au jardin. Tyler a donné un collier à", "clean_answer": " Amber", "patch_answer": " Mark", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Erica et Patrick sont allés à l'hôpital. Erica a donné un basket-ball à", "patch_prefix": "Ensuite, Vanessa et Crystal sont allées à l'hôpital. Joshua a donné un basket-ball à", "clean_answer": " Patrick", "patch_answer": " Erica", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Thomas et Angela sont allés au magasin. Thomas a donné un os à", "patch_prefix": "Ensuite, Samuel et Kenneth sont allés au magasin. John a donné un os à", "clean_answer": " Angela", "patch_answer": " Thomas", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Angela et Alicia sont allées au bureau. Angela a donné une collation à", "patch_prefix": "Ensuite, Stephanie et Cody sont allés au bureau. Samuel a donné une collation à", "clean_answer": " Alicia", "patch_answer": " Angela", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Steven et Crystal sont allés à l'hôpital. Steven a donné une bague à", "patch_prefix": "Ensuite, Eric et Katherine sont allés à l'hôpital. Matthew a donné une bague à", "clean_answer": " Crystal", "patch_answer": " Steven", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Lauren et Erica sont allées à la maison. Lauren a donné une bague à", "patch_prefix": "Ensuite, Lindsay et Robert sont allés à la maison. Laura a donné une bague à", "clean_answer": " Erica", "patch_answer": " Lauren", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Angela et Katie sont allées au restaurant. Angela a donné un baiser à", "patch_prefix": "Ensuite, Thomas et Katherine sont allés au restaurant. Benjamin a donné un baiser à", "clean_answer": " Katie", "patch_answer": " Angela", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Andrew et Megan sont allés à la station. Andrew a donné un ballon de basket à", "patch_prefix": "Ensuite, Andrea et Gregory sont allés à la station. Stephanie a donné un ballon de basket à", "clean_answer": " Megan", "patch_answer": " Andrew", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Amber et Amy sont allées au bureau. Amber a donné un ordinateur à", "patch_prefix": "Ensuite, Tiffany et Rachel sont allées au bureau. Brian a donné un ordinateur à", "clean_answer": " Amy", "patch_answer": " Amber", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Courtney et Stephanie sont allées à l'hôpital. Courtney a donné un ballon de basket à", "patch_prefix": "Ensuite, Alicia et Kimberly sont allées à l'hôpital. Paul a donné un ballon de basket à", "clean_answer": " Stephanie", "patch_answer": " Courtney", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Alicia et Richard sont allés au restaurant. Alicia a donné un ordinateur à", "patch_prefix": "Ensuite, Jennifer et Tiffany sont allées au restaurant. Joshua a donné un ordinateur à", "clean_answer": " Richard", "patch_answer": " Alicia", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Crystal et Brian sont allés au jardin. Crystal a donné un baiser à", "patch_prefix": "Ensuite, Vanessa et Vanessa sont allées au jardin. Gregory a donné un baiser à", "clean_answer": " Brian", "patch_answer": " Crystal", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Daniel et Sara sont allés au bureau. Daniel a donné un encas à", "patch_prefix": "Ensuite, Benjamin et Matthew sont allés au bureau. Jason a donné un encas à", "clean_answer": " Sara", "patch_answer": " Daniel", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jonathan et Samuel sont allés au magasin. Jonathan a donné un encas à", "patch_prefix": "Ensuite, Kelly et Brandon sont allés au magasin. Cody a donné un encas à", "clean_answer": " Samuel", "patch_answer": " Jonathan", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Joshua et Lindsey sont allés à l'école. Joshua a donné un os à", "patch_prefix": "Ensuite, Anthony et Jamie sont allés à l'école. Christina a donné un os à", "clean_answer": " Lindsey", "patch_answer": " Joshua", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Dustin et Jeffrey sont allés au bureau. Dustin a donné un ordinateur à", "patch_prefix": "Ensuite, Rachel et Kyle sont allés au bureau. Katherine a donné un ordinateur à", "clean_answer": " Jeffrey", "patch_answer": " Dustin", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Kyle et Katherine sont allés à la maison. Kyle a donné un collier à", "patch_prefix": "Ensuite, Bradley et Ashley sont allés à la maison. Ashley a donné un collier à", "clean_answer": " Katherine", "patch_answer": " Kyle", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Thomas et Amber sont allés au bureau. Thomas a donné un baiser à", "patch_prefix": "Ensuite, Jeffrey et Matthew sont allés au bureau. Cody a donné un baiser à", "clean_answer": " Amber", "patch_answer": " Thomas", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jennifer et Jose sont allés au restaurant. Jennifer a donné une boisson à", "patch_prefix": "Ensuite, Michael et Nicole sont allés au restaurant. Bradley a donné une boisson à", "clean_answer": " Jose", "patch_answer": " Jennifer", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Michelle et Jennifer sont allées à l'hôpital. Michelle a donné un os à", "patch_prefix": "Ensuite, Tiffany et Stephanie sont allées à l'hôpital. Sarah a donné un os à", "clean_answer": " Jennifer", "patch_answer": " Michelle", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Ryan et Nicholas sont allés au bureau. Ryan a donné un collier à", "patch_prefix": "Ensuite, Brandon et Tyler sont allés au bureau. Brandon a donné un collier à", "clean_answer": " Nicholas", "patch_answer": " Ryan", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Andrew et Amy sont allés à la station. Andrew a donné un os à", "patch_prefix": "Ensuite, Cody et Kyle sont allés à la station. Andrew a donné un os à", "clean_answer": " Amy", "patch_answer": " Andrew", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Tiffany et Kelly sont allées à l'école. Tiffany a donné un baiser à", "patch_prefix": "Ensuite, Kelly et Jonathan sont allés à l'école. Jeffrey a donné un baiser à", "clean_answer": " Kelly", "patch_answer": " Tiffany", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jonathan et Sarah sont allés au magasin. Jonathan a donné un collier à", "patch_prefix": "Ensuite, Melissa et Ashley sont allées au magasin. Michael a donné un collier à", "clean_answer": " Sarah", "patch_answer": " Jonathan", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Travis et Brandon sont allés au restaurant. Travis a donné une boisson à", "patch_prefix": "Ensuite, Bradley et Megan sont allés au restaurant. Crystal a donné une boisson à", "clean_answer": " Brandon", "patch_answer": " Travis", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Aaron et Vanessa sont allés à l'hôpital. Aaron a donné une boisson à", "patch_prefix": "Ensuite, Sara et Christina sont allées à l'hôpital. Andrea a donné une boisson à", "clean_answer": " Vanessa", "patch_answer": " Aaron", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Megan et Allison sont allées à l'hôpital. Megan a donné un ballon de basket à", "patch_prefix": "Ensuite, Alicia et Amanda sont allées à l'hôpital. Danielle a donné un ballon de basket à", "clean_answer": " Allison", "patch_answer": " Megan", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Amy et Jesse sont allés à l'hôpital. Amy a donné un os à", "patch_prefix": "Ensuite, James et Cody sont allés à l'hôpital. James a donné un os à", "clean_answer": " Jesse", "patch_answer": " Amy", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Shannon et Melissa sont allées à l'hôpital. Shannon a donné un baiser à", "patch_prefix": "Ensuite, Jessica et Scott sont allés à l'hôpital. Brian a donné un baiser à", "clean_answer": " Melissa", "patch_answer": " Shannon", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Mark et Jamie sont allés au bureau. Mark a donné un os à", "patch_prefix": "Ensuite, Kimberly et Tiffany sont allées au bureau. Jeffrey a donné un os à", "clean_answer": " Jamie", "patch_answer": " Mark", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Timothy et Ryan sont allés à l'hôpital. Timothy a donné un os à", "patch_prefix": "Ensuite, Patrick et Bryan sont allés à l'hôpital. Nathan a donné un os à", "clean_answer": " Ryan", "patch_answer": " Timothy", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jacob et Jason sont allés au bureau. Jacob a donné un os à", "patch_prefix": "Ensuite, Brian et Nicholas sont allés au bureau. Alicia a donné un os à", "clean_answer": " Jason", "patch_answer": " Jacob", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Rebecca et Samuel sont allés à la station. Rebecca a donné un collier à", "patch_prefix": "Ensuite, Patrick et Charles sont allés à la station. Lisa a donné un collier à", "clean_answer": " Samuel", "patch_answer": " Rebecca", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Andrea et Jacob sont allés au jardin. Andrea a donné un baiser à", "patch_prefix": "Ensuite, Timothy et Lindsay sont allés au jardin. Amber a donné un baiser à", "clean_answer": " Jacob", "patch_answer": " Andrea", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Sara et Andrew sont allés au restaurant. Sara a donné un ordinateur à", "patch_prefix": "Ensuite, Vanessa et Jacob sont allés au restaurant. Emily a donné un ordinateur à", "clean_answer": " Andrew", "patch_answer": " Sara", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Brian et Brittany sont allés au magasin. Brian a donné un collier à", "patch_prefix": "Ensuite, Thomas et Anthony sont allés au magasin. Megan a donné un collier à", "clean_answer": " Brittany", "patch_answer": " Brian", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Kelly et Joseph sont allés à l'école. Kelly a donné un baiser à", "patch_prefix": "Ensuite, Anthony et Brittany sont allés à l'école. Lindsey a donné un baiser à", "clean_answer": " Joseph", "patch_answer": " Kelly", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jesse et Alicia sont allés à la station. Jesse a donné un ordinateur à", "patch_prefix": "Ensuite, Sean et Melissa sont allés à la station. Samantha a donné un ordinateur à", "clean_answer": " Alicia", "patch_answer": " Jesse", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jose et Ashley sont allés à la station. Jose a donné un ordinateur à", "patch_prefix": "Ensuite, Christopher et Allison sont allés à la station. Rachel a donné un ordinateur à", "clean_answer": " Ashley", "patch_answer": " Jose", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Christine et Richard sont allés au bureau. Christine a donné une boisson à", "patch_prefix": "Ensuite, Matthew et Christopher sont allés au bureau. Patrick a donné une boisson à", "clean_answer": " Richard", "patch_answer": " Christine", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Michelle et Jessica sont allées à l'hôpital. Michelle a donné une boisson à", "patch_prefix": "Ensuite, Matthew et Jeffrey sont allés à l'hôpital. Bradley a donné une boisson à", "clean_answer": " Jessica", "patch_answer": " Michelle", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Ryan et Dustin sont allés au magasin. Ryan a donné une boisson à", "patch_prefix": "Ensuite, Samuel et Brittany sont allés au magasin. Danielle a donné une boisson à", "clean_answer": " Dustin", "patch_answer": " Ryan", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Brandon et Robert sont allés à l'hôpital. Brandon a donné un ballon de basket à", "patch_prefix": "Ensuite, Timothy et Shannon sont allés à l'hôpital. Mark a donné un ballon de basket à", "clean_answer": " Robert", "patch_answer": " Brandon", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Thomas et Rebecca sont allés à la maison. Thomas a donné un ballon de basket à", "patch_prefix": "Ensuite, Jennifer et Katherine sont allées à la maison. Gregory a donné un ballon de basket à", "clean_answer": " Rebecca", "patch_answer": " Thomas", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Charles et Courtney sont allés au restaurant. Charles a donné une bague à", "patch_prefix": "Ensuite, Katie et Jose sont allés au restaurant. Brandon a donné une bague à", "clean_answer": " Courtney", "patch_answer": " Charles", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jesse et Scott sont allés au jardin. Jesse a donné un collier à", "patch_prefix": "Ensuite, Lindsey et Rachel sont allées au jardin. Lisa a donné un collier à", "clean_answer": " Scott", "patch_answer": " Jesse", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Melissa et Erin sont allées au bureau. Melissa a donné un collier à", "patch_prefix": "Ensuite, Mark et Alicia sont allés au bureau. Joshua a donné un collier à", "clean_answer": " Erin", "patch_answer": " Melissa", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, John et Elizabeth sont allés au jardin. John a donné une bague à", "patch_prefix": "Ensuite, Lindsey et Michael sont allés au jardin. Richard a donné une bague à", "clean_answer": " Elizabeth", "patch_answer": " John", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Courtney et Andrea sont allées à la maison. Courtney a donné une collation à", "patch_prefix": "Ensuite, Brian et Kenneth sont allés à la maison. Kristen a donné une collation à", "clean_answer": " Andrea", "patch_answer": " Courtney", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Kyle et Mary sont allés à l'hôpital. Kyle a donné une boisson à", "patch_prefix": "Ensuite, Alicia et John sont allés à l'hôpital. Gregory a donné une boisson à", "clean_answer": " Mary", "patch_answer": " Kyle", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Scott et Rebecca sont allés à l'école. Scott a donné une boisson à", "patch_prefix": "Ensuite, Adam et Vanessa sont allés à l'école. Benjamin a donné une boisson à", "clean_answer": " Rebecca", "patch_answer": " Scott", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Rachel et Andrea sont allées au jardin. Rachel a donné une boisson à", "patch_prefix": "Ensuite, Amber et Jeffrey sont allés au jardin. Justin a donné une boisson à", "clean_answer": " Andrea", "patch_answer": " Rachel", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Alexander et Scott sont allés au magasin. Alexander a donné une bague à", "patch_prefix": "Ensuite, Ashley et Megan sont allées au magasin. Jessica a donné une bague à", "clean_answer": " Scott", "patch_answer": " Alexander", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Cody et Rachel sont allés au jardin. Cody a donné une bague à", "patch_prefix": "Ensuite, Heather et Steven sont allés au jardin. Anthony a donné une bague à", "clean_answer": " Rachel", "patch_answer": " Cody", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Tiffany et Cody sont allés à la station. Tiffany a donné une collation à", "patch_prefix": "Ensuite, Katherine et Amber sont allées à la station. Joseph a donné une collation à", "clean_answer": " Cody", "patch_answer": " Tiffany", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Joshua et Paul sont allés au bureau. Joshua a donné un collier à", "patch_prefix": "Ensuite, Joshua et Danielle sont allés au bureau. Christina a donné un collier à", "clean_answer": " Paul", "patch_answer": " Joshua", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Danielle et Megan sont allées au jardin. Danielle a donné une bague à", "patch_prefix": "Ensuite, Brian et Eric sont allés au jardin. John a donné une bague à", "clean_answer": " Megan", "patch_answer": " Danielle", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Christopher et Alexander sont allés à l'hôpital. Christopher a donné un ballon de basket à", "patch_prefix": "Ensuite, Angela et Aaron sont allés à l'hôpital. Paul a donné un ballon de basket à", "clean_answer": " Alexander", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Joseph et Jacob sont allés à la maison. Joseph a donné une bague à", "patch_prefix": "Ensuite, Adam et David sont allés à la maison. Jeffrey a donné une bague à", "clean_answer": " Jacob", "patch_answer": " Joseph", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Alicia et Joshua sont allés à l'école. Alicia a donné une collation à", "patch_prefix": "Ensuite, Kyle et Timothy sont allés à l'école. Shannon a donné une collation à", "clean_answer": " Joshua", "patch_answer": " Alicia", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Amy et Alexander sont allés au magasin. Amy a donné un ballon de basket à", "patch_prefix": "Ensuite, John et Eric sont allés au magasin. Brandon a donné un ballon de basket à", "clean_answer": " Alexander", "patch_answer": " Amy", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Megan et Angela sont allées au bureau. Megan a donné un os à", "patch_prefix": "Ensuite, Jamie et Jamie sont allées au bureau. Cody a donné un os à", "clean_answer": " Angela", "patch_answer": " Megan", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Erin et Scott sont allés à la station. Erin a donné une boisson à", "patch_prefix": "Ensuite, Tyler et Katherine sont allés à la station. Alicia a donné une boisson à", "clean_answer": " Scott", "patch_answer": " Erin", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Kevin et Charles sont allés au magasin. Kevin a donné un collier à", "patch_prefix": "Ensuite, Matthew et Joseph sont allés au magasin. Kyle a donné un collier à", "clean_answer": " Charles", "patch_answer": " Kevin", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jason et James sont allés au restaurant. Jason a donné une boisson à", "patch_prefix": "Ensuite, Paul et Jesse sont allés au restaurant. Paul a donné une boisson à", "clean_answer": " James", "patch_answer": " Jason", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Christopher et Andrea sont allés au bureau. Christopher a donné un collier à", "patch_prefix": "Ensuite, William et Kenneth sont allés au bureau. Erin a donné un collier à", "clean_answer": " Andrea", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Alexander et Scott sont allés au bureau. Alexander a donné un collier à", "patch_prefix": "Ensuite, Rebecca et Matthew sont allés au bureau. Kelly a donné un collier à", "clean_answer": " Scott", "patch_answer": " Alexander", "case": "BABA_16"},                
    {"clean_prefix": "Ensuite, Nicole et Jeremy sont allés à l'hôpital. Nicole a donné un os à", "patch_prefix": "Ensuite, Jessica et Samuel sont allés à l'hôpital. Jonathan a donné un os à", "clean_answer": " Jeremy", "patch_answer": " Nicole", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Brian et Nathan sont allés au restaurant. Brian a donné un baiser à", "patch_prefix": "Ensuite, Jose et Lisa sont allés au restaurant. Kimberly a donné un baiser à", "clean_answer": " Nathan", "patch_answer": " Brian", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Charles et Brittany sont allés au jardin. Charles a donné un collier à", "patch_prefix": "Ensuite, Bryan et Bryan sont allés au jardin. Anthony a donné un collier à", "clean_answer": " Brittany", "patch_answer": " Charles", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, William et Nicholas sont allés à la station. William a donné une boisson à", "patch_prefix": "Ensuite, Charles et Thomas sont allés à la station. Kristen a donné une boisson à", "clean_answer": " Nicholas", "patch_answer": " William", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Michael et Bradley sont allés au restaurant. Michael a donné une bague à", "patch_prefix": "Ensuite, Brittany et Benjamin sont allés au restaurant. Steven a donné une bague à", "clean_answer": " Bradley", "patch_answer": " Michael", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Mary et Tiffany sont allées à la station. Mary a donné une boisson à", "patch_prefix": "Ensuite, Christine et Kimberly sont allées à la station. Heather a donné une boisson à", "clean_answer": " Tiffany", "patch_answer": " Mary", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Christopher et Jeffrey sont allés à la maison. Christopher a donné un ballon de basket à", "patch_prefix": "Ensuite, Patrick et Katherine sont allés à la maison. Sean a donné un ballon de basket à", "clean_answer": " Jeffrey", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Erica et Eric sont allés au restaurant. Erica a donné un ordinateur à", "patch_prefix": "Ensuite, Erica et Katherine sont allées au restaurant. Amy a donné un ordinateur à", "clean_answer": " Eric", "patch_answer": " Erica", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Brandon et Samuel sont allés à la station. Brandon a donné un collier à", "patch_prefix": "Ensuite, John et David sont allés à la station. Jacob a donné un collier à", "clean_answer": " Samuel", "patch_answer": " Brandon", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Brian et Katie sont allés à la station. Brian a donné une bague à", "patch_prefix": "Ensuite, Melissa et Megan sont allées à la station. David a donné une bague à", "clean_answer": " Katie", "patch_answer": " Brian", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Danielle et William sont allés au restaurant. Danielle a donné une bague à", "patch_prefix": "Ensuite, Andrea et Charles sont allés au restaurant. Steven a donné une bague à", "clean_answer": " William", "patch_answer": " Danielle", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Melissa et Brandon sont allés à l'hôpital. Melissa a donné un ordinateur à", "patch_prefix": "Ensuite, Jason et Jonathan sont allés à l'hôpital. Paul a donné un ordinateur à", "clean_answer": " Brandon", "patch_answer": " Melissa", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Thomas et Amanda sont allés au bureau. Thomas a donné un baiser à", "patch_prefix": "Ensuite, Sara et Bradley sont allés au bureau. Lauren a donné un baiser à", "clean_answer": " Amanda", "patch_answer": " Thomas", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Brittany et Matthew sont allés à la maison. Brittany a donné une collation à", "patch_prefix": "Ensuite, Jeffrey et Lauren sont allés à la maison. Joshua a donné une collation à", "clean_answer": " Matthew", "patch_answer": " Brittany", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Christopher et Jennifer sont allés à la maison. Christopher a donné un collier à", "patch_prefix": "Ensuite, Amy et Jeremy sont allés à la maison. Matthew a donné un collier à", "clean_answer": " Jennifer", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Amber et Jeffrey sont allés à la maison. Amber a donné un baiser à", "patch_prefix": "Ensuite, Timothy et Brian sont allés à la maison. Andrea a donné un baiser à", "clean_answer": " Jeffrey", "patch_answer": " Amber", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Paul et Travis sont allés à l'école. Paul a donné un collier à", "patch_prefix": "Ensuite, Christine et Tyler sont allés à l'école. Robert a donné un collier à", "clean_answer": " Travis", "patch_answer": " Paul", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Tyler et Jeremy sont allés au jardin. Tyler a donné une boisson à", "patch_prefix": "Ensuite, Thomas et Stephen sont allés au jardin. Mary a donné une boisson à", "clean_answer": " Jeremy", "patch_answer": " Tyler", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Robert et Brittany sont allés au restaurant. Robert a donné un ordinateur à", "patch_prefix": "Ensuite, Angela et Jeffrey sont allés au restaurant. Lindsey a donné un ordinateur à", "clean_answer": " Brittany", "patch_answer": " Robert", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Alicia et Kristen sont allées à l'école. Alicia a donné une boisson à", "patch_prefix": "Ensuite, Jamie et Ryan sont allés à l'école. Anthony a donné une boisson à", "clean_answer": " Kristen", "patch_answer": " Alicia", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Joseph et Kelly sont allés au bureau. Joseph a donné un collier à", "patch_prefix": "Ensuite, Daniel et Alicia sont allés au bureau. Thomas a donné un collier à", "clean_answer": " Kelly", "patch_answer": " Joseph", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Emily et Kevin sont allés au jardin. Emily a donné une bague à", "patch_prefix": "Ensuite, Joshua et Michael sont allés au jardin. Jason a donné une bague à", "clean_answer": " Kevin", "patch_answer": " Emily", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Amber et Lauren sont allées à l'hôpital. Amber a donné un baiser à", "patch_prefix": "Ensuite, Amanda et Lindsey sont allées à l'hôpital. Lisa a donné un baiser à", "clean_answer": " Lauren", "patch_answer": " Amber", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Scott et Kyle sont allés au jardin. Scott a donné une boisson à", "patch_prefix": "Ensuite, Tiffany et Joshua sont allés au jardin. James a donné une boisson à", "clean_answer": " Kyle", "patch_answer": " Scott", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Vanessa et Jennifer sont allées au magasin. Vanessa a donné une collation à", "patch_prefix": "Ensuite, Bryan et Nathan sont allés au magasin. Scott a donné une collation à", "clean_answer": " Jennifer", "patch_answer": " Vanessa", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Christina et Vanessa sont allées à la station. Christina a donné une collation à", "patch_prefix": "Ensuite, Matthew et Brandon sont allés à la station. Anthony a donné une collation à", "clean_answer": " Vanessa", "patch_answer": " Christina", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Stephen et Lindsey sont allés à la station. Stephen a donné un ballon de basket à", "patch_prefix": "Ensuite, Daniel et Nathan sont allés à la station. Tiffany a donné un ballon de basket à", "clean_answer": " Lindsey", "patch_answer": " Stephen", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Charles et Rachel sont allés à la maison. Charles a donné un ballon de basket à", "patch_prefix": "Ensuite, Matthew et Kenneth sont allés à la maison. Jose a donné un ballon de basket à", "clean_answer": " Rachel", "patch_answer": " Charles", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Travis et Jeremy sont allés à la station. Travis a donné un collier à", "patch_prefix": "Ensuite, Crystal et Nathan sont allés à la station. Stephanie a donné un collier à", "clean_answer": " Jeremy", "patch_answer": " Travis", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Amy et Angela sont allées à la maison. Amy a donné un ordinateur à", "patch_prefix": "Ensuite, Michelle et William sont allés à la maison. Courtney a donné un ordinateur à", "clean_answer": " Angela", "patch_answer": " Amy", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jennifer et Brittany sont allées au bureau. Jennifer a donné un baiser à", "patch_prefix": "Ensuite, James et Vanessa sont allés au bureau. Brittany a donné un baiser à", "clean_answer": " Brittany", "patch_answer": " Jennifer", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Scott et John sont allés au magasin. Scott a donné un ballon de basket à", "patch_prefix": "Ensuite, Brittany et Courtney sont allées au magasin. Joshua a donné un ballon de basket à", "clean_answer": " John", "patch_answer": " Scott", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Adam et Paul sont allés à la station. Adam a donné un ordinateur à", "patch_prefix": "Ensuite, Vanessa et Andrew sont allés à la station. Erica a donné un ordinateur à", "clean_answer": " Paul", "patch_answer": " Adam", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Michelle et Brandon sont allés à la station. Michelle a donné un baiser à", "patch_prefix": "Ensuite, Bryan et Erin sont allés à la station. Laura a donné un baiser à", "clean_answer": " Brandon", "patch_answer": " Michelle", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Bradley et Elizabeth sont allés au restaurant. Bradley a donné une boisson à", "patch_prefix": "Ensuite, Sean et Brittany sont allés au restaurant. Alicia a donné une boisson à", "clean_answer": " Elizabeth", "patch_answer": " Bradley", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Emily et Kelly sont allées à l'hôpital. Emily a donné une boisson à", "patch_prefix": "Ensuite, Lindsay et Melissa sont allées à l'hôpital. Travis a donné une boisson à", "clean_answer": " Kelly", "patch_answer": " Emily", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Kenneth et Jonathan sont allés à l'hôpital. Kenneth a donné un ordinateur à", "patch_prefix": "Ensuite, James et Sara sont allés à l'hôpital. Adam a donné un ordinateur à", "clean_answer": " Jonathan", "patch_answer": " Kenneth", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Michelle et Crystal sont allées au magasin. Michelle a donné un os à", "patch_prefix": "Ensuite, Lauren et Richard sont allés au magasin. Joseph a donné un os à", "clean_answer": " Crystal", "patch_answer": " Michelle", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Mark et Benjamin sont allés à la maison. Mark a donné une boisson à", "patch_prefix": "Ensuite, Joseph et Rachel sont allés à la maison. Courtney a donné une boisson à", "clean_answer": " Benjamin", "patch_answer": " Mark", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Stephen et Steven sont allés au magasin. Stephen a donné un baiser à", "patch_prefix": "Ensuite, Tiffany et Nicole sont allées au magasin. Kimberly a donné un baiser à", "clean_answer": " Steven", "patch_answer": " Stephen", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Marie et Sarah sont allées à l'école. Marie a donné un os à", "patch_prefix": "Ensuite, Samantha et Alexander sont allés à l'école. Andrew a donné un os à", "clean_answer": " Sarah", "patch_answer": " Marie", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, David et Kenneth sont allés au restaurant. David a donné un ballon de basket à", "patch_prefix": "Ensuite, Kristen et Shannon sont allés au restaurant. Richard a donné un ballon de basket à", "clean_answer": " Kenneth", "patch_answer": " David", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Christopher et Jason sont allés au magasin. Christopher a donné un encas à", "patch_prefix": "Ensuite, Amanda et Daniel sont allés au magasin. Bradley a donné un encas à", "clean_answer": " Jason", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Christopher et Lindsey sont allés à la maison. Christopher a donné un collier à", "patch_prefix": "Ensuite, Jose et Alexander sont allés à la maison. Erin a donné un collier à", "clean_answer": " Lindsey", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Matthew et Laura sont allés à la gare. Matthew a donné un ballon de basket à", "patch_prefix": "Ensuite, Christina et Bryan sont allés à la gare. Justin a donné un ballon de basket à", "clean_answer": " Laura", "patch_answer": " Matthew", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Lisa et Heather sont allées au jardin. Lisa a donné un ballon de basket à", "patch_prefix": "Ensuite, Lindsey et Sean sont allés au jardin. Rebecca a donné un ballon de basket à", "clean_answer": " Heather", "patch_answer": " Lisa", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Vanessa et Ashley sont allées au restaurant. Vanessa a donné un os à", "patch_prefix": "Ensuite, Michael et Rebecca sont allés au restaurant. Elizabeth a donné un os à", "clean_answer": " Ashley", "patch_answer": " Vanessa", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Elizabeth et Joshua sont allés au bureau. Elizabeth a donné un ordinateur à", "patch_prefix": "Ensuite, Jose et Amber sont allés au bureau. Erica a donné un ordinateur à", "clean_answer": " Joshua", "patch_answer": " Elizabeth", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jonathan et Sarah sont allés à la maison. Jonathan a donné un ballon de basket à", "patch_prefix": "Ensuite, Kimberly et Nicholas sont allés à la maison. Stephen a donné un ballon de basket à", "clean_answer": " Sarah", "patch_answer": " Jonathan", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Daniel et Samantha sont allés à la maison. Daniel a donné un baiser à", "patch_prefix": "Ensuite, Courtney et Lindsey sont allées à la maison. Elizabeth a donné un baiser à", "clean_answer": " Samantha", "patch_answer": " Daniel", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Alicia et Amy sont allées à la maison. Alicia a donné un anneau à", "patch_prefix": "Ensuite, Charles et Richard sont allés à la maison. Nicole a donné un anneau à", "clean_answer": " Amy", "patch_answer": " Alicia", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Alicia et Aaron sont allés à la maison. Alicia a donné un os à", "patch_prefix": "Ensuite, Tiffany et Lindsey sont allées à la maison. Ryan a donné un os à", "clean_answer": " Aaron", "patch_answer": " Alicia", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Nicholas et Courtney sont allés à l'école. Nicholas a donné un ordinateur à", "patch_prefix": "Ensuite, Patrick et Christina sont allés à l'école. Mark a donné un ordinateur à", "clean_answer": " Courtney", "patch_answer": " Nicholas", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Kimberly et Kelly sont allées à l'hôpital. Kimberly a donné une boisson à", "patch_prefix": "Ensuite, Dustin et Kevin sont allés à l'hôpital. Melissa a donné une boisson à", "clean_answer": " Kelly", "patch_answer": " Kimberly", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Nicole et Ashley sont allées à l'hôpital. Nicole a donné un ballon de basket à", "patch_prefix": "Ensuite, Rebecca et Stephen sont allés à l'hôpital. Lisa a donné un ballon de basket à", "clean_answer": " Ashley", "patch_answer": " Nicole", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jonathan et Katie sont allées au jardin. Jonathan a donné un collier à", "patch_prefix": "Ensuite, Cody et Amanda sont allés au jardin. Ryan a donné un collier à", "clean_answer": " Katie", "patch_answer": " Jonathan", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Robert et Courtney sont allés à l'école. Robert a donné un anneau à", "patch_prefix": "Ensuite, Scott et Christina sont allés à l'école. Jonathan a donné un anneau à", "clean_answer": " Courtney", "patch_answer": " Robert", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Sean et Ashley sont allés à l'école. Sean a donné un ordinateur à", "patch_prefix": "Ensuite, Amanda et Samuel sont allés à l'école. Kenneth a donné un ordinateur à", "clean_answer": " Ashley", "patch_answer": " Sean", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Charles et Brian sont allés au magasin. Charles a donné un baiser à", "patch_prefix": "Ensuite, Jeffrey et Brandon sont allés au magasin. Courtney a donné un baiser à", "clean_answer": " Brian", "patch_answer": " Charles", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Allison et Lisa sont allées au restaurant. Allison a donné un ordinateur à", "patch_prefix": "Ensuite, Dustin et Richard sont allés au restaurant. Vanessa a donné un ordinateur à", "clean_answer": " Lisa", "patch_answer": " Allison", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Michael et Samuel sont allés à la maison. Michael a donné un ballon de basket à", "patch_prefix": "Ensuite, Matthew et Scott sont allés à la maison. Lauren a donné un ballon de basket à", "clean_answer": " Samuel", "patch_answer": " Michael", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Michael et Sarah sont allés à la station. Michael a donné un baiser à", "patch_prefix": "Ensuite, Thomas et Sara sont allés à la station. Jeremy a donné un baiser à", "clean_answer": " Sarah", "patch_answer": " Michael", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Melissa et William sont allés à l'hôpital. Melissa a donné une boisson à", "patch_prefix": "Ensuite, Heather et Bradley sont allés à l'hôpital. Michelle a donné une boisson à", "clean_answer": " William", "patch_answer": " Melissa", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Erin et Lindsey sont allées à la station. Erin a donné un ordinateur à", "patch_prefix": "Ensuite, Mark et Stephen sont allés à la station. Brandon a donné un ordinateur à", "clean_answer": " Lindsey", "patch_answer": " Erin", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Bryan et Melissa sont allés à l'école. Bryan a donné un os à", "patch_prefix": "Ensuite, Angela et Katherine sont allées à l'école. Mark a donné un os à", "clean_answer": " Melissa", "patch_answer": " Bryan", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Samuel et Mark sont allés au jardin. Samuel a donné une bague à", "patch_prefix": "Ensuite, Steven et Matthew sont allés au jardin. Charles a donné une bague à", "clean_answer": " Mark", "patch_answer": " Samuel", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Stephen et Stephanie sont allés au magasin. Stephen a donné un baiser à", "patch_prefix": "Ensuite, Katherine et Jonathan sont allés au magasin. Gregory a donné un baiser à", "clean_answer": " Stephanie", "patch_answer": " Stephen", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Justin et Melissa sont allés au restaurant. Justin a donné un ballon de basket à", "patch_prefix": "Ensuite, Dustin et Joshua sont allés au restaurant. Joseph a donné un ballon de basket à", "clean_answer": " Melissa", "patch_answer": " Justin", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Eric et Bryan sont allés au magasin. Eric a donné une bague à", "patch_prefix": "Ensuite, Courtney et Kristen sont allées au magasin. Tyler a donné une bague à", "clean_answer": " Bryan", "patch_answer": " Eric", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Kenneth et Amanda sont allés à la maison. Kenneth a donné un ordinateur à", "patch_prefix": "Ensuite, Melissa et Heather sont allées à la maison. Jason a donné un ordinateur à", "clean_answer": " Amanda", "patch_answer": " Kenneth", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Kevin et Erin sont allés au restaurant. Kevin a donné un baiser à", "patch_prefix": "Ensuite, Lindsey et Anthony sont allés au restaurant. Amber a donné un baiser à", "clean_answer": " Erin", "patch_answer": " Kevin", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Timothy et John sont allés à la maison. Timothy a donné un ordinateur à", "patch_prefix": "Ensuite, Cody et Matthew sont allés à la maison. Andrea a donné un ordinateur à", "clean_answer": " John", "patch_answer": " Timothy", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jeffrey et Andrew sont allés au jardin. Jeffrey a donné un os à", "patch_prefix": "Ensuite, Jeffrey et Benjamin sont allés au jardin. Jesse a donné un os à", "clean_answer": " Andrew", "patch_answer": " Jeffrey", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Angela et Jeremy sont allés à l'hôpital. Angela a donné un collier à", "patch_prefix": "Ensuite, Christopher et Christina sont allés à l'hôpital. Paul a donné un collier à", "clean_answer": " Jeremy", "patch_answer": " Angela", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jessica et Allison sont allées au magasin. Jessica a donné une bague à", "patch_prefix": "Ensuite, Melissa et Amanda sont allées au magasin. Mary a donné une bague à", "clean_answer": " Allison", "patch_answer": " Jessica", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Andrew et Lauren sont allés au jardin. Andrew a donné un ordinateur à", "patch_prefix": "Ensuite, Erin et Lisa sont allées au jardin. Kimberly a donné un ordinateur à", "clean_answer": " Lauren", "patch_answer": " Andrew", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Steven et Kevin sont allés au jardin. Steven a donné un os à", "patch_prefix": "Ensuite, Emily et Robert sont allés au jardin. Michelle a donné un os à", "clean_answer": " Kevin", "patch_answer": " Steven", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Kimberly et Jeffrey sont allées au bureau. Kimberly a donné une bague à", "patch_prefix": "Ensuite, Jamie et Jessica sont allées au bureau. Brittany a donné une bague à", "clean_answer": " Jeffrey", "patch_answer": " Kimberly", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Christina et Jeremy sont allés à l'hôpital. Christina a donné une bague à", "patch_prefix": "Ensuite, Jose et Mark sont allés à l'hôpital. Kelly a donné une bague à", "clean_answer": " Jeremy", "patch_answer": " Christina", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Amber et Sean sont allés à l'école. Amber a donné un baiser à", "patch_prefix": "Ensuite, Stephanie et Jennifer sont allées à l'école. Mary a donné un baiser à", "clean_answer": " Sean", "patch_answer": " Amber", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Travis et Kenneth sont allés au jardin. Travis a donné un ordinateur à", "patch_prefix": "Ensuite, Jennifer et Mary sont allées au jardin. Jeffrey a donné un ordinateur à", "clean_answer": " Kenneth", "patch_answer": " Travis", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jamie et Jacob sont allés à la station. Jamie a donné un ballon de basket à", "patch_prefix": "Ensuite, Thomas et Mary sont allés à la station. David a donné un ballon de basket à", "clean_answer": " Jacob", "patch_answer": " Jamie", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Crystal et Laura sont allées au bureau. Crystal a donné un ballon de basket à", "patch_prefix": "Ensuite, Eric et Adam sont allés au bureau. David a donné un ballon de basket à", "clean_answer": " Laura", "patch_answer": " Crystal", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Amy et Jeffrey sont allés à l'hôpital. Amy a donné un ballon de basket à", "patch_prefix": "Ensuite, Vanessa et Samuel sont allés à l'hôpital. Steven a donné un ballon de basket à", "clean_answer": " Jeffrey", "patch_answer": " Amy", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Amy et Daniel sont allés au restaurant. Amy a donné un ballon de basket à", "patch_prefix": "Ensuite, David et Matthew sont allés au restaurant. Alicia a donné un ballon de basket à", "clean_answer": " Daniel", "patch_answer": " Amy", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Amy et Brittany sont allées au jardin. Amy a donné un baiser à", "patch_prefix": "Ensuite, Brittany et Michael sont allés au jardin. Christopher a donné un baiser à", "clean_answer": " Brittany", "patch_answer": " Amy", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Sarah et Kimberly sont allées au bureau. Sarah a donné un encas à", "patch_prefix": "Ensuite, Matthew et Christine sont allés au bureau. Kyle a donné un encas à", "clean_answer": " Kimberly", "patch_answer": " Sarah", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Dustin et Jeremy sont allés au bureau. Dustin a donné un collier à", "patch_prefix": "Ensuite, Alexander et Patrick sont allés au bureau. Alicia a donné un collier à", "clean_answer": " Jeremy", "patch_answer": " Dustin", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Shannon et Matthew sont allés au bureau. Shannon a donné un collier à", "patch_prefix": "Ensuite, Ashley et Michael sont allés au bureau. Michelle a donné un collier à", "clean_answer": " Matthew", "patch_answer": " Shannon", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Vanessa et Ryan sont allés au bureau. Vanessa a donné une bague à", "patch_prefix": "Ensuite, Elizabeth et Jason sont allés au bureau. Joseph a donné une bague à", "clean_answer": " Ryan", "patch_answer": " Vanessa", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Aaron et Lindsay sont allés à l'école. Aaron a donné une bague à", "patch_prefix": "Ensuite, Stephen et Elizabeth sont allés à l'école. Alexander a donné une bague à", "clean_answer": " Lindsay", "patch_answer": " Aaron", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Gregory et Bryan sont allés au bureau. Gregory a donné un collier à", "patch_prefix": "Ensuite, Jessica et Steven sont allés au bureau. Jesse a donné un collier à", "clean_answer": " Bryan", "patch_answer": " Gregory", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Katie et Kyle sont allés au magasin. Katie a donné un collier à", "patch_prefix": "Ensuite, Alicia et Jacob sont allés au magasin. Christina a donné un collier à", "clean_answer": " Kyle", "patch_answer": " Katie", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jonathan et Danielle sont allés au jardin. Jonathan a donné une boisson à", "patch_prefix": "Ensuite, Dustin et Erin sont allés au jardin. Christine a donné une boisson à", "clean_answer": " Danielle", "patch_answer": " Jonathan", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Rebecca et Kristen sont allées au bureau. Rebecca a donné une bague à", "patch_prefix": "Ensuite, Jeffrey et Alicia sont allés au bureau. Shannon a donné une bague à", "clean_answer": " Kristen", "patch_answer": " Rebecca", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Amanda et Nathan sont allés au jardin. Amanda a donné une boisson à", "patch_prefix": "Ensuite, Jason et Kyle sont allés au jardin. Alexander a donné une boisson à", "clean_answer": " Nathan", "patch_answer": " Amanda", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Brandon et Jeremy sont allés à l'hôpital. Brandon a donné une boisson à", "patch_prefix": "Ensuite, Travis et Travis sont allés à l'hôpital. Joshua a donné une boisson à", "clean_answer": " Jeremy", "patch_answer": " Brandon", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Ashley et Sara sont allées à l'école. Ashley a donné un os à", "patch_prefix": "Ensuite, Aaron et Christopher sont allés à l'école. Katherine a donné un os à", "clean_answer": " Sara", "patch_answer": " Ashley", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Stephanie et Jacob sont allés à l'école. Stephanie a donné une bague à", "patch_prefix": "Ensuite, Lauren et Ryan sont allés à l'école. Brittany a donné une bague à", "clean_answer": " Jacob", "patch_answer": " Stephanie", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Stephen et Kelly sont allés à la maison. Stephen a donné un ordinateur à", "patch_prefix": "Ensuite, Nicole et Alexander sont allés à la maison. Christopher a donné un ordinateur à", "clean_answer": " Kelly", "patch_answer": " Stephen", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Sean et Charles sont allés à l'hôpital. Sean a donné une boisson à", "patch_prefix": "Ensuite, Matthew et Benjamin sont allés à l'hôpital. Shannon a donné une boisson à", "clean_answer": " Charles", "patch_answer": " Sean", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jennifer et Bradley sont allés au bureau. Jennifer a donné une boisson à", "patch_prefix": "Ensuite, Stephen et Stephanie sont allés au bureau. Amy a donné une boisson à", "clean_answer": " Bradley", "patch_answer": " Jennifer", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Mary et Daniel sont allés à la maison. Mary a donné un os à", "patch_prefix": "Ensuite, Tiffany et David sont allés à la maison. Sarah a donné un os à", "clean_answer": " Daniel", "patch_answer": " Mary", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Christopher et Laura sont allés à la maison. Christopher a donné un ballon de basket à", "patch_prefix": "Ensuite, Sean et Jeffrey sont allés à la maison. David a donné un ballon de basket à", "clean_answer": " Laura", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Anthony et Jessica sont allés à l'hôpital. Anthony a donné un baiser à", "patch_prefix": "Ensuite, Sean et James sont allés à l'hôpital. Benjamin a donné un baiser à", "clean_answer": " Jessica", "patch_answer": " Anthony", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, James et Kyle sont allés au restaurant. James a donné un ballon de basket à", "patch_prefix": "Ensuite, Matthew et Joshua sont allés au restaurant. Paul a donné un ballon de basket à", "clean_answer": " Kyle", "patch_answer": " James", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Aaron et Rachel sont allés à l'hôpital. Aaron a donné un ballon de basket à", "patch_prefix": "Ensuite, Lauren et Daniel sont allés à l'hôpital. Brittany a donné un ballon de basket à", "clean_answer": " Rachel", "patch_answer": " Aaron", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jesse et Lisa sont allés à l'hôpital. Jesse a donné un os à", "patch_prefix": "Ensuite, Mark et Tyler sont allés à l'hôpital. Jennifer a donné un os à", "clean_answer": " Lisa", "patch_answer": " Jesse", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Tiffany et Lauren sont allés à l'hôpital. Tiffany a donné un collier à", "patch_prefix": "Ensuite, Nicholas et Justin sont allés à l'hôpital. Laura a donné un collier à", "clean_answer": " Lauren", "patch_answer": " Tiffany", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Joshua et Lisa sont allés à la station. Joshua a donné un collier à", "patch_prefix": "Ensuite, Erin et Christine sont allés à la station. Jose a donné un collier à", "clean_answer": " Lisa", "patch_answer": " Joshua", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Stephen et Andrea sont allés à la maison. Stephen a donné un ballon de basket à", "patch_prefix": "Ensuite, Amanda et Robert sont allés à la maison. Joshua a donné un ballon de basket à", "clean_answer": " Andrea", "patch_answer": " Stephen", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Kelly et Rachel sont allés à l'école. Kelly a donné un ballon de basket à", "patch_prefix": "Ensuite, Brittany et Crystal sont allés à l'école. Katie a donné un ballon de basket à", "clean_answer": " Rachel", "patch_answer": " Kelly", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Tiffany et Jamie sont allés au magasin. Tiffany a donné un ordinateur à", "patch_prefix": "Ensuite, Brian et Tyler sont allés au magasin. Matthew a donné un ordinateur à", "clean_answer": " Jamie", "patch_answer": " Tiffany", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Nicholas et Megan sont allés à l'école. Nicholas a donné un ballon de basket à", "patch_prefix": "Ensuite, Tiffany et Robert sont allés à l'école. Heather a donné un ballon de basket à", "clean_answer": " Megan", "patch_answer": " Nicholas", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Nicole et Crystal sont allés à l'école. Nicole a donné un ballon de basket à", "patch_prefix": "Ensuite, Aaron et Michelle sont allés à l'école. Steven a donné un ballon de basket à", "clean_answer": " Crystal", "patch_answer": " Nicole", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Vanessa et Samuel sont allés à l'école. Vanessa a donné une bague à", "patch_prefix": "Ensuite, Kevin et Charles sont allés à l'école. Joseph a donné une bague à", "clean_answer": " Samuel", "patch_answer": " Vanessa", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Robert et Danielle sont allés à l'hôpital. Robert a donné un ordinateur à", "patch_prefix": "Ensuite, Amy et Matthew sont allés à l'hôpital. Jason a donné un ordinateur à", "clean_answer": " Danielle", "patch_answer": " Robert", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Robert et Sarah sont allés au magasin. Robert a donné un ballon de basket à", "patch_prefix": "Ensuite, Christopher et Elizabeth sont allés au magasin. Amber a donné un ballon de basket à", "clean_answer": " Sarah", "patch_answer": " Robert", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Benjamin et Brittany sont allés à l'hôpital. Benjamin a donné un ballon de basket à", "patch_prefix": "Ensuite, Ryan et Andrea sont allés à l'hôpital. Ryan a donné un ballon de basket à", "clean_answer": " Brittany", "patch_answer": " Benjamin", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, David et Andrea sont allés à l'école. David a donné un os à", "patch_prefix": "Ensuite, Erin et Bradley sont allés à l'école. Jeremy a donné un os à", "clean_answer": " Andrea", "patch_answer": " David", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Erica et Scott sont allés à la station. Erica a donné un ordinateur à", "patch_prefix": "Ensuite, Nicholas et Adam sont allés à la station. Danielle a donné un ordinateur à", "clean_answer": " Scott", "patch_answer": " Erica", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Sara et Brittany sont allées au jardin. Sara a donné un ordinateur à", "patch_prefix": "Ensuite, Michael et Rebecca sont allés au jardin. Kenneth a donné un ordinateur à", "clean_answer": " Brittany", "patch_answer": " Sara", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jeffrey et Mary sont allés au restaurant. Jeffrey a donné un ordinateur à", "patch_prefix": "Ensuite, Crystal et Sara sont allées au restaurant. Jennifer a donné un ordinateur à", "clean_answer": " Mary", "patch_answer": " Jeffrey", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Patrick et Brittany sont allés à la maison. Patrick a donné un collier à", "patch_prefix": "Ensuite, Rachel et Jacob sont allés à la maison. Lindsey a donné un collier à", "clean_answer": " Brittany", "patch_answer": " Patrick", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Brittany et Jeffrey sont allés à la station. Brittany a donné un basket à", "patch_prefix": "Ensuite, Jessica et Melissa sont allées à la station. Angela a donné un basket à", "clean_answer": " Jeffrey", "patch_answer": " Brittany", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Erin et Jennifer sont allées au restaurant. Erin a donné un baiser à", "patch_prefix": "Ensuite, Adam et Stephen sont allés au restaurant. Christine a donné un baiser à", "clean_answer": " Jennifer", "patch_answer": " Erin", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Heather et Samantha sont allées au jardin. Heather a donné un baiser à", "patch_prefix": "Ensuite, Joseph et Richard sont allés au jardin. Vanessa a donné un baiser à", "clean_answer": " Samantha", "patch_answer": " Heather", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Benjamin et Ryan sont allés à l'école. Benjamin a donné un en-cas à", "patch_prefix": "Ensuite, Andrea et Heather sont allées à l'école. Lauren a donné un en-cas à", "clean_answer": " Ryan", "patch_answer": " Benjamin", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Vanessa et Angela sont allées au jardin. Vanessa a donné une bague à", "patch_prefix": "Ensuite, Robert et Heather sont allés au jardin. Bryan a donné une bague à", "clean_answer": " Angela", "patch_answer": " Vanessa", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Rebecca et Melissa sont allées au restaurant. Rebecca a donné un ordinateur à", "patch_prefix": "Ensuite, Jennifer et Elizabeth sont allées au restaurant. Elizabeth a donné un ordinateur à", "clean_answer": " Melissa", "patch_answer": " Rebecca", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, David et Rachel sont allés à l'école. David a donné une bague à", "patch_prefix": "Ensuite, Joshua et Lindsay sont allés à l'école. Kevin a donné une bague à", "clean_answer": " Rachel", "patch_answer": " David", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Kimberly et Michelle sont allées à l'école. Kimberly a donné un basket à", "patch_prefix": "Ensuite, Rachel et Stephanie sont allées à l'école. Angela a donné un basket à", "clean_answer": " Michelle", "patch_answer": " Kimberly", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jessica et Laura sont allées au jardin. Jessica a donné une bague à", "patch_prefix": "Ensuite, Christina et Andrea sont allées au jardin. Alicia a donné une bague à", "clean_answer": " Laura", "patch_answer": " Jessica", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Richard et Eric sont allés au jardin. Richard a donné une boisson à", "patch_prefix": "Ensuite, Joshua et Thomas sont allés au jardin. Lisa a donné une boisson à", "clean_answer": " Eric", "patch_answer": " Richard", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Brandon et Eric sont allés à l'école. Brandon a donné un en-cas à", "patch_prefix": "Ensuite, Jeremy et Erin sont allés à l'école. Stephanie a donné un en-cas à", "clean_answer": " Eric", "patch_answer": " Brandon", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Lauren et Matthew sont allés au jardin. Lauren a donné une boisson à", "patch_prefix": "Ensuite, Michelle et Scott sont allés au jardin. Ashley a donné une boisson à", "clean_answer": " Matthew", "patch_answer": " Lauren", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, James et Sarah sont allés à l'hôpital. James a donné un ordinateur à", "patch_prefix": "Ensuite, Amy et Angela sont allées à l'hôpital. Michael a donné un ordinateur à", "clean_answer": " Sarah", "patch_answer": " James", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, James et Daniel sont allés au magasin. James a donné un collier à", "patch_prefix": "Ensuite, Stephanie et Aaron sont allés au magasin. Dustin a donné un collier à", "clean_answer": " Daniel", "patch_answer": " James", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Samuel et Steven sont allés à l'école. Samuel a donné un ordinateur à", "patch_prefix": "Ensuite, Jose et Jeffrey sont allés à l'école. Kelly a donné un ordinateur à", "clean_answer": " Steven", "patch_answer": " Samuel", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Christopher et Gregory sont allés à la maison. Christopher a donné un ordinateur à", "patch_prefix": "Ensuite, Jeremy et Amy sont allés à la maison. James a donné un ordinateur à", "clean_answer": " Gregory", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jennifer et Jessica sont allées au restaurant. Jennifer a donné une collation à", "patch_prefix": "Ensuite, Amanda et Angela sont allées au restaurant. Paul a donné une collation à", "clean_answer": " Jessica", "patch_answer": " Jennifer", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Mary et Eric sont allés au bureau. Mary a donné un ordinateur à", "patch_prefix": "Ensuite, Timothy et Nathan sont allés au bureau. Brandon a donné un ordinateur à", "clean_answer": " Eric", "patch_answer": " Mary", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Kevin et Steven sont allés au bureau. Kevin a donné un ordinateur à", "patch_prefix": "Ensuite, Paul et Sean sont allés au bureau. Heather a donné un ordinateur à", "clean_answer": " Steven", "patch_answer": " Kevin", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Stephanie et Lindsey sont allées à l'école. Stephanie a donné un ordinateur à", "patch_prefix": "Ensuite, Ashley et Jennifer sont allées à l'école. Lauren a donné un ordinateur à", "clean_answer": " Lindsey", "patch_answer": " Stephanie", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Aaron et Dustin sont allés au jardin. Aaron a donné un ballon de basket à", "patch_prefix": "Ensuite, Samuel et Emily sont allés au jardin. Paul a donné un ballon de basket à", "clean_answer": " Dustin", "patch_answer": " Aaron", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Alexander et David sont allés à l'école. Alexander a donné une boisson à", "patch_prefix": "Ensuite, Andrew et Kimberly sont allés à l'école. Steven a donné une boisson à", "clean_answer": " David", "patch_answer": " Alexander", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Crystal et Andrea sont allées au restaurant. Crystal a donné une boisson à", "patch_prefix": "Ensuite, Kristen et Sean sont allés au restaurant. Timothy a donné une boisson à", "clean_answer": " Andrea", "patch_answer": " Crystal", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Ashley et Elizabeth sont allées à la station. Ashley a donné une collation à", "patch_prefix": "Ensuite, Jeremy et Brandon sont allés à la station. Samuel a donné une collation à", "clean_answer": " Elizabeth", "patch_answer": " Ashley", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Amber et Jesse sont allés au restaurant. Amber a donné un ordinateur à", "patch_prefix": "Ensuite, Andrea et Patrick sont allés au restaurant. Jacob a donné un ordinateur à", "clean_answer": " Jesse", "patch_answer": " Amber", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Nathan et Nicholas sont allés à l'hôpital. Nathan a donné un ballon de basket à", "patch_prefix": "Ensuite, Benjamin et Samantha sont allés à l'hôpital. Lindsay a donné un ballon de basket à", "clean_answer": " Nicholas", "patch_answer": " Nathan", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Andrew et Rebecca sont allés à la station. Andrew a donné un collier à", "patch_prefix": "Ensuite, Christine et Robert sont allés à la station. Heather a donné un collier à", "clean_answer": " Rebecca", "patch_answer": " Andrew", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jamie et Rachel sont allées au magasin. Jamie a donné un ballon de basket à", "patch_prefix": "Ensuite, Nathan et Megan sont allés au magasin. Aaron a donné un ballon de basket à", "clean_answer": " Rachel", "patch_answer": " Jamie", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Sara et Kimberly sont allées au bureau. Sara a donné un collier à", "patch_prefix": "Ensuite, Danielle et James sont allés au bureau. Rebecca a donné un collier à", "clean_answer": " Kimberly", "patch_answer": " Sara", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Nicole et Rachel sont allées au magasin. Nicole a donné une boisson à", "patch_prefix": "Ensuite, Shannon et William sont allés au magasin. Megan a donné une boisson à", "clean_answer": " Rachel", "patch_answer": " Nicole", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Brandon et Katherine sont allés au magasin. Brandon a donné un os à", "patch_prefix": "Ensuite, Jessica et Jeremy sont allés au magasin. Matthew a donné un os à", "clean_answer": " Katherine", "patch_answer": " Brandon", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Eric et Anthony sont allés au restaurant. Eric a donné un ordinateur à", "patch_prefix": "Ensuite, Brian et Jennifer sont allés au restaurant. Rachel a donné un ordinateur à", "clean_answer": " Anthony", "patch_answer": " Eric", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jacob et Jason sont allés au restaurant. Jacob a donné un ballon de basket à", "patch_prefix": "Ensuite, Benjamin et Travis sont allés au restaurant. Kristen a donné un ballon de basket à", "clean_answer": " Jason", "patch_answer": " Jacob", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Patrick et Kristen sont allés au magasin. Patrick a donné une boisson à", "patch_prefix": "Ensuite, Sara et Vanessa sont allées au magasin. Jeffrey a donné une boisson à", "clean_answer": " Kristen", "patch_answer": " Patrick", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Christopher et Matthew sont allés à l'hôpital. Christopher a donné un os à", "patch_prefix": "Ensuite, Timothy et Joshua sont allés à l'hôpital. Charles a donné un os à", "clean_answer": " Matthew", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Steven et Ashley sont allés au magasin. Steven a donné un ordinateur à", "patch_prefix": "Ensuite, Kenneth et Scott sont allés au magasin. Jonathan a donné un ordinateur à", "clean_answer": " Ashley", "patch_answer": " Steven", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Erica et Jonathan sont allés à la maison. Erica a donné un collier à", "patch_prefix": "Ensuite, Lindsay et Andrea sont allées à la maison. Jason a donné un collier à", "clean_answer": " Jonathan", "patch_answer": " Erica", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Sean et Dustin sont allés au restaurant. Sean a donné une boisson à", "patch_prefix": "Ensuite, Timothy et Thomas sont allés au restaurant. Michael a donné une boisson à", "clean_answer": " Dustin", "patch_answer": " Sean", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Samantha et Ryan sont allés à la station. Samantha a donné une boisson à", "patch_prefix": "Ensuite, Joshua et Dustin sont allés à la station. Joseph a donné une boisson à", "clean_answer": " Ryan", "patch_answer": " Samantha", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Danielle et Brittany sont allées à l'hôpital. Danielle a donné un collier à", "patch_prefix": "Ensuite, Michelle et Justin sont allés à l'hôpital. Bryan a donné un collier à", "clean_answer": " Brittany", "patch_answer": " Danielle", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Ryan et Cody sont allés au magasin. Ryan a donné un os à", "patch_prefix": "Ensuite, Eric et Kristen sont allés au magasin. Daniel a donné un os à", "clean_answer": " Cody", "patch_answer": " Ryan", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Lindsay et Steven sont allés à la maison. Lindsay a donné un collier à", "patch_prefix": "Ensuite, Lindsay et Jonathan sont allés à la maison. Christina a donné un collier à", "clean_answer": " Steven", "patch_answer": " Lindsay", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, David et James sont allés au bureau. David a donné un os à", "patch_prefix": "Ensuite, Kyle et Mary sont allés au bureau. Thomas a donné un os à", "clean_answer": " James", "patch_answer": " David", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Andrea et Kyle sont allés à l'école. Andrea a donné un collier à", "patch_prefix": "Ensuite, Elizabeth et Joseph sont allés à l'école. Laura a donné un collier à", "clean_answer": " Kyle", "patch_answer": " Andrea", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jason et Anthony sont allés à la station. Jason a donné une boisson à", "patch_prefix": "Ensuite, Jessica et Nathan sont allés à la station. Anthony a donné une boisson à", "clean_answer": " Anthony", "patch_answer": " Jason", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Kevin et James sont allés à la maison. Kevin a donné un collier à", "patch_prefix": "Ensuite, Lindsey et Jason sont allés à la maison. Alicia a donné un collier à", "clean_answer": " James", "patch_answer": " Kevin", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Bryan et Bradley sont allés au restaurant. Bryan a donné un collier à", "patch_prefix": "Ensuite, Justin et Anthony sont allés au restaurant. Charles a donné un collier à", "clean_answer": " Bradley", "patch_answer": " Bryan", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Elizabeth et Brandon sont allés au restaurant. Elizabeth a donné une collation à", "patch_prefix": "Ensuite, Jamie et Erin sont allés au restaurant. Richard a donné une collation à", "clean_answer": " Brandon", "patch_answer": " Elizabeth", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Jessica et Jennifer sont allées à la maison. Jessica a donné un os à", "patch_prefix": "Ensuite, Jason et Joseph sont allés à la maison. Brian a donné un os à", "clean_answer": " Jennifer", "patch_answer": " Jessica", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Bryan et Elizabeth sont allés à la maison. Bryan a donné un os à", "patch_prefix": "Ensuite, Amber et Richard sont allés à la maison. Tyler a donné un os à", "clean_answer": " Elizabeth", "patch_answer": " Bryan", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Joshua et Jose sont allés à l'école. Joshua a donné un baiser à", "patch_prefix": "Ensuite, Ashley et Amy sont allées à l'école. Lisa a donné un baiser à", "clean_answer": " Jose", "patch_answer": " Joshua", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Katherine et Adam sont allés au jardin. Katherine a donné une bague à", "patch_prefix": "Ensuite, Ashley et Aaron sont allés au jardin. Justin a donné une bague à", "clean_answer": " Adam", "patch_answer": " Katherine", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Sarah et Megan sont allées au bureau. Sarah a donné une boisson à", "patch_prefix": "Ensuite, Justin et Rebecca sont allés au bureau. Katherine a donné une boisson à", "clean_answer": " Megan", "patch_answer": " Sarah", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Kyle et Christina sont allés au magasin. Kyle a donné un os à", "patch_prefix": "Ensuite, James et Cody sont allés au magasin. Jamie a donné un os à", "clean_answer": " Christina", "patch_answer": " Kyle", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Richard et Jeffrey sont allés au restaurant. Richard a donné une collation à", "patch_prefix": "Ensuite, Michelle et Lindsay sont allées au restaurant. Matthew a donné une collation à", "clean_answer": " Jeffrey", "patch_answer": " Richard", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, William et Benjamin sont allés à la station. William a donné un os à", "patch_prefix": "Ensuite, Lindsey et Erica sont allées à la station. William a donné un os à", "clean_answer": " Benjamin", "patch_answer": " William", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, John et Vanessa sont allés à la station. John a donné un os à", "patch_prefix": "Ensuite, Steven et Amanda sont allés à la station. Jeffrey a donné un os à", "clean_answer": " Vanessa", "patch_answer": " John", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Scott et Amber sont allés au jardin. Scott a donné un ordinateur à", "patch_prefix": "Ensuite, Matthew et Anthony sont allés au jardin. Sean a donné un ordinateur à", "clean_answer": " Amber", "patch_answer": " Scott", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Amber et Kevin sont allés au jardin. Amber a donné une boisson à", "patch_prefix": "Ensuite, Daniel et Jason sont allés au jardin. Bradley a donné une boisson à", "clean_answer": " Kevin", "patch_answer": " Amber", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Timothy et Christine sont allés à l'hôpital. Timothy a donné une boisson à", "patch_prefix": "Ensuite, Shannon et Sara sont allés à l'hôpital. Nicole a donné une boisson à", "clean_answer": " Christine", "patch_answer": " Timothy", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Alexander et Anthony sont allés à l'école. Alexander a donné un collier à", "patch_prefix": "Ensuite, Thomas et Tyler sont allés à l'école. Angela a donné un collier à", "clean_answer": " Anthony", "patch_answer": " Alexander", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Heather et Rachel sont allées à la maison. Heather a donné une boisson à", "patch_prefix": "Ensuite, Travis et Rebecca sont allés à la maison. Courtney a donné une boisson à", "clean_answer": " Rachel", "patch_answer": " Heather", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Joshua et Amber sont allés au jardin. Joshua a donné un baiser à", "patch_prefix": "Ensuite, Richard et Amanda sont allés au jardin. Sarah a donné un baiser à", "clean_answer": " Amber", "patch_answer": " Joshua", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Joshua et Courtney sont allés au restaurant. Joshua a donné une boisson à", "patch_prefix": "Ensuite, Nathan et Benjamin sont allés au restaurant. Alexander a donné une boisson à", "clean_answer": " Courtney", "patch_answer": " Joshua", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Christopher et Jonathan sont allés à la station. Christopher a donné un ordinateur à", "patch_prefix": "Ensuite, Matthew et Andrea sont allés à la station. Mary a donné un ordinateur à", "clean_answer": " Jonathan", "patch_answer": " Christopher", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Ryan et Jonathan sont allés au restaurant. Ryan a donné une collation à", "patch_prefix": "Ensuite, Samantha et Christine sont allées au restaurant. Jesse a donné une collation à", "clean_answer": " Jonathan", "patch_answer": " Ryan", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Erica et Christopher sont allés à l'hôpital. Erica a donné un basket-ball à", "patch_prefix": "Ensuite, Nicole et Crystal sont allées à l'hôpital. Nicole a donné un basket-ball à", "clean_answer": " Christopher", "patch_answer": " Erica", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Eric et Sean sont allés à la maison. Eric a donné une collation à", "patch_prefix": "Ensuite, Emily et William sont allés à la maison. Kristen a donné une collation à", "clean_answer": " Sean", "patch_answer": " Eric", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Alexander et Jamie sont allés au magasin. Alexander a donné une boisson à", "patch_prefix": "Ensuite, Matthew et Patrick sont allés au magasin. Melissa a donné une boisson à", "clean_answer": " Jamie", "patch_answer": " Alexander", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Courtney et Jennifer sont allées à la maison. Courtney a donné un ordinateur à", "patch_prefix": "Ensuite, Heather et Brian sont allés à la maison. Amber a donné un ordinateur à", "clean_answer": " Jennifer", "patch_answer": " Courtney", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Daniel et Jessica sont allés au magasin. Daniel a donné un collier à", "patch_prefix": "Ensuite, Angela et David sont allés au magasin. Christina a donné un collier à", "clean_answer": " Jessica", "patch_answer": " Daniel", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Samuel et Richard sont allés à la maison. Samuel a donné une collation à", "patch_prefix": "Ensuite, Erin et Sarah sont allées à la maison. Emily a donné une collation à", "clean_answer": " Richard", "patch_answer": " Samuel", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Scott et Lindsey sont allés à l'hôpital. Scott a donné une boisson à", "patch_prefix": "Ensuite, Alexander et Kyle sont allés à l'hôpital. Christine a donné une boisson à", "clean_answer": " Lindsey", "patch_answer": " Scott", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Timothy et Nathan sont allés au magasin. Timothy a donné un ordinateur à", "patch_prefix": "Ensuite, Brittany et Adam sont allés au magasin. Kimberly a donné un ordinateur à", "clean_answer": " Nathan", "patch_answer": " Timothy", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Alicia et Jeremy sont allés au bureau. Alicia a donné une boisson à", "patch_prefix": "Ensuite, Kelly et Christina sont allées au bureau. Samuel a donné une boisson à", "clean_answer": " Jeremy", "patch_answer": " Alicia", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Katherine et Jeremy sont allés à l'école. Katherine a donné un baiser à", "patch_prefix": "Ensuite, Elizabeth et Patrick sont allés à l'école. Vanessa a donné un baiser à", "clean_answer": " Jeremy", "patch_answer": " Katherine", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Charles et Steven sont allés au restaurant. Charles a donné un ordinateur à", "patch_prefix": "Ensuite, Bryan et Megan sont allés au restaurant. Tiffany a donné un ordinateur à", "clean_answer": " Steven", "patch_answer": " Charles", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Joshua et Thomas sont allés à l'école. Joshua a donné un collier à", "patch_prefix": "Ensuite, Jeffrey et Paul sont allés à l'école. Ashley a donné un collier à", "clean_answer": " Thomas", "patch_answer": " Joshua", "case": "BABA_16"},
    {"clean_prefix": "Ensuite, Kevin et Joseph sont allés à la station. Kevin a donné un ordinateur à", "patch_prefix": "Ensuite, Samantha et Jason sont allés à la station. Lauren a donné un ordinateur à", "clean_answer": " Joseph", "patch_answer": " Kevin", "case": "BABA_16"}            
]
